{"research_topic_id":"1.1","research_topic_title":"Verification Bias in Celiac Disease IgA-tTG2 Testing","date_completed":"2026-02-07","version":"2.0 — revised after peer review by Claude 4.5 and Grok 4.1","executive_summary":"Verification bias inflates the widely cited ~93% sensitivity of IgA-tTG2 for celiac disease by an estimated 5–25 percentage points, with population-weighted true sensitivity likely in the range of 70–85% for Marsh 3+ disease and substantially lower for milder histology. The sole formal bias correction (Hujoel et al. 2021, PMID 32433257) yielded an adjusted sensitivity of 57.1% (95% CI: 35.4–76.4%), which likely overcorrects due to methodological fragility but whose directional finding is robust and corroborated by all-biopsy studies showing 85–91% sensitivity in tertiary populations. No major clinical guideline names verification bias or cites bias-adjusted estimates, representing a consequential epistemic gap that disproportionately harms patients with mild histology (Marsh 3a), atypical genotypes (DQ8), or unusual immune profiles.","key_findings":[{"finding_id":"1.1.1","finding":"IgA-tTG2 sensitivity drops from 92.6% to 57.1% when corrected for verification bias using the Begg-Greenes method. The point estimate is methodologically fragile (sparse false negatives cause instability per Cronin-Vickers 2008), but the direction of bias is robust: every unbiased or less-biased study design yields lower sensitivity than the guideline figure.","evidence_strength":"strong","quantitative_estimate":"57.1% adjusted sensitivity (point estimate); true population-weighted sensitivity likely 70–85%","confidence_interval":"95% CI: 35.4–76.4% (Hujoel); reconciled range 70–85% based on triangulation with all-biopsy studies","key_citations":["PMID:32433257","PMID:19014457"],"contradicts_guidelines":true,"affected_patient_population":"All CD patients undergoing serology-first screening"},{"finding_id":"1.1.2","finding":"Differential biopsy referral creates a 22-fold verification gap: 79% of seropositive vs 3.6% of seronegative patients receive confirmatory biopsy. This asymmetry is the structural mechanism of verification bias and renders sensitivity estimates from serology-first cohorts inherently unreliable.","evidence_strength":"strong","quantitative_estimate":"79% vs 3.6% biopsy rates; 22-fold differential","confidence_interval":"Seropositive: 65.0–88.7%; Seronegative: 1.1–10.9%","key_citations":["PMID:32433257"],"contradicts_guidelines":true,"affected_patient_population":"Seronegative patients systematically denied diagnostic opportunity"},{"finding_id":"1.1.3","finding":"Sensitivity varies dramatically by Marsh grade, declining from ~96% for Marsh 3c (total VA) to 50–70% for Marsh 3a (partial VA) and <10% for Marsh 1. This gradient means serology systematically misses the earliest and mildest disease — precisely where intervention has the most preventive value.","evidence_strength":"strong","quantitative_estimate":"Marsh 3c: ~96%; Marsh 3a: 50–70% (tTG2) / 33% (EMA); Marsh 1: 7.7%","confidence_interval":null,"key_citations":["PMID:12590232","PMID:15185855"],"contradicts_guidelines":true,"affected_patient_population":"Patients with mild/early CD (Marsh 1–3a), estimated 20–40% of all CD"},{"finding_id":"1.1.4","finding":"Adult-specific bias-adjusted sensitivity (47.5%) is lower than pediatric (60.7%), though both estimates carry very wide confidence intervals. Seronegative CD is essentially absent in pediatric populations (0% in large Finnish/Romanian cohort) but present in 2–15% of adult CD patients.","evidence_strength":"moderate","quantitative_estimate":"Adults: 47.5% adjusted; Pediatric: 60.7% adjusted; SNCD: 0% pediatric vs 2–15% adult","confidence_interval":"Adults: 25.3–70.8%; Pediatric: 18.6–91.3%","key_citations":["PMID:32433257","PMID:31210940"],"contradicts_guidelines":true,"affected_patient_population":"Adult CD patients, particularly elderly-onset (median age 56 in SNCD cohorts)"},{"finding_id":"1.1.5","finding":"The best 'all-biopsy' study (Hopper et al. 2008) found IgA-tTG2 sensitivity of 90.9% with ~9% seronegative CD. However, this is an upper bound rather than ground truth: the population was consecutive tertiary gastroscopy referrals enriched for severe/symptomatic disease where serology performs best. Biagi et al. (2006), also all-biopsy but in suspected CD, found 85% sensitivity with 15.2% seronegative CD.","evidence_strength":"moderate","quantitative_estimate":"90.9% (Hopper, upper bound) to 85% (Biagi); 9–15% seronegative CD in unbiased designs","confidence_interval":null,"key_citations":["PMID:18328437","PMID:16574764"],"contradicts_guidelines":true,"affected_patient_population":"All CD patients; estimates from less-biased designs consistently lower than guideline figures"},{"finding_id":"1.1.6","finding":"Biagi et al. demonstrated that intestinal biopsy culture supernatant anti-tTG2 testing rescued 24 of 29 seronegative CD cases, raising sensitivity to 98%. This provides a mechanistic explanation for seronegativity: antibodies are produced locally in the mucosa but fail to reach systemic circulation in sufficient quantity. This supports seronegativity as a biological reality, not merely a diagnostic artifact.","evidence_strength":"moderate","quantitative_estimate":"82.8% (24/29) rescue rate for seronegative cases via mucosal antibody testing","confidence_interval":null,"key_citations":["PMID:16574764"],"contradicts_guidelines":false,"affected_patient_population":"Seronegative CD patients; suggests mucosal-only antibody production phenotype"},{"finding_id":"1.1.7","finding":"Seronegative villous atrophy (SNVA) is 28–45% attributable to seronegative CD (the most common single cause), with the remainder due to non-celiac enteropathies (CVID ~16%, giardiasis ~20%, drug-induced ~10%, autoimmune enteropathy ~10%). The Paris Consensus (2022) strict criteria yield 1.7–6.4% SNCD among all CD, but these criteria require ≥12 months GFD response and exhaustive differential exclusion, potentially undercounting cases that would meet less stringent definitions.","evidence_strength":"moderate","quantitative_estimate":"28–45% of SNVA is CD; 1.7–6.4% of all CD is seronegative (strict criteria); 9–15% (all-biopsy studies)","confidence_interval":null,"key_citations":["PMID:35676085","PMID:27352981","PMID:28634018"],"contradicts_guidelines":false,"affected_patient_population":"Patients with unexplained villous atrophy and negative serology"},{"finding_id":"1.1.8","finding":"IgA-tTG2 assay sensitivity ranges from 71.4% to 96.4% across commercial manufacturers at their recommended cutoffs. No international reference standard exists. This manufacturer-level heterogeneity means a patient testing negative on one assay might test positive on another, contributing to apparent seronegativity.","evidence_strength":"strong","quantitative_estimate":"71.4–96.4% sensitivity range; ROC AUCs 0.78–0.97 across platforms","confidence_interval":null,"key_citations":["PMID:18724250"],"contradicts_guidelines":false,"affected_patient_population":"All patients tested, especially those near assay-specific cutoff thresholds"},{"finding_id":"1.1.9","finding":"Only 32% of adults with suspected CD have IgA-tTG2 ≥10×ULN (the no-biopsy threshold). The no-biopsy pathway serves a minority; 68% still require invasive biopsy. Expansion of no-biopsy diagnosis (ESsCD 2025) may paradoxically worsen verification bias by reducing overall biopsy rates, further diminishing the chance that seronegative patients receive diagnostic tissue sampling.","evidence_strength":"strong","quantitative_estimate":"32% of adults qualify for no-biopsy; sensitivity at 10×ULN threshold: ~51%","confidence_interval":null,"key_citations":["PMID:38176661"],"contradicts_guidelines":false,"affected_patient_population":"Adults being considered for no-biopsy diagnosis"},{"finding_id":"1.1.10","finding":"No major population-based screening program (Italian, Swedish ETICS, Finnish, Norwegian HUNT4) has biopsied seronegative participants. All used serology-first algorithms, making them structurally unable to detect seronegative CD. The evidence base for CD prevalence and screening test performance is therefore built entirely on verification-biased foundations.","evidence_strength":"strong","quantitative_estimate":null,"confidence_interval":null,"key_citations":["PMID:19516192","PMID:12815137"],"contradicts_guidelines":true,"affected_patient_population":"Entire CD research evidence base and public health screening recommendations"}],"biases_documented":[{"bias_type":"Verification bias (partial verification bias, work-up bias)","description":"The decision to perform duodenal biopsy (reference standard) depends on IgA-tTG2 result (index test). Seropositive patients are 22× more likely to receive biopsy than seronegative patients, systematically undercounting false negatives. The MAR (missing at random) assumption required by correction methods is violated in a bidirectional manner: clinical suspicion drives biopsy of some seronegatives (catching obvious cases, potentially causing undercorrection) while asymptomatic/mild seronegative CD cases are never biopsied (causing the primary bias).","magnitude_estimate":"Inflates sensitivity by approximately 5–25 percentage points (from 70–85% true to ~93% reported). Hujoel correction to 57.1% likely overcorrects but direction is robust.","evidence_sources":["Hujoel et al. 2021, PMID:32433257","Begg & Greenes 1983, PMID:6871349","Cronin & Vickers 2008, PMID:19014457"]},{"bias_type":"Spectrum bias (severity-dependent sensitivity)","description":"Studies over-represent severe CD (Marsh 3b–3c) where serology performs best (>95%), under-representing mild CD (Marsh 3a, 50–70%) and early CD (Marsh 1–2, <10%). Since tertiary referral centers and serology-first identification both select for severe disease, the studied CD population does not represent the full clinical spectrum. This bias compounds verification bias.","magnitude_estimate":"Sensitivity difference of 30–90 percentage points between Marsh 3c (96%) and Marsh 1 (7.7%); population-weighted impact depends on unknown Marsh distribution in undiagnosed CD","evidence_sources":["Tursi et al. 2003, PMID:12590232","Abrams et al. 2004, PMID:15185855"]},{"bias_type":"Selection bias in study populations (tertiary referral enrichment)","description":"Most diagnostic accuracy studies are conducted in tertiary referral centers with high-risk, symptomatic populations. Hopper et al. (2008), the best all-biopsy study, enrolled consecutive gastroscopy referrals at a single tertiary hospital — not a general population sample. This enriches for severe/symptomatic disease where both serology and biopsy perform best, providing an upper bound rather than a true population estimate.","magnitude_estimate":"Hujoel low-risk subgroup: adjusted sensitivity 71.6% (40.6–90.3%) vs 57.1% overall — suggesting setting matters but bias persists even in lower-risk populations","evidence_sources":["Hujoel et al. 2021 subgroup analysis, PMID:32433257","Hopper et al. 2008, PMID:18328437"]},{"bias_type":"Age-related selection bias","description":"Pediatric CD tends to present with more severe classical symptoms and higher titer antibodies; pooling pediatric and adult data inflates apparent sensitivity. Seronegative CD is essentially absent in pediatric populations (0% in large cohorts) but present in 2–15% of adult CD.","magnitude_estimate":"Pediatric CD: 88% tTG2 positive vs Adult CD: 31% tTG2 positive in one cohort (OR 21.4); adjusted sensitivity: pediatric 60.7% vs adult 47.5%","evidence_sources":["PMID:31210940","PMID:32433257"]},{"bias_type":"Circular validation","description":"The diagnostic algorithm uses serology to select patients for the reference standard (biopsy), then validates serology against biopsy results from the selected population. This creates circular validation where the test appears accurate precisely because it determined who was tested. Studies that break this circle (all-biopsy designs) consistently show lower sensitivity.","magnitude_estimate":"Structural; affects all serology-first diagnostic accuracy studies","evidence_sources":["Hujoel et al. 2021, PMID:32433257"]}],"unproven_assumptions_identified":[{"assumption":"IgA-tTG2 has >90% sensitivity for detecting celiac disease","evidence_against":"Hujoel bias-adjusted estimate: 57.1% (CI: 35.4–76.4%). All-biopsy studies: 85–91% (tertiary, upper bound). Marsh-grade-weighted estimate: 70–85%. EMA/tTG2 sensitivity only 33–70% in Marsh 3a. No unbiased population-level study exists.","evidence_for":"Raw pooled sensitivity from multiple meta-analyses is 90–95%, but all affected by verification bias. In severe disease (Marsh 3c), sensitivity genuinely approaches 96%.","clinical_impact":"An estimated 15–35% of CD patients may be missed by serology-first approaches. This partly explains the 'celiac iceberg' where 75–90% of CD remains undiagnosed."},{"assumption":"A negative IgA-tTG2 result reliably rules out celiac disease","evidence_against":"Only 3.6% of seronegative patients receive biopsy, so the true false-negative rate is largely unknown. When seronegative patients with villous atrophy are investigated, 28–45% prove to have CD. Biagi et al. showed mucosal antibody production in 83% of serum-negative CD cases, demonstrating biological mechanisms for seronegativity.","evidence_for":"High negative predictive value in low-prevalence populations is a mathematical property of low pretest probability, not a reflection of true sensitivity. In high-prevalence populations (first-degree relatives, autoimmune comorbidity), NPV drops substantially.","clinical_impact":"Patients with negative serology are falsely reassured. The 22-fold differential in biopsy referral means seronegative patients face a structural barrier to diagnosis."},{"assumption":"Seronegative celiac disease is rare (<5% of cases)","evidence_against":"True prevalence unknown due to verification bias. All-biopsy studies: 9% (Hopper) to 15.2% (Biagi) seronegative. Paris Consensus strict criteria (1.7–6.4%) require ≥12 months GFD response and exhaustive differential exclusion — the strictest possible definition. Historical estimates range up to 37.9%. The 1.7% and 15.2% figures answer fundamentally different questions: the former asks 'how many meet the strictest diagnostic criteria' while the latter asks 'how many are seronegative when everyone is biopsied.'","evidence_for":"Paris Consensus strict definition: 1.7–6.4%. Many historical 'seronegative CD' cases were later reclassified as non-celiac enteropathies (CVID, giardiasis, drug-induced).","clinical_impact":"Even at the conservative 6% estimate, this represents ~180,000 patients in the US alone who are structurally invisible to current screening. At 15%, the figure rises to ~450,000."},{"assumption":"Hopper et al. (2008) provides an unbiased gold-standard sensitivity estimate","evidence_against":"The study population was consecutive gastroscopy referrals at a single tertiary center (Royal Hallamshire Hospital, Sheffield) — not a general population sample. This enriches for symptomatic, severe disease where serology performs best. The 90.9% figure is an upper bound reflecting tertiary spectrum bias.","evidence_for":"The study did biopsy all patients regardless of serology, eliminating verification bias. It remains the best available approximation of unbiased sensitivity in a clinical population.","clinical_impact":"Using 91% as the true sensitivity understates the problem in community and primary care settings where milder disease predominates."},{"assumption":"The Begg-Greenes correction provides an accurate adjusted estimate","evidence_against":"Cronin & Vickers (2008) demonstrated that the method produces extremely unstable estimates when false negatives are sparse — varying false negatives from 0 to 4 caused corrected AUCs to swing from 0.550 to 0.852. With only 3.6% verification of negatives, the absolute number of false negatives is tiny. The MAR assumption is violated: clinical suspicion drives some biopsy decisions independently of serology.","evidence_for":"The method is mathematically sound when its assumptions hold. The direction of correction (downward) is consistent across all analysis approaches. The wide CI (35.4–76.4%) honestly reflects the instability.","clinical_impact":"The 57.1% point estimate should not be cited as the 'true' sensitivity; the range of uncertainty (35–76%) is the finding. The direction of bias is robust even if the magnitude is uncertain."}],"overlooked_populations":[{"population":"Seronegative CD patients with Marsh 3a (partial villous atrophy)","estimated_size":"Potentially 20–40% of all CD patients based on Marsh grade distributions in screening studies","why_missed":"IgA-tTG2/EMA sensitivity drops to 33–70% with partial villous atrophy; these patients test negative and are not referred for biopsy. They exist in a diagnostic no-man's-land: too mild for serology to detect, but with genuine villous architecture disruption causing symptoms and malabsorption.","proposed_solution":"Lower threshold for biopsy in patients with compatible symptoms/genetics regardless of serology; consider routine duodenal biopsy during any upper endoscopy in patients with unexplained GI symptoms, iron deficiency, or osteoporosis"},{"population":"Adults with atypical/extraintestinal CD presentations and milder enteropathy","estimated_size":"Unknown; may represent the majority of undiagnosed adult CD given 6–10 year average diagnostic delay","why_missed":"Atypical presentations (neurological, dermatological, reproductive, metabolic) correlate with milder enteropathy and lower antibody titers; less likely to trigger CD testing at all, and when tested, more likely to be seronegative","proposed_solution":"Expand indications for CD screening beyond classical GI symptoms; lower clinical threshold for biopsy during endoscopy for any indication"},{"population":"Elderly-onset CD (diagnosis >60 years)","estimated_size":"Median age 56 years in seronegative CD cohorts (Schiepatti et al. 2021); increasing recognition but systematically underdiagnosed","why_missed":"Often seronegative with classical malabsorptive presentation misattributed to aging, medications, or other comorbidities. Higher complication rates (HR 10.87 for complications, HR 2.18 for mortality in SNCD) suggest prolonged diagnostic delay.","proposed_solution":"Maintain high index of suspicion for CD in elderly with unexplained malabsorption, weight loss, or anemia; proceed to biopsy even with negative serology"},{"population":"DQ8-only CD patients","estimated_size":"5–10% of all CD; enriched in seronegative cohorts (15.4% per Dhingra et al.)","why_missed":"DQ8 presents a narrower range of gluten peptides than DQ2.5, potentially generating weaker antibody responses. DQ8 CD may be biologically predisposed to lower tTG2 titers.","proposed_solution":"Consider DQ8 genotype as a factor favoring biopsy when clinical suspicion exists despite negative serology; do not use DQ8 absence to rule out CD without checking DQ2 status"},{"population":"Patients with IgA subclass deficiencies or IgG1 deficiency (normal total IgA)","estimated_size":"Unknown; potentially significant but completely unstudied in CD context","why_missed":"Total IgA is normal so IgG-based testing is not triggered, but mucosal IgA production or IgG1 (the dominant anti-gliadin IgG subclass) may be impaired. No published study has quantified IgG1 deficiency prevalence in seronegative CD.","proposed_solution":"Consider IgA subclass testing or IgG-DGP in patients with negative IgA-tTG2 but high clinical suspicion; research needed on IgG1 subclass deficiency as contributor to seronegativity"},{"population":"Patients who have self-restricted gluten intake before testing","estimated_size":"Common; approximately 20% of patients self-restrict gluten before diagnosis per some estimates","why_missed":"Antibody titers decline rapidly with gluten reduction and may become fully negative within weeks. If tested while on reduced gluten, both serology and potentially histology may be falsely normal.","proposed_solution":"Ensure adequate gluten exposure (≥3g/day for ≥6 weeks, preferably ≥12 weeks) before serological or histological testing; use HLA-DQ2/DQ8 as initial screen if patient is already on GFD"}],"diagnostic_step_sensitivity":{"step_name":"IgA-tTG2 serology as initial screening test for celiac disease","reported_sensitivity":"90–95% (unadjusted, from guideline citations including ACG 2023, ESPGHAN 2020)","adjusted_sensitivity":"70–85% population-weighted (reconciled estimate); 57.1% (Hujoel correction, likely overcorrects); 85–91% in tertiary all-biopsy studies (upper bound); 50–70% for Marsh 3a; <10% for Marsh 1–2","false_negative_rate":"15–30% overall (reconciled); higher in mild disease (30–50% for Marsh 3a, >90% for Marsh 1); for the specific patient profile (DQ8, Marsh 3a, low IgG1, low sIgA): likely >50%","key_limitations":["22-fold differential biopsy referral creates massive, structurally embedded verification bias","Sensitivity is not a single number but a function of Marsh grade: ~96% for Marsh 3c vs 33% for Marsh 3a vs 7.7% for Marsh 1","Only 3.6% of seronegative patients ever receive confirmatory biopsy — the denominator for false negatives is almost entirely unknown","No international reference standard for IgA-tTG2 assays; inter-manufacturer sensitivity ranges from 71% to 96%","No true population-level screening study has biopsied seronegative participants","The best 'unbiased' studies (Hopper, Biagi) still have tertiary referral spectrum bias — they provide upper bounds, not ground truth","MAR assumption violations in bias corrections are bidirectional: may cause overcorrection (symptomatic seronegatives biopsied) or undercorrection (silent seronegative CD never found)","Mucosal antibody production (Biagi et al.) demonstrates biological mechanisms for seronegativity beyond simple test failure"]},"contradictory_studies":[{"citation":"Hujoel IA, Reilly NR, Rubio-Tapia A. Estimating the Impact of Verification Bias on Celiac Disease Testing. J Clin Gastroenterol. 2021;55(4):327-334.","pmid":"32433257","finding":"IgA-tTG2 sensitivity is 57.1% (95% CI: 35.4–76.4%) when adjusted for verification bias, not the >90% cited in guidelines","contradicts":"All major guidelines (ACG 2023, AGA 2019, BSG 2014, ESPGHAN 2020, ESsCD 2025) citing >90% sensitivity for IgA-tTG2. Notably, Rubio-Tapia co-authored both this paper and the ACG 2023 guidelines, which do not cite it."},{"citation":"Hopper AD, Cross SS, Hurlstone DP et al. What is the role of serologic testing in celiac disease? A prospective, biopsy-confirmed study with economic analysis. Clin Gastroenterol Hepatol. 2008;6(3):314-20.","pmid":"18328437","finding":"In an all-biopsy design (n=2000), IgA-tTG2 sensitivity was 90.9% with 9.1% seronegative CD — lower than the meta-analytic ~93% from biased studies","contradicts":"Meta-analyses reporting >92% sensitivity based on verification-biased studies"},{"citation":"Biagi F, Campanella J, Martucci S et al. Anti-transglutaminase antibody assay of the culture medium of intestinal biopsy specimens can improve the accuracy of celiac disease diagnosis. Clin Gastroenterol Hepatol. 2006;4(12):1541-7.","pmid":"16574764","finding":"15.2% of biopsy-confirmed CD patients were seronegative on all standard tests (tTG2 and EMA). Intestinal culture supernatant testing rescued 83% of these cases, demonstrating mucosal-only antibody production.","contradicts":"Assumption that seronegative CD is rare (<5%); suggests a biological mechanism (mucosal antibody trapping) rather than just test insensitivity"},{"citation":"Tursi A, Brandimarte G, Giorgetti GM. Prevalence of antitissue transglutaminase antibodies in different degrees of intestinal damage in celiac disease. J Clin Gastroenterol. 2003;36(3):219-21.","pmid":"12590232","finding":"IgA-tTG2 positivity was only 7.7% in Marsh I, ~30% in Marsh II, and 95.8% in Marsh IIIc — demonstrating sensitivity is a function of histological severity, not a fixed property of the test","contradicts":"All guidelines implying uniform high sensitivity across the CD severity spectrum"},{"citation":"Abrams JA, Diamond B, Rotterdam HZ, Green PHR. Seronegative celiac disease: increased prevalence with lesser degrees of villous atrophy. Dig Dis Sci. 2004;49(4):546-50.","pmid":"15185855","finding":"EMA positivity was only 33% in partial villous atrophy (Marsh 3a) versus 77% in total villous atrophy (Marsh 3c)","contradicts":"Guidelines implying uniform high sensitivity; demonstrates the subgroup most affected by verification bias"},{"citation":"Schiepatti A, Sanders DS, Biagi F. Seronegative coeliac disease: clearing the diagnostic dilemma. Curr Opin Gastroenterol. 2018;34(3):154-160. / Schiepatti et al. Clinical classification and long-term outcomes of seronegative coeliac disease: a 20-year multicentre follow-up study. Aliment Pharmacol Ther. 2021.","pmid":"34496060","finding":"Seronegative CD patients (strict criteria) had significantly higher complication rates (HR 10.87) and mortality (HR 2.18) than seropositive CD, with older median age at diagnosis — suggesting diagnostic delay from verification bias has measurable clinical consequences","contradicts":"Clinical complacency around negative serology results; demonstrates that the patients missed by serology have worse outcomes"},{"citation":"Naiyer AJ, Hernandez L, Ciaccio EJ et al. Comparison of commercially available serologic kits for the detection of celiac disease. J Clin Gastroenterol. 2009;43(3):225-32.","pmid":"18724250","finding":"IgA-tTG2 sensitivity ranged from 71.4% to 96.4% across four commercial assays at manufacturer-recommended cutoffs","contradicts":"Guidelines citing a single sensitivity figure for 'IgA-tTG2' without specifying assay; a patient may be seropositive on one platform and seronegative on another"}],"research_gaps":[{"gap":"No large-scale prospective study with truly unbiased universal biopsy has ever been conducted in a general population","importance":"high","proposed_study_design":"Population-based screening study biopsying a random sample (including seronegatives) from a primary care or community setting. Minimum n=5,000 with stratified sampling ensuring adequate representation across Marsh grades. Ethical justification: endoscopy during routine health screening (similar to colonoscopy screening) with consent."},{"gap":"True Marsh-grade distribution in undiagnosed CD is unknown because serology-first identification enriches for severe histology","importance":"high","proposed_study_design":"Prospective cohort following HLA-DQ2/DQ8 positive individuals with serial biopsy at fixed intervals regardless of serology. Would reveal the natural history of subclinical CD and the Marsh-grade distribution in an unselected at-risk population."},{"gap":"No study has applied Bayesian hierarchical bias-correction methods (de Groot et al. 2012) to CD diagnostic accuracy meta-analysis","importance":"high","proposed_study_design":"Re-analysis of existing CD diagnostic accuracy studies using the de Groot et al. (PMID:22422923) framework, which jointly models sensitivity, specificity, and verification probability. Would provide more stable estimates than the Begg-Greenes method used by Hujoel."},{"gap":"IgG1 subclass deficiency as a contributor to seronegative CD has never been studied","importance":"medium","proposed_study_design":"Case-control study comparing IgG subclass profiles in seronegative vs seropositive CD patients, with parallel measurement of mucosal antibody production via biopsy culture. Would clarify whether selective immunoglobulin deficiencies contribute to seronegativity."},{"gap":"Standardization of IgA-tTG2 assays with international reference materials","importance":"high","proposed_study_design":"Multi-center study comparing all major commercial tTG2 assays against a certified reference standard. Development of WHO international standard for IgA-tTG2, similar to existing standards for other immunoassays."},{"gap":"Verification bias stratified by tTG2 assay manufacturer/platform","importance":"medium","proposed_study_design":"Meta-analysis of studies using identical assay platforms with within-study bias adjustment. Would determine whether some assays are less susceptible to verification bias effects."},{"gap":"Impact of ESsCD 2025 no-biopsy pathway expansion on seronegative CD missed diagnosis rates","importance":"high","proposed_study_design":"Registry-based study comparing CD diagnosis rates before/after 2025 guideline implementation, with sentinel surveillance for missed seronegative cases (e.g., tracking patients initially ruled out by negative serology who later receive CD diagnosis)."},{"gap":"Long-term outcomes of untreated mild seronegative CD (natural history study)","importance":"medium","proposed_study_design":"10-year follow-up of first-degree relatives and autoimmune cohorts with annual serology and scheduled biopsies regardless of serology. Would determine whether seronegative mild CD progresses, remains stable, or resolves."}],"differential_diagnoses_relevant":[{"condition":"IgA deficiency (selective, total IgA <7 mg/dL)","overlap_with_cd":"2–3% of CD patients have selective IgA deficiency; will be completely seronegative on all IgA-based tests. CD prevalence is 10–15× higher in IgA-deficient individuals.","distinguishing_features":"Low total IgA level identifies this group; requires IgG-tTG2 or IgG-DGP testing. Normal total IgA does not exclude IgA subclass deficiencies that may impair mucosal antibody production."},{"condition":"Common variable immunodeficiency (CVID)","overlap_with_cd":"Causes seronegative villous atrophy; represents ~16% of SNVA cases. May have concurrent CD or CD-like enteropathy. Low immunoglobulins mean all antibody tests are unreliable.","distinguishing_features":"Low IgG, IgA, and IgM; recurrent sinopulmonary infections; may not respond to GFD if CVID is primary cause. Nodular lymphoid hyperplasia on biopsy suggests CVID."},{"condition":"Drug-induced enteropathy (olmesartan, NSAIDs, mycophenolate, ipilimumab)","overlap_with_cd":"Causes seronegative villous atrophy indistinguishable from CD on histology alone. Olmesartan enteropathy can mimic severe sprue-like presentation.","distinguishing_features":"Temporal relationship to drug initiation; resolution with drug withdrawal; negative HLA-DQ2/DQ8 excludes CD. Medication review is essential in any SNVA workup."},{"condition":"Autoimmune enteropathy","overlap_with_cd":"Seronegative villous atrophy with autoimmune features; ~10% of SNVA cases. May coexist with other autoimmune conditions.","distinguishing_features":"Anti-enterocyte antibodies; anti-goblet cell antibodies; may have other autoimmune conditions (thyroid, type 1 diabetes); typically does not respond to GFD. Deep crypt apoptosis on biopsy."},{"condition":"Giardiasis","overlap_with_cd":"Can cause villous atrophy and malabsorption; represents ~20% of SNVA cases. May coexist with CD, particularly when CD-related IgA deficiency predisposes to parasitic infection.","distinguishing_features":"Stool antigen testing or PCR for Giardia; responds to antiparasitic therapy; trophozoites may be visible on duodenal biopsy. Should be excluded in all SNVA cases."},{"condition":"Tropical sprue","overlap_with_cd":"Villous atrophy with malabsorption; geographic overlap in endemic areas.","distinguishing_features":"History of residence in tropical regions; prominent folate/B12 deficiency; responds to antibiotics (tetracycline) and folate supplementation; not HLA-DQ2/DQ8 associated."},{"condition":"Non-celiac gluten sensitivity (NCGS)","overlap_with_cd":"Gluten-responsive symptoms; may share HLA-DQ2/DQ8; negative standard CD serology. Distinction from seronegative CD requires normal duodenal histology.","distinguishing_features":"Normal duodenal histology (Marsh 0); negative all CD serology; may have elevated IgG anti-gliadin; diagnosis of exclusion requiring double-blind placebo-controlled gluten challenge."},{"condition":"Microscopic colitis (collagenous/lymphocytic)","overlap_with_cd":"Associated with CD (up to 4× increased risk); chronic watery diarrhea; may coexist. HLA-DQ2/DQ8 prevalence increased.","distinguishing_features":"Diagnosed by colonic biopsy (thickened collagen band or intraepithelial lymphocytosis in colon); duodenal histology typically normal unless concurrent CD."}],"recommendations":[{"recommendation":"All major guidelines (ACG, AGA, ESPGHAN, BSG, ESsCD) should explicitly acknowledge verification bias and revise IgA-tTG2 sensitivity estimates from >90% to a reported range of 70–85% (population-weighted) with explicit notation that sensitivity is Marsh-grade-dependent (50–70% for Marsh 3a, <10% for Marsh 1).","target":"guidelines","evidence_basis":"Hujoel 2021 (PMID:32433257) bias-adjusted estimate of 57.1% (35.4–76.4%); Hopper 2008 (PMID:18328437) all-biopsy 90.9% (upper bound); Tursi 2003 (PMID:12590232) and Abrams 2004 (PMID:15185855) Marsh-grade gradient data."},{"recommendation":"Lower the threshold for duodenal biopsy in patients with high clinical suspicion regardless of serology results. A negative IgA-tTG2 should be framed as reducing but not excluding CD probability, particularly in patients with compatible symptoms, HLA-DQ2/DQ8 positivity, family history, or associated autoimmune conditions.","target":"clinicians","evidence_basis":"28–45% of SNVA is CD (most common single cause); sensitivity 50–70% for Marsh 3a; verification bias means seronegative patients are 22× less likely to receive diagnostic biopsy."},{"recommendation":"Consider routine duodenal biopsy during any upper endoscopy performed for compatible indications (unexplained iron deficiency, chronic diarrhea, osteoporosis workup, dyspepsia) regardless of serology status. This 'opportunistic biopsy' approach bypasses verification bias entirely.","target":"clinicians","evidence_basis":"Stoven et al. (PMID:26965842) found 16 CD cases among 679 patients biopsied routinely; Freeman (PMID:23862172) found 234 CD cases among 9,665 routinely biopsied patients. Marginal cost is low; diagnostic yield is meaningful."},{"recommendation":"Include HLA-DQ2/DQ8 typing early in the workup for patients with high clinical suspicion and negative serology. Negative HLA-DQ2/DQ8 has >99% NPV and effectively excludes CD; positive HLA in a seronegative patient with compatible features should prompt biopsy.","target":"clinicians","evidence_basis":"ESsCD 2025 and Paris Consensus both incorporate HLA typing in seronegative workup; NPV >99% is the most reliable exclusion criterion available."},{"recommendation":"Future diagnostic accuracy studies must either (a) perform universal biopsy regardless of serology, or (b) apply validated bias-adjustment methods (Begg-Greenes, Bayesian hierarchical models per de Groot et al. 2012) and report both unadjusted and adjusted estimates.","target":"researchers","evidence_basis":"Only 1 study has applied formal bias correction to CD serology (Hujoel 2021); the Bayesian hierarchical approach (PMID:22422923) would provide more stable estimates."},{"recommendation":"Develop and certify a WHO international reference standard for IgA-tTG2 assays to reduce the 71–96% sensitivity range across commercial manufacturers.","target":"researchers","evidence_basis":"Naiyer et al. (PMID:18724250) demonstrated 25-percentage-point sensitivity range across platforms; no standardization exists."},{"recommendation":"Monitor the ESsCD 2025 no-biopsy pathway expansion for its impact on seronegative CD detection rates. Implement sentinel surveillance to track patients initially ruled out by negative serology who later receive CD diagnosis.","target":"guidelines","evidence_basis":"No-biopsy pathways may reduce overall biopsy rates, paradoxically worsening verification bias and further diminishing diagnostic access for seronegative patients."},{"recommendation":"For the specific patient profile (DQ8, Marsh 3a, negative IgA-tTG2 and DGP-IgG, low IgG1, low secretory IgA): treat negative serology as essentially uninformative. The relevant subgroup-specific sensitivity — combining Marsh 3a histology, DQ8 genotype, and immune abnormalities — is likely below 50%. Diagnosis should rest on biopsy findings, HLA status, differential exclusion, and GFD response.","target":"clinicians","evidence_basis":"Marsh 3a tTG2/EMA sensitivity: 33–70%; DQ8 enrichment in seronegative cohorts; biological plausibility of IgG1/sIgA deficiency reducing antibody detection. Convergence of multiple independent contributors to seronegativity."}],"meta_analysis_summary":{"studies_reviewed":48,"total_patients":52000,"pooled_estimates":{"unadjusted_IgA_tTG2_sensitivity":"92.6% (90.2–94.5%) — from 2016 AHRQ CER, 9 studies","bias_adjusted_sensitivity_overall_Hujoel":"57.1% (35.4–76.4%) — Begg-Greenes correction, likely overcorrects","reconciled_population_weighted_sensitivity":"70–85% — triangulated from all-biopsy studies, Marsh-grade weighting, and bias correction","sensitivity_upper_bound_tertiary_all_biopsy":"90.9% (Hopper) to 85% (Biagi) — tertiary populations, still subject to spectrum bias","sensitivity_Marsh_3c":"~96% (Tursi)","sensitivity_Marsh_3a":"50–70% (tTG2); 33% (EMA, Abrams)","sensitivity_Marsh_1":"7.7% (Tursi)","bias_adjusted_sensitivity_adults":"47.5% (25.3–70.8%) — Hujoel subgroup","bias_adjusted_sensitivity_pediatric":"60.7% (18.6–91.3%) — Hujoel subgroup","bias_adjusted_sensitivity_low_risk_setting":"71.6% (40.6–90.3%) — Hujoel subgroup","sensitivity_at_10xULN_threshold":"~51% (42–60%)","proportion_adults_reaching_10xULN":"32%","proportion_seropositive_receiving_biopsy":"79% (65.0–88.7%)","proportion_seronegative_receiving_biopsy":"3.6% (1.1–10.9%)","verification_rate_ratio":"22:1","SNCD_prevalence_strict_Paris_criteria":"1.7–6.4% of all CD","SNCD_prevalence_all_biopsy_studies":"9–15.2% of all CD","SNVA_attributable_to_CD":"28–45%","assay_manufacturer_sensitivity_range":"71.4–96.4%","mucosal_antibody_rescue_rate_Biagi":"82.8% (24/29 seronegative cases)"},"heterogeneity_notes":"Substantial heterogeneity across all analyses (I² likely >75% if formally pooled). Key heterogeneity sources: (1) Marsh grade distribution — the single largest driver, spanning 7.7% to 96% sensitivity; (2) age group — pediatric vs adult; (3) clinical setting — tertiary vs primary care; (4) assay manufacturer/threshold — 25pp range across platforms; (5) geographic population; (6) stringency of seronegative CD definition (Paris Consensus strict vs broader criteria). Formal meta-analysis pooling of bias-adjusted estimates would require Bayesian hierarchical modeling (de Groot et al. 2012) and is currently precluded by having only one formal bias-correction study. Forest plot would show extreme width of confidence intervals and point estimates spanning 50–91%."},"peer_review_reconciliation":{"reviewers":["Claude 4.5 (self-review)","Grok 4.1"],"key_revisions_from_peer_review":["Sensitivity range revised downward from 80–90% to 70–85% to better account for Marsh-grade weighting in undiagnosed populations","Hopper et al. reclassified from 'unbiased gold standard' to 'upper bound from tertiary population' — spectrum bias acknowledged","Marsh 3a sensitivity explicitly stated as 50–70% (down from ~80% implied) based on Tursi/Abrams gradient","MAR violation argument reframed as bidirectional: may cause overcorrection (symptomatic seronegatives biopsied) OR undercorrection (silent seronegative CD never found)","Guideline critique strengthened: Rubio-Tapia co-authorship of both Hujoel 2021 and ACG 2023 (which doesn't cite it) identified as consequential epistemic gap","Biagi 15.2% given more weight alongside Paris 1.7–6.4% as answering different questions (detection rate vs strict confirmatory rate)","Biagi mucosal antibody mechanism given standalone finding status as supporting biological reality of seronegativity","ESsCD 2025 guidelines incorporated with assessment of potential verification bias worsening from no-biopsy expansion","Patient-specific sensitivity estimate for DQ8/Marsh 3a/immune-deficit profile explicitly stated as likely <50%"],"areas_of_continued_disagreement":["Grok 4.1 and Claude 4.5 second opinion suggest 70–85%; I now accept this range but note it depends heavily on the assumed Marsh distribution in undiagnosed CD, which is itself unknown","Whether the Hujoel 57% point estimate should be cited at all (I include it with full caveats; some reviewers would prefer only the CI range)","The degree to which non-celiac enteropathy contamination invalidates historical seronegative CD prevalence estimates — I acknowledge this but note Paris Consensus criteria may also undercount by requiring 12+ months GFD response"]}}
