{"research_topic_id":"1.3","research_topic_title":"IgA-tTG2 Assay Heterogeneity and Threshold Calibration","date_completed":"2026-02-07","executive_summary":"Commercial IgA-tTG2 assays exhibit clinically significant heterogeneity in methodology, calibration, and cutoff thresholds — with ULN values varying approximately 3–5-fold across platforms and inter-laboratory GCV of 208% before the 2024 WHO International Standard. Head-to-head studies confirm that patients near diagnostic cutoffs can be classified differently depending on assay, and the ESPGHAN 10×ULN biopsy-free threshold is assay-dependent (41–61% of confirmed celiac patients qualify depending on platform). While high-titer results remain reliable across platforms, particularly when confirmed with EMA (PPV approaching 99.5%), the combination of assay heterogeneity and structural verification bias (only 3.6% of seronegative patients biopsied) means the true sensitivity of IgA-tTG2 serology is unknown — with modeled estimates suggesting it may be substantially below the commonly reported 92–93%.","key_findings":[{"finding_id":"1.3.1","finding":"All major commercial assays now use human recombinant tTG2, but significant differences persist in detection methodology (ELISA, CLIA, FEIA), calibration, and ULN definitions. Manufacturer-defined cutoffs range approximately 3–5-fold across platforms. NOTE: Specific cutoff values vary by assay version and region, and some values cited in published comparisons may not match current package inserts — the core finding of multi-fold ULN variation is robust regardless of exact values for any single kit.","evidence_strength":"strong","quantitative_estimate":"ULN varies approximately 3–5-fold across manufacturers; inter-laboratory GCV 208% pre-standardization","confidence_interval":null,"key_citations":["PMID:15388634","PMID:24741592","PMID:19776198","WHO/BS/2024.2477"],"contradicts_guidelines":false,"affected_patient_population":"All patients undergoing celiac serology, but clinically significant primarily for borderline/low-positive results"},{"finding_id":"1.3.2","finding":"Head-to-head comparison studies demonstrate diagnostically meaningful inter-assay discordance. The ProCeDE study (704 sera, 8 assays) found 82% total concordance — though this 18% discordance rate includes disagreements at multiple levels (not all across the positive/negative threshold). The safety-critical finding was 4 false-positive results above 10×ULN on 2 of 8 assays. Singh et al. found the assay with highest sensitivity in India had lowest in Canada (population-by-assay interaction). Cohen's kappa between assay pairs at 10×ULN ranged from slight to substantial agreement.","evidence_strength":"strong","quantitative_estimate":"82% concordance across 8 platforms (ProCeDE); sensitivity range 91–97% across 10 assays (Van Meensel); kappa 0.13–0.78 at 10×ULN (Suh-Lailam) — specific kappa values require primary verification","confidence_interval":null,"key_citations":["PMID:28624578","PMID:15388634","PMID:31546060","PMID:26172170"],"contradicts_guidelines":false,"affected_patient_population":"Patients with borderline/low-positive results most affected; patients near the 10×ULN threshold at highest risk of assay-dependent classification"},{"finding_id":"1.3.3","finding":"Verification bias structurally inflates reported IgA-tTG2 sensitivity. Hujoel et al. found only 3.6% of tTG2-negative patients received biopsy vs. 79.2% of tTG2-positive. Modeling-adjusted sensitivity estimate was 57.1%, but the 95% CI is wide (35.4–76.4%), spanning from worse than chance to reasonably good. The point estimate is less informative than the uncertainty itself: we genuinely cannot determine true sensitivity within serology-first algorithms because the denominator of seronegative celiac cases is unknown. This is an epistemological limitation, not merely a statistical one.","evidence_strength":"moderate","quantitative_estimate":"Adjusted sensitivity 57.1% (point estimate; modeling-derived, not empirical); adult-specific 47.5%","confidence_interval":"95% CI: 35.4–76.4% — wide uncertainty; upper bound still below commonly reported 92–93%","key_citations":["PMID:32433257"],"contradicts_guidelines":true,"affected_patient_population":"Seronegative patients with villous atrophy who never receive biopsy; magnitude of this population unknown by definition"},{"finding_id":"1.3.4","finding":"The ESPGHAN ≥10×ULN threshold performs inequivalently across assays. Vermeersch et al. found 41–61% of confirmed celiac patients qualify for no-biopsy depending on platform. CLIA platforms systematically produce higher multiples of ULN than FEIA, classifying more patients as eligible. Previtali et al. showed QUANTA Flash CLIA required 28×ULN (not 10×) to achieve 99% PPV. Chang et al. (2025, 4019 children across 12 North American centers) found PPV at ≥10×ULN ranged 89.3–97.3% by assay, and 24% of tTG2 results were reported as '>100' without quantification, precluding threshold interpretation.","evidence_strength":"strong","quantitative_estimate":"41–61% qualification rate depending on assay (Vermeersch); PPV 89.3–97.3% across sites (Chang); 92.1% PPV on QUANTA Flash requiring 28× for 99% (Previtali)","confidence_interval":null,"key_citations":["PMID:23103822","PMID:40774665","PMID:28991835","PMID:36857146"],"contradicts_guidelines":true,"affected_patient_population":"Children and adults considered for no-biopsy diagnosis; estimated 5–11% potential misclassification depending on assay"},{"finding_id":"1.3.5","finding":"High-titer results (unambiguously >10×ULN) remain reliable across platforms, and assay heterogeneity has minimal clinical impact for patients with very high antibody levels. When combined with positive EMA confirmation (as ESPGHAN requires), PPV approaches 99.5% in most validated settings. For the ~30–50% of celiac patients with very high titers, assay choice is clinically irrelevant. The heterogeneity problem is concentrated at: borderline positives (1–3×ULN), patients near the 10×ULN threshold, and seronegative cases.","evidence_strength":"strong","quantitative_estimate":"PPV 95–100% at 10×ULN on validated assays; ~99.5% when combined with EMA; 30–50% of celiac patients fall in the high-titer zone where assay choice is irrelevant","confidence_interval":null,"key_citations":["PMID:40774665","PMID:28624578"],"contradicts_guidelines":false,"affected_patient_population":"Patients with very high tTG2 titers — for these patients, the current no-biopsy pathway works well"},{"finding_id":"1.3.6","finding":"WHO established First International Standard for tTG Ig autoantibodies (October 2024, Code 23/274) assigning 200 IU/vial for IgA-tTG2 and 100 IU/vial for IgG-tTG2. Collaborative study across 16 assays and 7 laboratories showed GCV reduction from 208% to approximately 33%. A companion certified reference material (ERM-DA487/IFCC) was certified in early 2025 for routine calibration. However: residual 33% GCV remains clinically significant for threshold-based decisions; 9 of 28 IgA assay-pair correlations showed suboptimal agreement (Pearson r <0.90), indicating different assays recognize overlapping but non-identical antibody populations; and manufacturer adoption will take years.","evidence_strength":"strong","quantitative_estimate":"GCV reduced from 208% to ~33%; roughly 6-fold improvement; residual 33% clinically significant","confidence_interval":null,"key_citations":["WHO/BS/2024.2477"],"contradicts_guidelines":false,"affected_patient_population":"All patients — but implementation timeline measured in years"},{"finding_id":"1.3.7","finding":"IgA-tTG2 antibody levels correlate with histological severity — near 100% sensitivity for Marsh 3c (total villous atrophy) but substantially reduced for Marsh 3a (partial villous atrophy, estimated ~85%) and often negative for Marsh 1–2. This severity–titer correlation means the assay functions more as a marker of mucosal damage extent than of disease presence/absence, with direct implications: patients with mild but real enteropathy are the most likely to fall in the borderline zone where inter-assay variability has maximum impact.","evidence_strength":"moderate","quantitative_estimate":"Marsh 3c: ~100% sensitivity; Marsh 3a: ~85%; Marsh 1–2: frequently negative. 43.9% of confirmed CD in one study had <2×ULN elevation","confidence_interval":null,"key_citations":["PMID:24583754"],"contradicts_guidelines":true,"affected_patient_population":"Patients with mild enteropathy (Marsh 3a) or early disease, who constitute the critical overlap zone for both verification bias and assay variability"},{"finding_id":"1.3.8","finding":"No commercial IgA-tTG2 assay has been designed or optimized for detection of seronegative celiac disease. All are calibrated on seropositive cohorts (typically enriched for Marsh 3b/3c) to maximize specificity. Point-of-care tests show lower sensitivity (70–90%) than laboratory assays and are not recommended as standalone diagnostics. Note: POC devices like Simtomax detect anti-DGP rather than anti-tTG2 and should not be conflated with tTG2 assay performance.","evidence_strength":"moderate","quantitative_estimate":"POC sensitivity 70–90% (varies by device and population); lab ELISA/FEIA/CLIA 90–98%","confidence_interval":null,"key_citations":["PMID:24685008"],"contradicts_guidelines":false,"affected_patient_population":"Seronegative CD population (estimated 6–10% of biopsy-confirmed cases in modern series; true prevalence unknown)"},{"finding_id":"1.3.9","finding":"EMA confirmation serves as a critical safety net for the no-biopsy pathway. EMA has ~99% specificity via immunofluorescence pattern recognition, is less susceptible to calibration variability than quantitative immunoassays, and substantially mitigates the false-positive risk of high tTG2 titers. PPV of tTG2 ≥10×ULN combined with positive EMA approaches 99.5%. This dual-test requirement partially compensates for inter-assay tTG2 variability but adds cost and is observer-dependent.","evidence_strength":"strong","quantitative_estimate":"EMA specificity ~99%; combined PPV (tTG2 ≥10×ULN + EMA) ~99.5%","confidence_interval":null,"key_citations":["PMID:28624578","PMID:40774665"],"contradicts_guidelines":false,"affected_patient_population":"Children on the no-biopsy pathway; EMA adds significant protection against assay-specific false positives"}],"biases_documented":[{"bias_type":"Verification bias (work-up bias)","description":"Only 3.6% of tTG2-negative patients receive biopsy vs. 79.2% of tTG2-positive, creating circular validation: serology appears sensitive because only seropositive patients are tested by biopsy. Modeling suggests true sensitivity may be substantially below reported 92–93%, though the adjusted point estimate (57%) carries wide confidence intervals. The fundamental problem is epistemological — we cannot determine the denominator of true celiac cases because seronegative patients are systematically excluded from the reference standard.","magnitude_estimate":"Modeled true sensitivity 35–76% (95% CI); reported 92–93%","evidence_sources":["PMID:32433257"]},{"bias_type":"Severity selection bias in assay validation cohorts","description":"Study cohorts used to determine assay performance are enriched for severe disease (Marsh 3b/3c) where antibody titers are highest and assays perform best. Marsh 3a patients are underrepresented, and the patients most likely to be seronegative — those with mild enteropathy — are least likely to appear in validation studies. This creates a positive feedback loop with verification bias.","magnitude_estimate":"Sensitivity drops ~15 percentage points for Marsh 3a vs. Marsh 3c; 43.9% of confirmed CD in one study had <2×ULN elevation","evidence_sources":["PMID:24583754"]},{"bias_type":"Research vs. clinical setting performance gap","description":"Assay performance in controlled research environments consistently exceeds clinical-practice performance. This is a distinct bias from verification bias — it reflects sample handling, pre-analytical variability, population characteristics, and test ordering patterns in real-world settings.","magnitude_estimate":"Specificity lower in clinical vs. research settings (e.g., Immulite 2000: approximately 2× more false positives clinically)","evidence_sources":["PMID:19776198"]},{"bias_type":"Manufacturer-funded validation studies","description":"Assay cutoffs are established from manufacturer-derived ROC curves often performed on cohorts selected for strong seropositivity and severe histology. Independent validation studies are fewer and sometimes show lower performance.","magnitude_estimate":"Unknown magnitude; suspected to inflate reported accuracy","evidence_sources":[]}],"unproven_assumptions_identified":[{"assumption":"The 10×ULN threshold is equivalent across all commercial IgA-tTG2 platforms","evidence_against":"41–61% of patients qualify depending on assay (Vermeersch); QUANTA Flash requires 28×ULN for 99% PPV (Previtali); CLIA assays systematically produce higher multiples than FEIA/ELISA; Chang 2025 found PPV range 89.3–97.3% across sites","evidence_for":"PPV remains >95% at 10×ULN for most validated assays; EMA confirmation mitigates false-positive risk; for patients with very high titers, assay choice is irrelevant. ESsCD 2025 now acknowledges this by recommending assay-specific validation.","clinical_impact":"5–11% potential misclassification; a patient may qualify for no-biopsy on one platform but require biopsy on another, determined entirely by laboratory choice"},{"assumption":"A negative IgA-tTG2 result reliably excludes celiac disease","evidence_against":"Verification bias–adjusted sensitivity estimate 35–76% (wide CI); 6–10% of biopsy-confirmed CD is seronegative in modern series; sensitivity lower for mild disease; antibody levels reflect mucosal damage severity, not disease presence","evidence_for":"Pooled sensitivity >90% in meta-analyses (subject to verification bias); most symptomatic celiac patients with significant villous atrophy will be seropositive; negative predictive value high in low-prevalence populations","clinical_impact":"Unknown number of seronegative CD patients remain undiagnosed. The clinical significance depends on whether seronegative patients with Marsh 3a develop the same long-term complications as seropositive patients — this has not been studied."},{"assumption":"Inter-laboratory variability is purely a precision problem that does not affect diagnostic accuracy","evidence_against":"When clinical decisions are threshold-based (positive/negative at cutoff; ≥10×ULN vs. <10×ULN), imprecision directly translates to misclassification. A 33% GCV means the same sample could yield results on different sides of a threshold at different laboratories. The distinction between precision and accuracy dissolves at the individual patient level when the decision is binary.","evidence_for":"High GCV does not mean all assays are wrong — they may measure the same biology on different scales. Rank-order agreement is often better than absolute agreement. For patients far from any threshold, imprecision is clinically irrelevant.","clinical_impact":"Patients near diagnostic thresholds receive different diagnoses depending on which laboratory processes their sample"}],"overlooked_populations":[{"population":"Patients with borderline/low-positive tTG2 results (1–3×ULN) who are not biopsied","estimated_size":"~30–40% of seropositive CD patients have low-level elevation","why_missed":"Fall below 10×ULN; may be dismissed as low-probability or false positive. No-biopsy pathway creates implicit assumption that lower titers are less clinically important.","proposed_solution":"Maintain low threshold for biopsy in symptomatic patients regardless of titer. Consider clinical decision rules incorporating symptoms, HLA, and family history rather than titer alone."},{"population":"Patients tested at laboratories using less sensitive or less well-validated assays","estimated_size":"Variable by region and institution — potentially large in low-resource settings","why_missed":"No requirement for laboratories to report which assay was used; clinicians cannot interpret results in assay-specific context; WHO IS not yet widely adopted","proposed_solution":"Mandate assay identification on laboratory reports; require WHO IS calibration as available; establish proficiency testing programs"},{"population":"Patients with mild enteropathy (Marsh 3a) and DQ8-only genotype","estimated_size":"Unknown — cannot be estimated because verification bias prevents identification","why_missed":"DQ8 associated with lower antibody titers; Marsh 3a at the threshold where sensitivity drops; compound effect of lower biological signal + assay imprecision = highest probability of false-negative serology","proposed_solution":"Biopsy-first approach when clinical suspicion is high regardless of serology; test for mucosal IgA-tTG2 deposits on biopsy specimens"},{"population":"Patients with subtle immunoglobulin deficiencies (IgG subclass, low secretory IgA) who are not formally IgA-deficient","estimated_size":"Unknown; selective IgA deficiency is 2–3% of CD, but partial deficiencies and IgG subclass deficiencies are more common and not routinely screened","why_missed":"Guidelines only mandate total IgA testing; partial deficiencies and IgG subclass deficiencies are not detected by total IgA screening. These patients may produce insufficient antibodies for detection while not meeting criteria for IgG-based testing.","proposed_solution":"Consider IgG-based tests (IgG-tTG2, IgG-DGP) in patients with low-normal total IgA or known IgG subclass deficiency, even if total IgA is technically 'sufficient'"}],"diagnostic_step_sensitivity":{"step_name":"IgA-tTG2 serology (screening/gatekeeper function)","reported_sensitivity":"92.6% pooled (meta-analyses, subject to verification bias); range 90.7% adults to 97.7% children; across commercial platforms 69–97%","adjusted_sensitivity":"57.1% point estimate after verification bias correction (Hujoel), but 95% CI 35.4–76.4% — the wide uncertainty is the key finding, not the point estimate. True sensitivity is genuinely unknown within serology-first algorithms.","false_negative_rate":"Reported: 3–10%; Adjusted estimate: 24–65% (inverted from adjusted sensitivity CI); clinically unknown","key_limitations":["Verification bias: only 3.6% of seronegative patients biopsied — true denominator unknown","Performance varies 69–97% across commercial platforms (strongest evidence: Van Meensel, 10 assays)","Sensitivity reduced for mild disease: ~100% Marsh 3c, ~85% Marsh 3a, often negative Marsh 1–2","No international standardization until 2024 WHO IS; residual 33% GCV even after standardization","ULN definitions vary ~3–5-fold across manufacturers","Cutoff thresholds derived from manufacturer ROC curves on biased cohorts","Coefficient of variation increases at low analyte concentrations where diagnostic decisions are most consequential","EMA confirmation partially mitigates false-positive risk but does not address false-negative problem"]},"contradictory_studies":[{"citation":"Multiple meta-analyses (Rostom 2005, Maglione 2016, Sheppard 2022) showing >90% pooled sensitivity","pmid":"15825125","finding":"IgA-tTG2 sensitivity consistently reported 90–98% across meta-analyses, supporting current serology-first algorithms for the majority of celiac patients","contradicts":"The hypothesis that true sensitivity is dramatically lower; for patients with moderate-to-severe disease, current diagnostics appear adequate. The verification bias concern primarily affects the (unknown-sized) population with mild or early disease."},{"citation":"Chang et al. 2025 — Multicenter PPV at 10×ULN in North American pediatric centers","pmid":"40774665","finding":"Despite inter-assay variability, PPV at ≥10×ULN ranged 89.3–97.3%, and combined with EMA approaches 99.5%. For the ~30–50% of celiac patients with very high titers, the no-biopsy pathway works reliably.","contradicts":"The concern that assay heterogeneity fundamentally undermines the no-biopsy pathway; more precisely, it undermines universal application but not locally validated application with EMA confirmation."},{"citation":"Pjetraj et al. 2024 — CLIA meta-analysis showing 98% sensitivity","pmid":"39125307","finding":"CLIA platforms showed pooled sensitivity of 98% and specificity of 97%, suggesting newer automated platforms may substantially outperform older ELISA systems","contradicts":"The claim that assay heterogeneity has not improved over time; newer platforms may be converging toward consistently high performance for moderate-to-severe disease"},{"citation":"ESsCD 2025 updated guidelines","pmid":null,"finding":"Updated European guidelines now recommend assay-specific validation of high-titer thresholds and acknowledge inter-assay variability, representing appropriate self-correction by guideline bodies","contradicts":"The characterization that guidelines ignore assay heterogeneity; guideline evolution is occurring, though slowly and incompletely"}],"research_gaps":[{"gap":"Biopsy-independent prospective cohort to determine true IgA-tTG2 sensitivity","importance":"high","proposed_study_design":"Prospective study with mandatory biopsy for all patients undergoing celiac evaluation regardless of serology result; multiple commercial assays tested on same samples; Marsh grade distribution documented. This is the only design that can break the verification bias cycle."},{"gap":"Contemporary head-to-head comparison of ≥5 current commercial platforms with full histological correlation","importance":"high","proposed_study_design":"Multi-center study testing ≥5 current platforms (at least one each of ELISA, FEIA, CLIA) on identical stored sera from biopsy-proven cohort enriched for Marsh 3a. Must include seronegative cases identified through biopsy-first protocols."},{"gap":"Assay performance specifically in Marsh 3a with DQ8-only genotype","importance":"high","proposed_study_design":"Subgroup analysis from biopsy-independent cohort focusing on patients with partial villous atrophy and DQ8 (without DQ2) — the combination predicted to have lowest antibody levels and highest false-negative risk"},{"gap":"Impact of WHO International Standard adoption on real-world diagnostic classification","importance":"medium","proposed_study_design":"Before/after study comparing inter-laboratory agreement, diagnostic concordance, and no-biopsy pathway eligibility rates as laboratories adopt WHO IS calibration"},{"gap":"Long-term outcomes comparing no-biopsy vs. biopsy-confirmed diagnosis","importance":"medium","proposed_study_design":"Registry-based cohort comparing mucosal healing rates, symptom resolution, complication rates, and diagnostic revision rates between patients diagnosed via no-biopsy pathway vs. biopsy confirmation"},{"gap":"Mucosal IgA-tTG2 deposit detection as adjunct for seronegative cases","importance":"medium","proposed_study_design":"Prospective evaluation of intestinal IgA-tTG2 deposits (immunohistochemistry/immunofluorescence on biopsy) in patients with negative serum tTG2 but clinical suspicion of CD, compared to biopsy histology and clinical response to GFD"},{"gap":"Effect of hemolysis on IgA-tTG2 results across platforms","importance":"medium","proposed_study_design":"Systematic spiking study: tTG2 is abundant in erythrocytes; hemolyzed samples may produce spurious results. Evaluate across major platforms at standardized hemolysis levels."}],"differential_diagnoses_relevant":[{"condition":"Selective IgA deficiency","overlap_with_cd":"IgA-tTG2 will be falsely negative; 2–3% of CD patients have selective IgA deficiency (10-fold enrichment vs. general population)","distinguishing_features":"Total serum IgA <0.07 g/L; requires IgG-based testing (IgG-tTG2, IgG-DGP). Current guidelines mandate concurrent total IgA measurement."},{"condition":"Partial immunoglobulin deficiencies (IgG subclass, low secretory IgA)","overlap_with_cd":"May produce insufficient antibody levels for detection while not meeting criteria for formal IgA deficiency. Relevant to the project reference patient (low IgG1, low secretory IgA).","distinguishing_features":"Total IgA may be normal or low-normal; IgG subclass testing and secretory IgA measurement not routine. These patients fall into a diagnostic gap between 'IgA sufficient' and 'IgA deficient.'"},{"condition":"Non-celiac gluten sensitivity (NCGS)","overlap_with_cd":"Similar symptoms; may have borderline or low-positive serology in some studies","distinguishing_features":"Normal villous architecture on biopsy; negative EMA; symptoms improve with GFD but no mucosal damage or specific biomarker"},{"condition":"Drug-induced enteropathy (olmesartan, mycophenolate, etc.)","overlap_with_cd":"Villous atrophy on biopsy; may be HLA-DQ2/DQ8 positive (coincidental); typically seronegative","distinguishing_features":"Usually tTG2-negative; temporal relationship to medication; resolves with drug withdrawal. Important to distinguish from seronegative CD."},{"condition":"Autoimmune enteropathy","overlap_with_cd":"Villous atrophy; may have autoantibodies (anti-enterocyte, anti-goblet cell)","distinguishing_features":"Typically tTG2-negative; anti-enterocyte antibodies; more severe and refractory; may respond to immunosuppression but not GFD alone"},{"condition":"Common variable immunodeficiency (CVID)","overlap_with_cd":"Can cause villous atrophy; associated with increased CD risk; will have reduced immunoglobulin levels affecting all serologic tests","distinguishing_features":"Panhypogammaglobulinemia; recurrent infections; nodular lymphoid hyperplasia; may coexist with CD; antibody-based tests unreliable"}],"recommendations":[{"recommendation":"Laboratories should validate assay-specific thresholds for the 10×ULN no-biopsy criterion, ideally using likelihood ratio–based approaches calibrated to local disease prevalence, rather than applying a universal 10× multiplier","target":"laboratories","evidence_basis":"Optimal thresholds range from 3.7× to 28×ULN across platforms (Vermeersch, Previtali); a generic 10× multiplier produces PPV ranging 89–100% depending on platform and population"},{"recommendation":"Assay identification (manufacturer, platform, and cutoff) should be reported on every IgA-tTG2 result to enable clinicians to interpret results in context","target":"guidelines","evidence_basis":"No current requirement to identify assay; clinicians cannot assess reliability or compare serial results without this information"},{"recommendation":"The WHO International Standard (Code 23/274) and ERM-DA487/IFCC reference material should be adopted for calibration as rapidly as possible","target":"laboratories","evidence_basis":"Reduces inter-laboratory GCV from 208% to ~33%; enables comparison across settings and longitudinal monitoring"},{"recommendation":"Clinicians should maintain a low threshold for biopsy when clinical suspicion of CD is high, regardless of serology result — particularly in patients with DQ8-only genotype, mild symptoms, or partial immunoglobulin deficiencies","target":"clinicians","evidence_basis":"Adjusted sensitivity estimates suggest many seronegative cases may exist; 6–10% of biopsy-confirmed CD is seronegative; sensitivity reduced for mild histological disease"},{"recommendation":"Retest discordant or borderline cases with alternate assay platform plus EMA confirmation before excluding CD diagnosis","target":"clinicians","evidence_basis":"Patients can be negative on one platform but positive on another (3–5% in head-to-head studies); retesting with a different methodology may detect cases missed by a single assay"},{"recommendation":"Consider testing for mucosal IgA-tTG2 deposits (immunohistochemistry on biopsy) in patients with negative serum tTG2 but biopsy showing villous atrophy and compatible clinical presentation","target":"clinicians","evidence_basis":"Mucosal antibody trapping can produce seronegative serology despite active mucosal autoimmunity; intestinal deposits have been demonstrated in seronegative CD"},{"recommendation":"For patients on the no-biopsy pathway: high-titer results (>10×ULN on validated assays) combined with positive EMA provide reliable diagnosis with PPV approaching 99.5% — the pathway works well for this population and should be maintained where properly validated","target":"clinicians","evidence_basis":"ProCeDE, Chang 2025, and multiple validation studies confirm reliability at high titers; EMA adds critical specificity; assay heterogeneity primarily affects borderline, not high-titer, results"},{"recommendation":"Research funders should prioritize a biopsy-independent prospective cohort study to determine true IgA-tTG2 sensitivity — this is the single most important evidence gap in celiac diagnostics","target":"researchers","evidence_basis":"All current sensitivity estimates are contaminated by verification bias; the only way to determine true sensitivity is to biopsy patients regardless of serology result"}],"meta_analysis_summary":{"studies_reviewed":28,"total_patients":null,"pooled_estimates":{"reported_sensitivity_adults":"90.7% (95% CI: 87.3–93.2%)","reported_sensitivity_children":"97.7%","verification_bias_adjusted_sensitivity":"57.1% (95% CI: 35.4–76.4%) — modeling-derived, wide uncertainty","sensitivity_range_across_platforms":"69–97% (head-to-head comparisons)","specificity_range":"87–100% (varies by assay, population, and clinical vs. research setting)","PPV_at_10xULN":"89.3–97.3% across sites and assays; ~99.5% when combined with EMA","proportion_qualifying_10xULN":"41–61% depending on assay platform","inter_laboratory_GCV_before_WHO_IS":"208%","inter_laboratory_GCV_after_WHO_IS":"~33%"},"heterogeneity_notes":"High heterogeneity across studies (I² up to 99.3%) reflects assay methodology differences, population characteristics, Marsh grade distribution, verification bias in study design, and clinical vs. research settings. The WHO IS will reduce technical heterogeneity but cannot address verification bias, severity selection, or biological variability in antibody production across genotypes and disease stages."},"peer_review_integration":{"reviewers":["Grok 4.1 (findings + critique)","Opus 4.5 (second opinion)"],"consensus_points":["Clinically significant inter-assay variability is real and well-documented","The 10×ULN threshold is assay-dependent and requires local validation","Verification bias inflates reported sensitivity — true sensitivity unknown","WHO IS 23/274 is a landmark advance but insufficient alone","Seronegative CD biological mechanisms (mucosal trapping, DQ8 lower titers) explain seronegativity better than assay failure for profoundly negative cases","High-titer results with EMA confirmation are reliable — no-biopsy pathway works for this subset"],"disagreements_and_resolutions":[{"issue":"Opus tilts toward alarm over balanced interpretation (Grok critique)","resolution":"Partially accepted. Strengthened acknowledgment of high-titer reliability (finding 1.3.5) and EMA safety net (finding 1.3.9). Added explicit contradictory studies. However, I maintain that the verification bias problem is genuinely alarming and deserves emphasis — moderating the rhetoric does not change the underlying epistemological problem."},{"issue":"Specific cutoff values in the assay table may not match current package inserts (Grok critique)","resolution":"Accepted. Added caveat to finding 1.3.1 noting that specific values vary by version and region. The core finding of multi-fold ULN variation is robust regardless of exact values for any single kit."},{"issue":"Hujoel 57% presented too definitively; wide CI should dominate interpretation (Grok critique)","resolution":"Accepted. Rewrote finding 1.3.3 to emphasize that the wide CI (35.4–76.4%) is the key finding, not the point estimate. The uncertainty itself — the fact that we genuinely cannot determine true sensitivity — is more important than any single number."},{"issue":"ProCeDE 82% concordance overstated as diagnostic failure (Grok critique)","resolution":"Partially accepted. Clarified in finding 1.3.2 that 18% discordance includes disagreements at multiple levels, not all across the positive/negative threshold. However, the safety-critical finding (4 false positives above 10×ULN on 2 of 8 assays) stands as directly threatening to the no-biopsy pathway."},{"issue":"Simtomax conflates DGP and tTG2 analytes (Grok critique)","resolution":"Accepted. Separated POC discussion in finding 1.3.8 and noted that Simtomax detects anti-DGP, not anti-tTG2."},{"issue":"Precision vs. accuracy distinction — high GCV does not mean assays are wrong (Grok critique)","resolution":"Partially accepted as a conceptual clarification, but I disagree that this diminishes the clinical concern. Added as an unproven assumption (section 3) with my counter-argument: for threshold-based binary decisions, imprecision directly translates to misclassification at the individual patient level. The distinction between precision and accuracy dissolves when the clinical decision is dichotomous."},{"issue":"Null hypothesis underweighted (Grok critique)","resolution":"Partially accepted. Expanded contradictory studies section to include ESsCD 2025 guideline evolution, CLIA meta-analysis, and explicit acknowledgment that for moderate-to-severe disease the current system works. However, the null hypothesis cannot be properly tested without a biopsy-independent cohort — which is itself the central argument."}]}}
