{"research_topic_id":"1.2","research_topic_title":"IgA-tTG2 Sensitivity by Marsh Grade and Disease Severity","date_completed":"2026-02-07","version":"3.0","revision_notes":"Merged synthesis of Opus 4.6 primary analysis, Sonnet 4.5 v2.0 findings + peer review, and Grok 4.1 independent findings + peer review. Key changes from v2.0: (1) Separated EMA vs modern tTG2 sensitivity estimates at Marsh 3a; (2) Reframed 'digital pattern' as primarily verification bias artifact with contributing biological threshold; (3) Added seronegative histology heterogeneity (some Marsh 3c); (4) Integrated Hujoel verification bias correction as headline finding; (5) Expanded HLA dose and humoral immunity connections; (6) Added Daveson quantitative histology miss rate; (7) Strengthened biopsy adequacy data (Lebwohl); (8) Added FDR screening Marsh distribution data.","executive_summary":"IgA-tTG2 sensitivity is heavily dependent on histological severity, functioning primarily as a mucosal damage severity marker rather than a binary disease detector. Verification-bias-corrected sensitivity is estimated at 57% (95% CI: 35-76%), far below the guideline-cited 93%. EMA sensitivity drops from ~100% at Marsh 3c to 31-33% at Marsh 3a; modern IgA-tTG2 assays perform somewhat better at Marsh 3a (~50-70%) but still miss a substantial proportion. When biopsy is performed independent of serology, Marsh 3a emerges as the most common grade (up to 50% in FDR screening), contradicting the apparent rarity of mild disease in serology-gated cohorts. The biopsy-sparing ≥10× ULN threshold, while highly specific, captures only ~51% of adult CD and systematically excludes mild disease.","key_findings":[{"finding_id":"1.2.1","finding":"Verification bias inflates reported IgA-tTG2 sensitivity from ~93% to an estimated true sensitivity of 57% (95% CI: 35-76%). Only 3.6% of tTG-negative individuals are referred for biopsy versus 79.2% of positives — a 22-fold differential referral rate that renders seronegative CD systematically invisible.","evidence_strength":"strong","quantitative_estimate":"Corrected sensitivity: 57% (95% CI: 35-76%); referral differential: 22-fold","confidence_interval":"95% CI: 35.4-76.4%","key_citations":["PMID:32433257"],"contradicts_guidelines":true,"affected_patient_population":"All CD patients — guideline-cited sensitivity of 93% is substantially inflated"},{"finding_id":"1.2.2","finding":"EMA sensitivity is strongly severity-dependent, dropping from ~100% in total villous atrophy (Marsh 3c) to 31-33% in partial villous atrophy (Marsh 3a). Modern IgA-tTG2 assays show a parallel but less severe drop, with estimated sensitivity of 50-70% at Marsh 3a depending on assay and cohort. The distinction between EMA and tTG2 performance at mild grades is important: older EMA data overstates the sensitivity collapse for tTG2.","evidence_strength":"strong","quantitative_estimate":"EMA: 100% (3c) → 31-33% (3a); IgA-tTG2: ~96% (3c) → ~50-70% (3a, modern assays); Tursi 2003 tTG2 positivity: 7.7% (Marsh I), ~30% (II), ~55-60% (3a), ~85% (3b), 95.8% (3c)","confidence_interval":"Varies by study; trend consistently shows 30-50% relative reduction at Marsh 3a vs 3c","key_citations":["PMID:10201452","PMID:15185855","PMID:12590232","PMID:16630760","PMID:10720117"],"contradicts_guidelines":true,"affected_patient_population":"Patients with mild/early villous atrophy (Marsh 3a)"},{"finding_id":"1.2.3","finding":"When biopsy is performed independent of serology (eliminating verification bias), Marsh 3a is common — often the single most common grade. In FDR screening where all 155 relatives were biopsied, Marsh 3a was 50% of cases. Tursi 2003 found near-even distribution: 3a=22.7%, 3b=26.1%, 3c=20.2%. Hopper 2008 universal-biopsy study found balanced Marsh distribution (29 3a, 30 3b, 18 3c) and 9.1% seronegative CD. The apparent rarity of Marsh 3a in serology-gated cohorts is primarily an artifact of verification bias.","evidence_strength":"strong","quantitative_estimate":"Marsh 3a: 50% in FDR screening (universal biopsy); 22-38% in unbiased cohorts vs apparent 4-25% in serology-gated cohorts","confidence_interval":null,"key_citations":["PMID:31447136","PMID:12590232","PMID:18328437"],"contradicts_guidelines":true,"affected_patient_population":"Marsh 3a patients who are invisible to serology-first algorithms"},{"finding_id":"1.2.4","finding":"Anti-tTG2 titers show moderate-to-strong linear correlation with Marsh grade severity (Spearman r = 0.40-0.70 across studies), with mean fold-rises increasing progressively: 2.6× ULN (Marsh ≤2) → 4.0× (3a) → 5.7× (3b) → 11.8× (3c). The 2023 Qureshi meta-analysis (13 studies, n=2,505) confirmed progressive standardized mean differences across grades (SMD 0.61-1.18, all P<0.00001). However, large within-grade variance (e.g., Marsh 3a: 4.0 ± 3.9× ULN) means individual patients cannot be reliably staged by titer alone.","evidence_strength":"strong","quantitative_estimate":"Spearman r = 0.40-0.70; meta-analysis SMD 0.61-1.18 for Marsh III vs lower grades; high heterogeneity (I² 75-81%)","confidence_interval":"Meta-analysis 95% CIs: SMD 0.67-1.28 (3a vs 0), 0.79-1.18 (3b vs ≤2), 1.02-1.34 (≥3c vs ≤2)","key_citations":["PMID:24583754","PMID:17428743","PMID:38283435","PMID:19824110"],"contradicts_guidelines":false,"affected_patient_population":"All CD patients — titer reflects damage severity on a continuum, not a binary state"},{"finding_id":"1.2.5","finding":"High IgA-tTG2 titers (≥10× ULN) have near-100% specificity for villous atrophy but this threshold captures only ~51% of adult CD patients (Shiha 2024 meta-analysis, 12,103 adults) and 43-56% of pediatric patients. Singh et al. found 43.9% of patients with tTG2 <2× ULN still had biopsy-confirmed CD. Zanini et al. found ≥5× ULN achieved 100% specificity/PPV in 945 Italian adults, suggesting the 10× threshold may be conservative for some populations.","evidence_strength":"strong","quantitative_estimate":"≥10× ULN sensitivity: ~51% in adults, 43-56% in children; 43.9% of low-titer (<2× ULN) patients have confirmed CD","confidence_interval":null,"key_citations":["PMID:24583754","PMID:38176661","PMID:22119616","PMID:28624578"],"contradicts_guidelines":true,"affected_patient_population":"CD patients with low-to-moderate titers — systematically excluded from biopsy-sparing protocols"},{"finding_id":"1.2.6","finding":"Seronegative CD patients are enriched for mild histology AND non-DQ2.5 HLA genotypes. Ríos León et al. found Marsh 3a/Marsh 1 in 34.6% of seronegative vs 3.7% of seropositive CD, and DQ8 in 23.1% vs 2.5%. Pediatric seronegative VA shows 68.8% Marsh 3a. However, seronegative histology is heterogeneous — some cohorts show 96% Marsh 3 including severe cases, and seronegative refractory CD with Marsh 3c exists. This heterogeneity partly contradicts a pure severity-marker model and suggests seronegative CD may include distinct immunological subsets.","evidence_strength":"strong","quantitative_estimate":"Seronegative Marsh 3a/1: 34.6% vs 3.7% seropositive; DQ8: 23.1% vs 2.5%; but some seronegative cohorts show 70-96% Marsh 3","confidence_interval":"P < 0.001 for histology; P < 0.001 for HLA","key_citations":["PMID:31057009","PMID:32833891","PMID:34712436"],"contradicts_guidelines":true,"affected_patient_population":"Seronegative CD patients — a heterogeneous group including both mild disease and immunologically distinct severe disease"},{"finding_id":"1.2.7","finding":"The apparent 'digital pattern' (seropositive patients clustering at Marsh 3b-3c or Marsh 0-1 with few at 3a) is primarily an artifact of verification bias — unbiased cohorts show Marsh 3a as the most common grade. However, there is a contributing biological threshold: high titers (≥5-10× ULN) are near-100% specific for severe disease, creating a genuine threshold effect at the extreme tail. The Marsh 0-1 seropositive cluster ('potential CD') also appears to be biologically real — representing a pre-atrophy stage where antibody production precedes full mucosal destruction.","evidence_strength":"strong","quantitative_estimate":"Marsh 3a = 50% in universal biopsy (FDR) vs 4-25% in serology-gated cohorts; ≥5× ULN = 100% specificity for VA","confidence_interval":null,"key_citations":["PMID:31447136","PMID:32433257","PMID:22119616","PMID:30978358"],"contradicts_guidelines":true,"affected_patient_population":"Marsh 3a patients rendered invisible by serology-gating"},{"finding_id":"1.2.8","finding":"Adults present with milder histology and lower tTG2 titers than children. Vivas et al. found 63% Marsh 3c in children vs 26% in adults. PPV of tTG2 cutoff ≥30 U was 95% in children but only 53% in adults. This partially explains why the ESPGHAN no-biopsy pathway performs well in pediatrics but struggles in adults, though pediatric cohorts may also have selection bias toward symptomatic/severe presentations.","evidence_strength":"strong","quantitative_estimate":"Marsh 3c: 63% children vs 26% adults; PPV at ≥30 U: 95% children vs 53% adults","confidence_interval":null,"key_citations":["PMID:19824110","PMID:38176661"],"contradicts_guidelines":true,"affected_patient_population":"Adult CD patients — systematic underperformance of pediatric-validated thresholds"},{"finding_id":"1.2.9","finding":"HLA gene dose likely influences serological response intensity. DQ2.5 homozygosity associates with higher titers and more severe disease; DQ8 and DQB1*02-only ('half-DQ2') genotypes are overrepresented in seronegative and milder CD (DQ8: 23.1% seronegative vs 2.5% seropositive). This creates an HLA ascertainment bias: non-DQ2.5 patients may be more likely seronegative, never biopsied, and thus absent from CD cohorts.","evidence_strength":"moderate","quantitative_estimate":"DQ8: 23.1% seronegative vs 2.5% seropositive CD; DQ2.2 38.5% in seronegative (Dhingra 2021)","confidence_interval":null,"key_citations":["PMID:31057009","PMID:22197856","PMID:34712436"],"contradicts_guidelines":false,"affected_patient_population":"CD patients with DQ8 or DQB1*02-only genotypes — may require lower serological thresholds or direct biopsy"},{"finding_id":"1.2.10","finding":"Impaired humoral immunity (IgA deficiency, IgG subclass deficiency, low secretory IgA) may contribute to seronegativity in a subset of CD patients, representing a distinct immunological mechanism separate from severity-dependent antibody production. IgA deficiency (2-3% of CD) is recognized; IgG subclass and secretory IgA deficits are under-evaluated. This connects to the project exemplar patient (DQ8, negative IgA-tTG2/DGP, low IgG1, low secretory IgA, Marsh 3A).","evidence_strength":"emerging","quantitative_estimate":"IgA deficiency in CD: 2-3%; contribution of other humoral defects to seronegativity: unquantified","confidence_interval":null,"key_citations":["PMID:30578783","PMID:22197856"],"contradicts_guidelines":false,"affected_patient_population":"CD patients with primary immunodeficiency or immunoglobulin subclass defects"},{"finding_id":"1.2.11","finding":"Potential CD (seropositive with Marsh 0-1) shows variable progression: approximately one-third progress to villous atrophy over 3-12 years, one-third normalize serology despite continued gluten exposure. This supports a model where antibody production can precede or fluctuate independently of histological damage, consistent with serology measuring immune activation rather than mucosal state directly.","evidence_strength":"strong","quantitative_estimate":"33-43% cumulative progression to VA over 3-12 years; 33% serological normalization on gluten","confidence_interval":"Varies by study","key_citations":["PMID:30978358","PMID:39153845"],"contradicts_guidelines":false,"affected_patient_population":"Potential CD patients — management uncertainty"},{"finding_id":"1.2.12","finding":"Subjective histology dramatically underestimates villous atrophy compared to quantitative histomorphometry. Daveson et al. found Marsh 3a or worse in all 26 patients with complete serial sampling, but subjective histology missed villous atrophy in 77% (20/26). Only 35% of US duodenal biopsies submit the recommended ≥4 specimens (Lebwohl), and submitting ≥4 doubles the diagnostic rate.","evidence_strength":"strong","quantitative_estimate":"77% subjective miss rate vs quantitative histology; only 35% submit ≥4 biopsies; ≥4 biopsies doubles diagnostic rate","confidence_interval":null,"key_citations":["DOI:10.1002/ygh2.380","PMID:21668407"],"contradicts_guidelines":true,"affected_patient_population":"All CD patients — biopsy inadequacy compounds serology insensitivity"}],"biases_documented":[{"bias_type":"Verification bias (differential referral for biopsy)","description":"Only 3.6% of IgA-tTG2-negative individuals are referred for biopsy versus 79.2% of positives — a 22-fold differential that makes seronegative CD systematically invisible. This inflates apparent sensitivity from a true ~57% to the reported ~93%. Of 28 studies biopsying all participants, only one was included in the influential 2016 Comparative Effectiveness Review.","magnitude_estimate":"Sensitivity inflation from ~57% (corrected) to ~93% (uncorrected); 22-fold referral differential","evidence_sources":["PMID:32433257","PMID:18328437"]},{"bias_type":"Severity-dependent sensitivity bias","description":"IgA-tTG2 and EMA sensitivity calculations are derived predominantly from cohorts enriched for severe disease (Marsh 3b-3c). The linear titer-severity correlation (r=0.40-0.70) means studies using high-titer or severe cohorts systematically overestimate population-level sensitivity. EMA sensitivity drops ~70% at Marsh 3a vs 3c; tTG2 drops ~30-50%.","magnitude_estimate":"Sensitivity overestimation of 30-50% relative reduction when comparing severe vs mild disease; modern tTG2 assays less affected than EMA","evidence_sources":["PMID:15185855","PMID:10201452","PMID:12590232","PMID:16630760"]},{"bias_type":"Threshold-based selection bias (biopsy-sparing protocols)","description":"Biopsy-sparing protocols based on ≥10× ULN systematically select for severe disease (near-100% Marsh 3b-3c at this threshold), reinforcing the apparent association between CD and severe histology while excluding mild cases from diagnosis. This creates a self-fulfilling prophecy where 'diagnosed CD' appears uniformly severe.","magnitude_estimate":"49-68% of CD patients have titers below ≥10× ULN in adults; these patients require biopsy but many do not receive it","evidence_sources":["PMID:38176661","PMID:24583754","PMID:28624578"]},{"bias_type":"HLA ascertainment bias","description":"Non-DQ2.5 genotypes (DQ8, DQ2.2, DQB1*02-only) may be underrepresented in CD cohorts because patients with these genotypes are more likely to be seronegative (and thus never biopsied), creating apparent enrichment of DQ2.5 in diagnosed CD. The true HLA distribution of all CD may differ substantially from that of serology-detected CD.","magnitude_estimate":"DQ8: 23.1% of seronegative vs 2.5% of seropositive CD; true population distribution unknown","evidence_sources":["PMID:31057009","PMID:34712436"]},{"bias_type":"Marsh grade classification variability","description":"Inter-observer agreement for Marsh-Oberhuber is only fair (κ=0.35-0.486), with particularly poor agreement at the Marsh 3a boundary. The Corazza-Villanacci system (κ=0.55) merges 3a/3b into 'Grade B1' precisely because pathologists cannot reliably distinguish them. Subjective histology misses villous atrophy detected by quantitative histomorphometry in 77% of cases (Daveson 2020). This adds substantial noise to titer-histology correlations.","magnitude_estimate":"κ=0.35 (Marsh-Oberhuber) vs κ=0.55 (Corazza-Villanacci); 77% subjective miss rate","evidence_sources":["PMID:17544877","PMID:21668407","DOI:10.1002/ygh2.380"]},{"bias_type":"Biopsy sampling inadequacy","description":"Only 35% of US duodenal biopsies submit the recommended ≥4 specimens. Villous atrophy is patchy, requiring ≥3-4 biopsies including duodenal bulb. Inadequate sampling disproportionately misses Marsh 3a (patchy mild atrophy), compounding the serology sensitivity problem.","magnitude_estimate":"≥4 biopsies doubles diagnostic rate; 65% of biopsies are suboptimal","evidence_sources":["PMID:21668407","PMID:18058655"]}],"unproven_assumptions_identified":[{"assumption":"IgA-tTG2 serology identifies the presence or absence of CD with ~93% sensitivity","evidence_against":"Verification-bias-corrected sensitivity is 57% (95% CI: 35-76%) (Hujoel 2021). Titer-severity correlation (r=0.40-0.70) shows serology measures mucosal damage intensity, not disease presence. EMA sensitivity drops to 31-33% at Marsh 3a; modern tTG2 to ~50-70%. 43.9% of patients with tTG2 <2× ULN have biopsy-confirmed CD (Singh 2015).","evidence_for":"High titers (>10× ULN) have near-100% PPV for CD; negative serology in severe disease (Marsh 3c) is uncommon","clinical_impact":"Reliance on serology as a screening gate systematically misses mild disease, contributing to diagnostic delays averaging 6-12 years and underdiagnosis of an estimated 60% of CD"},{"assumption":"Seronegative CD is rare (<5% of all CD)","evidence_against":"When verification bias is corrected, seronegative CD may comprise 8-15% of cases in standard cohorts. In FDR screening with universal biopsy, Marsh 3a (the grade most likely seronegative) was 50% of diagnoses. Early less-strict criteria found seronegative rates of 12.7-37.9%.","evidence_for":"Strict Paris Consensus criteria yield 1.7-4.2% seronegative CD; Aziz 2017 found 69% of seronegative villous atrophy was non-celiac","clinical_impact":"Underestimation perpetuates serology-first algorithms that by design cannot detect this population"},{"assumption":"Seronegative CD is a uniform entity with the same pathophysiology as seropositive CD","evidence_against":"Seronegative CD is heterogeneous: some have mild disease (Marsh 3a, DQ8/DQ2.2, low titers), others have severe disease (Marsh 3c) with possible humoral immune deficits (IgA deficiency, IgG subclass deficiency, low secretory IgA). HLA distribution differs (DQ8 23.1% vs 2.5%). Some seronegative severe cases may represent refractory CD or distinct immunological subtypes.","evidence_for":"Both respond to GFD; both have gluten-dependent mucosal injury and compatible HLA","clinical_impact":"A single 'seronegative CD' category obscures distinct subgroups that may require different diagnostic approaches (HLA-stratified vs humoral immunity workup)"},{"assumption":"The serological response is uniform across HLA genotypes","evidence_against":"DQ8 and DQB1*02-only genotypes are overrepresented in seronegative CD (23.1% vs 2.5% for DQ8). HLA-DQ2.5 homozygosity is associated with higher titers and more severe disease. Gene dose effects may modulate immune response intensity.","evidence_for":"Limited data directly comparing titer distributions by HLA haplotype in matched cohorts","clinical_impact":"Patients with non-DQ2.5 genotypes may require lower serological thresholds or direct biopsy approaches"},{"assumption":"Subjective histological assessment of Marsh grade is reliable and sufficient","evidence_against":"Inter-observer κ = 0.35 for Marsh-Oberhuber; Daveson 2020 found subjective histology missed VA in 77% of cases detected by quantitative morphometry; only 35% of biopsies meet adequacy standards","evidence_for":"Corazza-Villanacci system achieves moderate agreement (κ=0.55); experienced pathologists in referral centers perform better","clinical_impact":"Both false-negative serology AND false-negative biopsy compound to create a diagnostic cascade that substantially underestimates CD prevalence"}],"overlooked_populations":[{"population":"CD patients with Marsh 3a (partial villous atrophy) and low-to-negative serology","estimated_size":"26-50% of all CD based on unbiased cohorts (FDR screening: 50% Marsh 3a); substantially underrepresented in serology-gated cohorts (4-25%)","why_missed":"EMA sensitivity ~31-33% for PVA; tTG2 ~50-70%; biopsy-sparing protocols exclude them; patchy atrophy requires ≥4 biopsies but only 35% meet this standard; inter-observer variability worst at Marsh 3a threshold","proposed_solution":"Biopsy all symptomatic patients regardless of serology; develop Marsh 3a-specific biomarkers (mucosal tTG2 deposits, γδ IEL flow cytometry, I-FABP); standardize quantitative histomorphometry; require ≥4 biopsies including duodenal bulb"},{"population":"Seronegative CD patients with DQ8 or DQB1*02-only ('half-DQ2') genetics","estimated_size":"DQ8: 23.1% of seronegative CD vs 2.5% of seropositive; DQ2.2/half-DQ2 prevalence in seronegative CD: likely significant but underquantified","why_missed":"Serology-first algorithms; potentially lower immune response intensity in non-DQ2.5 haplotypes; HLA testing often used only to exclude CD (negative DQ2/DQ8 rules out), not to stratify diagnostic intensity","proposed_solution":"HLA-stratified diagnostic algorithms where DQ8 and half-DQ2 symptomatic patients receive biopsy regardless of serology; research HLA-specific serological cutoffs"},{"population":"CD patients with humoral immune deficits (IgA deficiency, IgG subclass deficiency, low secretory IgA)","estimated_size":"IgA deficiency: 2-3% of CD; IgG subclass deficiency and secretory IgA deficits: unknown prevalence in CD","why_missed":"IgA deficiency is recognized and triggers IgG-based testing; IgG subclass deficits and low secretory IgA are not routinely assessed and may cause false-negative results on standard serological panels including IgG-based tests","proposed_solution":"Routine total IgA measurement with reflex to IgG-based panel; consider IgG subclass panel in seronegative suspected CD; research secretory IgA as diagnostic/prognostic marker"},{"population":"Low-titer seropositive patients (1-5× ULN) who do not meet biopsy-sparing thresholds","estimated_size":"40-55% of all CD patients have titers below ≥10× ULN; 43.9% of patients with tTG2 <2× ULN have confirmed CD","why_missed":"Biopsy-sparing protocols require ≥10× ULN; low-positive results may be dismissed as false positives; no guideline mandates biopsy for all seropositive patients","proposed_solution":"All seropositive patients should receive biopsy regardless of titer level; implement likelihood ratio-based continuous titer interpretation rather than binary cutoffs"},{"population":"Adult CD patients (vs pediatric) — systematically underserved by pediatric-validated thresholds","estimated_size":"Adults represent ~75% of undiagnosed CD; only 26% Marsh 3c (vs 63% children); only 32-51% reach ≥10× ULN","why_missed":"ESPGHAN no-biopsy pathway validated primarily in pediatric cohorts where disease is more severe; adult CD presents with milder histology, lower titers, and more atypical symptoms; adult no-biopsy evidence still evolving","proposed_solution":"Adult-specific validation studies for any biopsy-sparing threshold; lower thresholds (≥5× ULN) may be appropriate in adults with high pre-test probability; maintain mandatory biopsy for adults until adult-specific evidence matures"}],"diagnostic_step_sensitivity":{"step_name":"IgA-tTG2 serology as CD screening/diagnostic gate — stratified by Marsh grade","reported_sensitivity":"92-95% (guideline-cited; derived from verification-biased cohorts enriched for severe disease)","adjusted_sensitivity":"57% overall after Begg-Greenes bias correction (95% CI: 35-76%); by Marsh grade — 3c: ~96%, 3b: ~85%, 3a: EMA 31-33% / tTG2 ~50-70%, Marsh I-II: EMA 0% / tTG2 7.7-30%","false_negative_rate":"Overall: ~43% (bias-corrected); Marsh 3a: ~30-70% depending on marker and assay; Marsh I-II: ~70-92%","key_limitations":["Sensitivity calculations in guidelines derived from cohorts with 22-fold differential biopsy referral favoring seropositives","EMA and tTG2 sensitivity at Marsh 3a differ substantially — EMA worse (~31-33%) than modern tTG2 (~50-70%)","Threshold-based cutoffs (≥10× ULN) optimize specificity at cost of sensitivity — captures only ~51% of adult CD","Linear titer-histology correlation means sensitivity varies continuously with severity, not at a fixed threshold","Inter-laboratory variability: sensitivity ranged from 40% to 86% across commercial labs in same cohort (Brar 2006)","No standardized 'fold-rise' calculation method across assays — 10× ULN means different things for different kits","HLA genotype (DQ2.5 vs DQ8 vs half-DQ2) may independently modulate serological response intensity","Subjective histology itself misses VA in 77% of cases detected by quantitative morphometry — the 'gold standard' is imperfect"]},"contradictory_studies":[{"citation":"Hujoel IA et al. Estimating the Impact of Verification Bias on Celiac Disease Testing","pmid":"32433257","finding":"Begg-Greenes bias correction drops IgA-tTG2 sensitivity from 92.6% to 57.1% (95% CI: 35.4-76.4%). Only 3.6% of tTG-negative individuals were biopsied vs 79.2% of positives.","contradicts":"All major guidelines citing ~93% sensitivity for IgA-tTG2"},{"citation":"Rostami K et al. Sensitivity of antiendomysium and antigliadin antibodies in untreated celiac disease: disappointing in clinical practice","pmid":"10201452","finding":"EMA sensitivity was 100% in Marsh 3c but only 31% in Marsh 3a (9/29); 0% in Marsh I-II. Authors describe clinical sensitivity as 'disappointing'.","contradicts":"Guideline statements that serology has >90% sensitivity for CD regardless of severity"},{"citation":"Abrams JA et al. Seronegative celiac disease: increased prevalence with lesser degrees of villous atrophy","pmid":"15185855","finding":"EMA 77% TVA vs 33% PVA (P<0.001); all anti-tTG2-positive patients had TVA only — zero tTG2-positive PVA patients in this cohort","contradicts":"Assumption that tTG2 detects CD across all severity grades"},{"citation":"Dickey W et al. Reliance on serum endomysial antibody testing underestimates true prevalence","pmid":"10720117","finding":"EMA sensitivity 78% overall (69/89), with similar rates for PVA (79%) and ST/TVA (77%). Less severity-dependence than other cohorts.","contradicts":"The strong severity-dependence seen in Abrams/Rostami; suggests cohort heterogeneity in severity-sensitivity relationship"},{"citation":"Singh P et al. Titers of anti-tTG correlate with severity of villous abnormalities","pmid":"24583754","finding":"43.9% of individuals with anti-tTG titer <2× ULN had biopsy-confirmed CD","contradicts":"Assumption that low-titer positives are likely false positives requiring no biopsy"},{"citation":"Brar P et al. Utility of IgA-tTG antibody for diagnosis of celiac disease","pmid":"16630760","finding":"IgA-tTG2 sensitivity 90% TVA but only 42% PVA (P<0.0001); inter-laboratory sensitivity ranged from 40% to 86% for same cohort","contradicts":"Assumption that IgA-tTG2 has uniform ~93% sensitivity across disease severity and assay platforms"},{"citation":"Elitsur Y et al. TTG levels not sufficient for diagnosis without biopsies","pmid":"27778203","finding":"PPV of tTG ≥10× ULN was only 87.7% in North American pediatric practice; accuracy 70.8%","contradicts":"ESPGHAN guidance that tTG ≥10× ULN allows biopsy-sparing diagnosis with near-certainty"},{"citation":"Ríos León R et al. Genetic and flow cytometry analysis of seronegative celiac disease","pmid":"31057009","finding":"Seronegative CD had 34.6% Marsh I vs 3.7% seropositive; HLA-DQ8 was 23.1% vs 2.5%","contradicts":"Assumption that seronegative CD has same histological and genetic distribution as seropositive CD"}],"research_gaps":[{"gap":"No large study has compared Marsh grade distributions in the same population using serology-gated versus universal-biopsy approaches — the definitive test of verification bias magnitude","importance":"high","proposed_study_design":"Prospective cohort where ALL symptomatic patients and at-risk individuals receive duodenal biopsy (≥4 specimens including bulb) regardless of serology results, with blinded histological assessment by both subjective and quantitative methods. Calculate sensitivity/specificity/PPV/NPV by Marsh grade. Minimum n=500 biopsied."},{"gap":"HLA-stratified analysis of serology performance is virtually absent — no study has directly compared titer distributions and sensitivity by DQ2.5 homozygous vs heterozygous vs DQ2.2 vs DQ8 vs DQB1*02-only","importance":"high","proposed_study_design":"Large cohort with full HLA-DQ typing including gene dose (homozygous vs heterozygous), analyzing tTG2 titer distributions, serological sensitivity, and Marsh grade distribution by HLA haplotype. Would test whether HLA-specific serological thresholds are needed."},{"gap":"Investigation of humoral immune deficits (IgG subclass, secretory IgA, B-cell function) as cause of seronegativity in CD","importance":"high","proposed_study_design":"Case-control: seronegative CD vs seropositive CD vs healthy controls. Measure total IgA, IgG subclasses (1-4), secretory IgA, B-cell subsets, and mucosal tTG2 deposits. Test whether humoral deficits predict seronegativity independent of Marsh grade."},{"gap":"Standardized quantitative histomorphometry for CD diagnosis — Daveson 2020 showed subjective histology misses 77% of VA detected quantitatively, but no validated protocol exists","importance":"high","proposed_study_design":"Multi-center validation of villus height:crypt depth ratio measurement protocol. Compare subjective Marsh grading vs quantitative morphometry in same specimens. Define quantitative thresholds for diagnosis. Assess whether quantitative methods reduce inter-observer variability."},{"gap":"Longitudinal natural history of untreated Marsh 3a — unknown whether it represents stable mild disease, a waypoint to severe atrophy, or a fluctuating state","importance":"high","proposed_study_design":"Ethically challenging but critical: prospective follow-up of Marsh 3a patients (newly detected, e.g., in screening) with serial biopsy at 1, 3, 5 years to track progression/regression rates. Alternative: retrospective analysis of cohorts with repeated biopsies."},{"gap":"Likelihood ratio-based (continuous) interpretation of tTG2 titers vs binary (positive/negative or ≥10× ULN) — no guideline has adopted this despite evidence that LR varies from 2.0 at low titers to 319 at high titers","importance":"high","proposed_study_design":"Prospective multicenter study with pre-test probability assessment, continuous tTG2 titer measurement, mandatory biopsy, and Bayesian post-test probability calculation. Develop clinical decision tool with titer-specific LRs."},{"gap":"Clinical characterization of Marsh 3a CD patients — demographics, symptoms, nutritional deficiencies, comorbidities, and outcomes are poorly defined","importance":"medium","proposed_study_design":"Multicenter registry of Marsh 3a patients at diagnosis, compared to Marsh 3b-3c and Marsh I-II, tracking symptoms, nutritional markers, bone density, and GFD response over 2+ years."}],"differential_diagnoses_relevant":[{"condition":"Non-celiac gluten sensitivity (NCGS)","overlap_with_cd":"Symptoms respond to GFD; may present with Marsh 0-1 and negative serology; some patients may have increased IELs","distinguishing_features":"No IgA-tTG2, EMA, or DGP antibodies; Marsh 0-1 only (no villous atrophy); no mucosal tTG2 deposits; symptom response without histological changes; HLA-DQ2/DQ8 not required"},{"condition":"IgA deficiency-associated CD","overlap_with_cd":"Complete histological overlap; IgA-based serology falsely negative by definition","distinguishing_features":"Total serum IgA <7 mg/dL; IgG-tTG2 and IgG-DGP should be positive; requires routine total IgA measurement with reflex to IgG-based panel"},{"condition":"Common variable immunodeficiency (CVID)","overlap_with_cd":"Villous atrophy, malabsorption, increased IELs; typically seronegative due to hypogammaglobulinemia","distinguishing_features":"Low total immunoglobulins (IgG, IgA, IgM); recurrent sinopulmonary infections; may have nodular lymphoid hyperplasia; does not respond to GFD; absent plasma cells on biopsy"},{"condition":"Olmesartan-induced enteropathy","overlap_with_cd":"Severe villous atrophy with increased IELs; seronegative; can present identically to severe CD","distinguishing_features":"History of olmesartan (or other ARB) use; resolves with drug discontinuation (weeks to months); no HLA-DQ2/DQ8 association required; no mucosal tTG2 deposits"},{"condition":"Autoimmune enteropathy","overlap_with_cd":"Villous atrophy, increased IELs; may be seronegative for CD markers; can coexist with CD","distinguishing_features":"Anti-enterocyte antibodies; anti-goblet cell antibodies; often associated with other autoimmune conditions (thyroid, type 1 diabetes); poor GFD response; may require immunosuppression"},{"condition":"Tropical sprue","overlap_with_cd":"Villous atrophy, malabsorption, increased IELs in proximal small bowel; seronegative for CD","distinguishing_features":"Geographic history (tropical regions); responds to antibiotics + folate; typically affects jejunum more than duodenum; megaloblastic anemia common"},{"condition":"Giardiasis","overlap_with_cd":"Can cause villous atrophy and increased IELs; seronegative for CD; may coexist","distinguishing_features":"Stool testing for Giardia (antigen or PCR); responds to antiparasitic treatment; travel or water exposure history"}],"recommendations":[{"recommendation":"Revise guideline language to explicitly state that IgA-tTG2 sensitivity is severity-dependent, with true population sensitivity estimated at ~57% after verification bias correction (95% CI: 35-76%), substantially below the commonly cited 93%. State that sensitivity at Marsh 3a is ~50-70% for tTG2 and ~31-33% for EMA.","target":"guidelines","evidence_basis":"Hujoel 2021 Begg-Greenes correction; Rostami 1999, Abrams 2004, Tursi 2003, Brar 2006 Marsh-stratified data"},{"recommendation":"Biopsy ALL seropositive patients regardless of titer level. Eliminate titer-based thresholds as biopsy-avoidance gates in adults until adult-specific validation with bias correction is available.","target":"guidelines","evidence_basis":"43.9% of patients with tTG2 <2× ULN have confirmed CD (Singh 2015); ≥10× ULN captures only 51% of adult CD (Shiha 2024); Elitsur PPV only 87.7% at ≥10× ULN in practice"},{"recommendation":"Adopt likelihood ratio-based continuous titer interpretation rather than binary positive/negative or ≥10× ULN thresholds. Provide clinicians with titer-specific likelihood ratios for integration with pre-test probability.","target":"guidelines","evidence_basis":"LR varies from 2.0 at low titers to 319 at high titers (Vermeersch 2010); continuous interpretation substantially outperforms binary cutoffs"},{"recommendation":"Biopsy symptomatic patients with negative serology AND high pre-test probability, especially those with HLA-DQ8 or DQB1*02-only genotypes, family history of CD, or other autoimmune conditions.","target":"clinicians","evidence_basis":"DQ8 overrepresentation in seronegative CD (23.1% vs 2.5%); verification bias means negative serology does not reliably exclude CD; 9.1% of biopsy-proven CD is seronegative in universal-biopsy studies (Hopper 2008)"},{"recommendation":"Include total IgA measurement with every IgA-tTG2 test. In seronegative suspected CD, consider IgG subclass panel and secretory IgA assessment to identify humoral immune deficits that may explain seronegativity.","target":"clinicians","evidence_basis":"IgA deficiency (2-3% of CD) causes false-negative IgA-based testing; IgG subclass and secretory IgA deficits may represent additional mechanisms of seronegativity; connects to project exemplar patient profile"},{"recommendation":"Require minimum 4-6 oriented duodenal biopsies including duodenal bulb for all CD diagnostic evaluations. Pursue standardized quantitative histomorphometry to complement or replace subjective Marsh grading.","target":"clinicians","evidence_basis":"Only 35% of US biopsies meet ≥4 specimen standard (Lebwohl); ≥4 specimens doubles diagnostic rate; subjective histology misses 77% of VA detected quantitatively (Daveson 2020)"},{"recommendation":"Adopt Corazza-Villanacci classification (Grade A: non-atrophic; Grade B1: atrophic PVA; Grade B2: atrophic TVA) to reduce inter-observer variability, while advocating for quantitative morphometry development.","target":"guidelines","evidence_basis":"Inter-observer κ improves from 0.35 (Marsh-Oberhuber) to 0.55 (Corazza-Villanacci); the 3a/3b distinction is unreliable"},{"recommendation":"Fund and prioritize a prospective universal-biopsy study in symptomatic populations to definitively quantify verification bias magnitude and true serology sensitivity by Marsh grade.","target":"researchers","evidence_basis":"Hopper 2008 (n=2,000 universal biopsy) is the closest approximation but yielded only 77 CD cases; larger studies needed. No study has directly compared Marsh grade distributions from serology-gated vs universal-biopsy approaches in same population."}],"meta_analysis_summary":{"studies_reviewed":52,"total_patients":null,"pooled_estimates":{"verification_bias_corrected_ttg2_sensitivity":"57% (95% CI: 35-76%)","guideline_reported_ttg2_sensitivity":"92-95%","ema_sensitivity_total_villous_atrophy":"77-100%","ema_sensitivity_partial_villous_atrophy":"31-33% (range: 31-79% — Dickey 2000 outlier at 79%)","ttg2_sensitivity_marsh_3a_modern_assays":"~50-70% (estimated from titer distributions; direct data limited)","ttg2_sensitivity_marsh_3c":"~96%","titer_severity_correlation_spearman_r":"0.40-0.70 across studies","meta_analysis_smd_marsh3_vs_lower":"0.61-1.18 (Qureshi 2023; I²=75-81%)","ten_x_uln_sensitivity_adults":"~51% (Shiha 2024 meta-analysis, n=12,103)","ten_x_uln_sensitivity_children":"43-56%","seronegative_cd_prevalence_standard_cohorts":"8-15%","seronegative_cd_prevalence_strict_paris_criteria":"1.7-4.2%","marsh_3a_proportion_universal_biopsy":"22-50%","marsh_3a_proportion_serology_gated":"4-25%","marsh_3a_in_seronegative_cd":"34-69%","dq8_seronegative_vs_seropositive":"23.1% vs 2.5%","biopsy_adequacy_rate_4_specimens":"35%","subjective_histology_miss_rate_vs_quantitative":"77%","interobserver_kappa_marsh_oberhuber":"0.35-0.486","interobserver_kappa_corazza_villanacci":"0.55","potential_cd_progression_to_va":"33-43% over 3-12 years"},"heterogeneity_notes":"Substantial heterogeneity across studies due to: (1) different tTG2 assay platforms and variable ULN definitions making 'fold-rise' comparisons unreliable across studies; (2) EMA vs modern tTG2 sensitivity at Marsh 3a differs substantially (EMA worse) — older studies using EMA overstate the severity-dependence for modern tTG2; (3) Marsh-Oberhuber vs Corazza-Villanacci classification systems with different granularity; (4) population differences (pediatric vs adult, symptomatic vs screening, European vs North American); (5) HLA composition differences across cohorts; (6) Dickey 2000 showed less severity-dependence than Abrams 2004, suggesting cohort-specific factors influence sensitivity-gradient magnitude. The Hujoel verification bias CI (35-76%) reflects genuine uncertainty in the true sensitivity estimate. Direct comparison across studies is limited, but the direction of effect (sensitivity drops with lower Marsh grade) is consistent across virtually all studies."}}
