{"research_topic_id":"2.1","research_topic_title":"Pathologist Agreement on Celiac Disease Histopathology","date_completed":"2026-02-07","executive_summary":"Inter-observer agreement for celiac disease histopathology using the Marsh-Oberhuber classification is only fair (κ=0.31–0.49), with the diagnostically critical Marsh 3a boundary showing the worst reproducibility (κ<0.50) and up to 41% downgrading to normal in referral populations. The Denholm 2024 study proved histology is not independent of serology—pathologist agreement improves 10% when IgA-tTG2 results are provided—meaning seronegative patients face compounded diagnostic failure: they have milder lesions at the worst-agreement boundary, and pathologists lack the serology anchor that improves interpretation. Quantitative morphometry (ICC>0.97) and emerging AI models (96–97% accuracy) offer the only paths to objective, reproducible assessment, while the 2025 ESsCD guidelines now provide the first structured SNVA diagnostic algorithm acknowledging seronegative CD.","key_findings":[{"finding_id":"2.1.1","finding":"Inter-observer agreement for Marsh-Oberhuber classification is only fair (κ=0.31–0.49), while the simplified Corazza-Villanacci system achieves fair-to-moderate agreement (κ=0.39–0.55 in rigorous multi-center studies, up to 0.70 in some designs). Three independent analyses converge on these ranges.","evidence_strength":"strong","quantitative_estimate":"Marsh-Oberhuber κ=0.31–0.49; Corazza-Villanacci κ=0.39–0.55 (benchmark studies); binary CD diagnosis κ=0.59–0.85","confidence_interval":null,"key_citations":["PMID:17544877","PMID:29372596","PMID:21668407","DOI:10.1136/bmjgast-2023-001252"],"contradicts_guidelines":false,"affected_patient_population":"All patients undergoing duodenal biopsy for CD evaluation"},{"finding_id":"2.1.2","finding":"Binary CD diagnosis agreement is moderate without serology (κ=0.59) but improves to κ=0.67 when pathologists have access to IgA-tTG2 results, proving histology interpretation depends on serology rather than being independent. This is the most direct evidence that biopsy is not a true independent gold standard.","evidence_strength":"strong","quantitative_estimate":"κ=0.59 without serology → κ=0.67 with serology (10% relative improvement)","confidence_interval":"±0.08–0.11 SD","key_citations":["DOI:10.1136/bmjgast-2023-001252"],"contradicts_guidelines":true,"affected_patient_population":"Seronegative patients—their biopsies are interpreted without the diagnostic anchor that improves pathologist agreement, creating systematically worse histological assessment"},{"finding_id":"2.1.3","finding":"Marsh 3a (partial villous atrophy) shows the highest disagreement among pathologists, with κ consistently <0.50. In referral populations (Arguelles-Grande et al.), up to 41% of expert-confirmed Marsh 3a lesions were called normal by community/commercial pathologists. The true population misclassification rate is likely 20–30%, still clinically unacceptable. Corazza 2007 called Marsh 2/3a assessment 'unacceptably unreliable' even among experts.","evidence_strength":"strong","quantitative_estimate":"κ<0.50 for Marsh 3a; 20–30% estimated population misclassification (up to 41% in referral populations enriched for discordant cases)","confidence_interval":null,"key_citations":["PMID:17544877","PMID:29372596","PMID:21668407","PMID:19668797"],"contradicts_guidelines":false,"affected_patient_population":"Patients with partial villous atrophy—the population most likely to be seronegative per Abrams 2004 inverse relationship"},{"finding_id":"2.1.4","finding":"Seronegative CD patients face compounded diagnostic failure at the histology step: (1) they have milder villous atrophy (Marsh 3a) per the inverse serology-histology relationship, (2) Marsh 3a has the worst inter-observer agreement, (3) pathologists perform 10% worse without serology to guide them, and (4) no positive serology triggers re-biopsy or specialist referral. This creates a 'triple hit' against diagnosis.","evidence_strength":"strong","quantitative_estimate":"Abrams 2004: 77% EMA+ with Marsh 3c vs only 33% EMA+ with Marsh 3a; Denholm 2024: 10% agreement drop without serology","confidence_interval":null,"key_citations":["DOI:10.1136/bmjgast-2023-001252","PMID:15082587","PMID:17544877"],"contradicts_guidelines":true,"affected_patient_population":"Seronegative CD patients, estimated 5–10% of all CD (possibly higher in non-European populations)"},{"finding_id":"2.1.5","finding":"Expert re-review changes diagnosis in 22–78% of borderline cases referred to tertiary centers. Arguelles-Grande et al. found expert review increased CD diagnosis rate by 20%, with 25% of 102 cases receiving a changed diagnosis. Practice setting strongly predicts accuracy: university pathologists κ=0.888 vs community κ=0.465 vs commercial labs κ=0.419 against expert.","evidence_strength":"strong","quantitative_estimate":"22–78% diagnosis change on re-review; κ=0.888 (university) vs 0.419 (commercial)","confidence_interval":null,"key_citations":["PMID:19668797","PMID:26636651"],"contradicts_guidelines":false,"affected_patient_population":"Patients diagnosed in community/commercial settings without specialist GI pathology"},{"finding_id":"2.1.6","finding":"Tangential sectioning creates artifactual 'normal villi' appearance—the same biopsy block cut perpendicularly shows Marsh 3a–3b while tangentially cut appears Marsh 0–1. Five pathologists unanimously agreed on both readings of the same tissue. Only 57.1% of biopsies were correctly oriented in the PreventCD multicenter study.","evidence_strength":"strong","quantitative_estimate":"Same tissue: perpendicular = Marsh 3a–3b; tangential = Marsh 0–1; 57.1% orientation compliance","confidence_interval":null,"key_citations":["PMID:23717652","PMID:29372596"],"contradicts_guidelines":false,"affected_patient_population":"All patients with suboptimally oriented biopsies (~43% per PreventCD)"},{"finding_id":"2.1.7","finding":"Only 35% of US endoscopists obtain ≥4 biopsy specimens as per guidelines. Guideline compliance produces a 2.6× higher CD diagnosis rate (1.8% vs 0.7%, p<0.0001). 14–19% of CD patients have patchy villous atrophy and 9–14% have atrophy only in the duodenal bulb, making multiple-site sampling essential.","evidence_strength":"strong","quantitative_estimate":"35% compliance; 2.6× diagnostic yield improvement; 14–19% patchy VA","confidence_interval":null,"key_citations":["PMID:22248601"],"contradicts_guidelines":false,"affected_patient_population":"~65% of biopsied patients receiving substandard protocols"},{"finding_id":"2.1.8","finding":"CD3 immunohistochemistry detects approximately 10% additional CD cases missed on H&E alone (Mubarak 2015: 6.3% actual diagnosis change in 159 children). It improves IEL counting accuracy but does not significantly improve inter-observer agreement for Marsh grading itself. Most useful when serology and H&E are discordant, not as routine screening.","evidence_strength":"moderate","quantitative_estimate":"~10% additional case detection; concordance H&E vs CD3 only 66.8% (κ=0.33)","confidence_interval":null,"key_citations":["PMID:26140002","PMID:23765228"],"contradicts_guidelines":false,"affected_patient_population":"Patients with borderline IEL counts, especially seronegative patients where CD3 may be the difference between diagnosis and dismissal"},{"finding_id":"2.1.9","finding":"Michael Marsh (original classification author, 2015) explicitly rejected the Oberhuber 3a/3b/3c subdivisions as 'misinterpretations' based on correlative light and scanning electron microscopy. In a 2019 review, he stated they impose 'enormous extra work with no aid in diagnosis, treatment, or prognosis.' Analysis of >3,000 biopsies showed 'the means do not differ' between subdivisions but individual values show 'enormous variation.'","evidence_strength":"strong","quantitative_estimate":">3,000 biopsies analyzed; no significant mean differences between 3a/3b/3c","confidence_interval":null,"key_citations":["PMID:25926934"],"contradicts_guidelines":true,"affected_patient_population":"All patients whose diagnosis depends on Marsh sub-grading"},{"finding_id":"2.1.10","finding":"Quantitative morphometry (villous height:crypt depth ratio) achieves near-perfect reproducibility (ICC >0.97), an order of magnitude better than any subjective classification. AI/ML models in 2025 achieve 96–97% accuracy for CD histopathology, potentially surpassing the ~80% agreement ceiling of human pathologists.","evidence_strength":"strong","quantitative_estimate":"VH:CrD ICC=0.978 interobserver, 0.983 intraobserver; AI accuracy 96–97%","confidence_interval":null,"key_citations":["PMID:23717652","DOI:10.1056/AIoa2400738"],"contradicts_guidelines":false,"affected_patient_population":"All patients—quantitative/AI approaches could eliminate subjective variability"},{"finding_id":"2.1.11","finding":"The 2025 ESsCD guidelines now provide the first structured diagnostic algorithm for seronegative villous atrophy (SNVA), including HLA-DQ2/DQ8 typing, gluten challenge, gamma-delta IEL assessment, and a conditional no-biopsy pathway for adults with IgA-tTG2 ≥10× ULN. This represents the field's first formal acknowledgment of the seronegative diagnostic gap.","evidence_strength":"strong","quantitative_estimate":null,"confidence_interval":null,"key_citations":["DOI:10.1002/ueg2.70119"],"contradicts_guidelines":false,"affected_patient_population":"Seronegative patients with villous atrophy; adults eligible for no-biopsy pathway"}],"biases_documented":[{"bias_type":"Circular validation bias (histology depends on serology)","description":"Denholm 2024 proved histology is not independent of serology: pathologist agreement improves 10% when IgA-tTG2 results are provided. Serology sensitivity is then validated against histology interpreted with knowledge of serology. This creates an unfalsifiable circular system where neither test is independently validated.","magnitude_estimate":"10% improvement in histology agreement when serology provided; direction of bias always inflates apparent serology accuracy","evidence_sources":["DOI:10.1136/bmjgast-2023-001252","PMID:32433257"]},{"bias_type":"Compounded verification bias against seronegative patients","description":"Seronegative patients face a 'triple hit': (1) no positive serology triggers biopsy, (2) Marsh 3a (their typical lesion per Abrams 2004 inverse relationship) has worst pathologist agreement, (3) pathologists lack the serology anchor that improves their agreement by 10%. Hujoel 2021 showed serology-negative patients are biopsied only 3.6% of the time vs 79.2% for serology-positive.","magnitude_estimate":"79.2% vs 3.6% biopsy rate; IgA-tTG2 sensitivity drops from 92.6% to estimated 57.1% after verification bias correction","evidence_sources":["PMID:32433257","DOI:10.1136/bmjgast-2023-001252","PMID:15082587"]},{"bias_type":"Inverse serology-histology relationship amplifies diagnostic failure","description":"Abrams et al. (2004) found 77% EMA positivity with total villous atrophy (Marsh 3c) but only 33% with partial villous atrophy (Marsh 3a). Patients most likely to be seronegative are precisely those with Marsh 3a lesions—where pathologist agreement is worst. This compounds the diagnostic failure cascade.","magnitude_estimate":"77% EMA+ at Marsh 3c vs 33% EMA+ at Marsh 3a","evidence_sources":["PMID:15082587"]},{"bias_type":"Technical artifact bias (specimen orientation)","description":"Tangentially sectioned biopsies produce artifactual normal villi from true villous atrophy. This disproportionately affects Marsh 3a where merged villous ridges can appear as tall normal villi when cut obliquely. Only 57.1% of biopsies were correctly oriented in multicenter studies.","magnitude_estimate":"Can convert true Marsh 3a–3b to apparent Marsh 0–1; 43% suboptimal orientation rate","evidence_sources":["PMID:23717652","PMID:29372596"]},{"bias_type":"Referral population bias in misclassification estimates","description":"The frequently cited 41% Marsh 3a misclassification rate (Arguelles-Grande) derives from a referral population seeking second opinions—inherently enriched for discordant cases. The true population misclassification rate is likely 20–30%, which is still clinically unacceptable but should be distinguished from the upper-bound referral figure.","magnitude_estimate":"41% is upper bound (referral); 20–30% estimated population rate","evidence_sources":["PMID:19668797"]},{"bias_type":"Practice setting bias","description":"Agreement studies using expert GI pathologists from academic centers overestimate real-world reliability. University pathologists achieve κ=0.888 against expert reviewers, but community hospitals achieve only κ=0.465 and commercial laboratories κ=0.419. Most patients are diagnosed in non-expert settings.","magnitude_estimate":"κ=0.888 (university) vs κ=0.419 (commercial); 2.1× reliability gap","evidence_sources":["PMID:19668797","PMID:29372596"]}],"unproven_assumptions_identified":[{"assumption":"Biopsy is a reliable independent gold standard for validating serology","evidence_against":"Denholm 2024 proved histology depends on serology (10% agreement improvement with tTG2 results); inter-observer agreement only moderate (κ=0.59–0.67); Hujoel 2021 showed verification bias drops apparent tTG2 sensitivity from 92.6% to 57.1%","evidence_for":"Binary VA detection achieves κ=0.84 in expert centers under optimal conditions; Marsh 3c is reliably identified (κ≈0.75)","clinical_impact":"All serology sensitivity estimates are based on a reference standard that is neither independent nor highly reliable—the true sensitivity of IgA-tTG2 is unknown"},{"assumption":"Marsh 3a/3b/3c subdivisions have clinical utility","evidence_against":"Marsh (original author) analyzed >3,000 biopsies: means do not differ between grades; κ<0.40 for subtype agreement; all grades receive identical treatment (GFD); no demonstrated differential prognosis","evidence_for":"Some studies suggest correlation with symptom severity and tTG2 titer, but this may be confounded by serology-histology correlation rather than representing independent prognostic value","clinical_impact":"Pathologists expend significant effort on unreliable distinctions that don't change treatment; sub-grading may falsely reassure clinicians about precision"},{"assumption":"Negative histology in a seronegative patient rules out celiac disease","evidence_against":"Pathologist agreement for borderline histology is worst without serology context; tangential sectioning can make Marsh 3a appear normal; Marsh 3a is the grade most associated with seronegativity; 43% of biopsies are suboptimally oriented","evidence_for":"True Marsh 3c (total VA) is reliably detected; if multiple well-oriented biopsies from an expert center show normal mucosa, CD is less likely","clinical_impact":"Seronegative patients with partial VA may be systematically missed, contributing to the estimated 75–90% undiagnosed CD population"},{"assumption":"Community pathology provides adequate CD diagnostic accuracy","evidence_against":"κ=0.419 for commercial labs vs κ=0.888 for university pathologists against expert; 86% of outside reports lacked IEL count data; expert re-review changes 22–78% of borderline diagnoses","evidence_for":"Binary presence/absence of severe VA (Marsh 3c) is more reliably detected even in community settings","clinical_impact":"Most CD diagnoses occur outside expert centers; the diagnostic accuracy experienced by most patients is substantially worse than reported in academic studies"}],"overlooked_populations":[{"population":"Seronegative patients with partial villous atrophy (Marsh 3a)","estimated_size":"Unknown but likely substantial; 5–10% of all CD may be seronegative; Abrams 2004 shows 67% of Marsh 3a patients are EMA-negative","why_missed":"Triple failure: (1) no serology trigger for biopsy, (2) worst pathologist agreement at Marsh 3a boundary (κ<0.50), (3) pathologists lack the serology anchor that improves agreement by 10%. Even if biopsied, diagnosis depends on a subjective assessment at its least reliable threshold.","proposed_solution":"Symptom-based biopsy criteria independent of serology; mandatory CD3 IHC and expert pathology review for seronegative patients; apply 2025 ESsCD SNVA diagnostic algorithm including HLA typing and gamma-delta IEL assessment"},{"population":"Patients biopsied in community/commercial settings without guideline compliance","estimated_size":"~65% of biopsied patients in the US (only 35% receive ≥4 specimens); likely similar or worse globally","why_missed":"Insufficient sampling (1–3 biopsies) reduces sensitivity for patchy VA (14–19% of CD); poor orientation (43% suboptimal) causes tangential sectioning artifacts; non-specialist pathologists miss subtle lesions","proposed_solution":"Enforce ≥4–6 oriented biopsies including bulb; acetate cellulose filter paper mounting; mandatory quality metrics in pathology reports; endoscopy quality measures"},{"population":"Non-European populations with potential different serology-histology relationships","estimated_size":"Unknown; UAB registry found 80% of Black CD patients had negative IgA-tTG2","why_missed":"Nearly all inter-observer studies use European or North American cohorts; serology cutoffs may not generalize; genetic background (DQ8 vs DQ2.5) may affect phenotype","proposed_solution":"Include diverse populations in agreement studies; validate serology-histology correlations across ethnicities; consider population-specific diagnostic thresholds"}],"diagnostic_step_sensitivity":{"step_name":"Histopathological interpretation of duodenal biopsy","reported_sensitivity":"~95% (based on expert center studies with seropositive patients under optimal conditions)","adjusted_sensitivity":"Estimated 70–85% in community settings for seropositive patients; likely 50–70% for seronegative Marsh 3a cases (compounding: 20–30% misclassification at Marsh 3a × 10% worse agreement without serology × 43% suboptimal orientation × 65% substandard sampling)","false_negative_rate":"Estimated 15–30% overall in real-world practice; up to 30–50% for seronegative Marsh 3a in community settings","key_limitations":["Inter-observer agreement only moderate (κ=0.59–0.67 for binary diagnosis)","Agreement drops 10% without serology data (Denholm 2024)","Marsh 3a has poorest reproducibility (κ<0.50)","Tangential sectioning converts true VA to apparent normal (43% suboptimal orientation)","Only 35% of US biopsies meet ≥4 specimen guideline","CD3 immunohistochemistry not routinely performed","Practice setting introduces 2.1× reliability gap (university vs commercial)","Inverse serology-histology relationship means seronegative patients have milder lesions at worst-agreement boundary","86% of community reports lack IEL count data"]},"contradictory_studies":[{"citation":"Marsh MN, Johnson MW, Rostami K. Gastroenterol Hepatol Bed Bench. 2015;8(2):83-92","pmid":"25926934","finding":"Original Marsh classification author used correlative light and scanning electron microscopy to demonstrate that Oberhuber's 3a/3b/3c subdivisions are 'misinterpretations of the histological appearances of flattened mucosae.' Analysis of >3,000 biopsies showed no meaningful differences between subdivision means.","contradicts":"Current widespread clinical use of Marsh-Oberhuber classification with 3a/3b/3c subdivisions; most pathology reports still use this system despite the original author's rejection"},{"citation":"Denholm J et al. BMJ Open Gastro. 2024;11:e001252","pmid":"38302475","finding":"Pathologist agreement improved significantly (κ=0.59→0.67, 10% relative improvement) when IgA-tTG2 results were provided, proving histology interpretation depends on serology and is not an independent reference standard.","contradicts":"Fundamental assumption that biopsy provides independent gold-standard validation of serology; guidelines treating histology and serology as independently confirmatory"},{"citation":"Hujoel IA et al. Clin Gastroenterol Hepatol. 2021;19(2):380-381","pmid":"32433257","finding":"After mathematical correction for verification bias (79.2% biopsy rate for serology-positive vs 3.6% for serology-negative), IgA-tTG2 sensitivity dropped from 92.6% to estimated 57.1% (95% CI: 35.4–76.4%)","contradicts":"Commonly cited IgA-tTG2 sensitivity of >90–95% used to justify serology-first diagnostic algorithms"},{"citation":"Abrams JA et al. J Clin Gastroenterol. 2004;38(9):784-789","pmid":"15082587","finding":"Only 33% EMA positivity with partial villous atrophy (Marsh 3a) versus 77% with total villous atrophy (Marsh 3c), demonstrating an inverse relationship between serology positivity and histological severity that compounds diagnostic failure for milder disease","contradicts":"Assumption that serology reliably identifies all severities of CD; guidelines recommending serology as primary screening assume uniform sensitivity across disease spectrum"},{"citation":"Shiha MG et al. Gastroenterology. 2024;166(4):621-634","pmid":"38176661","finding":"Meta-analysis of no-biopsy approach (18 studies, 12,103 participants): specificity 100% but sensitivity only 51% at tTG2 ≥10× ULN, meaning 49% of CD patients are missed by the no-biopsy pathway. Authors noted 'false-positive serology' cases may represent 'false-negative histology.'","contradicts":"Narrative that no-biopsy pathway can replace biopsy for most patients; in reality it identifies only half of CD patients (though with very high confidence for those identified)"}],"research_gaps":[{"gap":"No study has measured pathologist agreement specifically for seronegative patients with borderline histology","importance":"high","proposed_study_design":"Blinded re-review study: expert pathologists grade biopsies from seronegative patients (1) without knowledge of seronegativity, (2) with knowledge of seronegativity, (3) compared to seropositive controls. Measure whether seronegativity influences grading and quantify agreement differences."},{"gap":"No formal meta-analysis pooling all published kappa values for celiac histopathology inter-observer agreement","importance":"high","proposed_study_design":"Systematic review and meta-analysis of all inter-observer agreement studies using standard methodology (PRISMA, QUADAS-2), stratified by classification system, pathologist expertise, study design, and case mix. Pool weighted kappa estimates with heterogeneity assessment."},{"gap":"No prospective study has performed biopsy on all patients independent of serology status to validate serology without verification bias","importance":"high","proposed_study_design":"Population-based study: all patients with GI symptoms receive multiple oriented duodenal biopsies regardless of serology results; quantitative morphometry as reference standard; multiple blinded pathologists grade; follow-up to assess GFD response"},{"gap":"Unknown actual false negative rate at Marsh 3a boundary in real-world community practice","importance":"high","proposed_study_design":"Prospective multi-center study: all community-diagnosed 'normal' biopsies from patients with GI symptoms undergo blinded expert re-review with CD3 IHC and morphometry; follow patients for subsequent CD diagnosis"},{"gap":"Impact of AI/quantitative digital pathology on seronegative case detection is unknown","importance":"medium","proposed_study_design":"Apply validated ML models (96–97% accuracy) to historical biopsies from patients later diagnosed with seronegative CD to identify cases where AI detects features missed by pathologists; compare AI grading to expert consensus for borderline cases"},{"gap":"No study has assessed long-term patient outcomes stratified by pathologist agreement level","importance":"medium","proposed_study_design":"Retrospective cohort: identify cases with discordant pathologist reads, determine which reading predicted clinical course (GFD response, mucosal healing, symptoms); assess whether disagreement cases have worse outcomes due to diagnostic delay"}],"differential_diagnoses_relevant":[{"condition":"Non-celiac villous atrophy (NCVA)","overlap_with_cd":"All NCVA causes produce villous atrophy indistinguishable from CD on routine H&E staining. Aziz et al. found 21/30 NCVA patients were initially misdiagnosed with CD.","distinguishing_features":"Drug history (olmesartan, mycophenolate), infections (giardia, tropical sprue), autoimmune enteropathy (anti-enterocyte antibodies), CVID (absent plasma cells), T-cell lymphoma, collagenous sprue. Serology, HLA typing, and response to GFD are key differentiators."},{"condition":"Artifacts mimicking or masking CD histology","overlap_with_cd":"Tangential sectioning creates false-normal or false-atrophic appearances; Brunner's glands at bulb biopsies can obscure assessment; crush artifact distorts architecture","distinguishing_features":"Proper orientation is the only remedy; pathologists should flag technical adequacy; recut and CD3 IHC can resolve some borderline cases"}],"recommendations":[{"recommendation":"Abandon Marsh 3a/3b/3c subdivisions and adopt the Corazza-Villanacci simplified classification (Grade A non-atrophic / Grade B1 partial atrophy / Grade B2 flat mucosa) as standard","target":"guidelines","evidence_basis":"Corazza-Villanacci achieves 0.08–0.21 kappa improvement; Marsh (original author) rejected subdivisions based on >3,000 biopsies; sub-grades don't change treatment; 2025 ESsCD guidelines already recommend simplified classification"},{"recommendation":"Mandate CD3 immunohistochemistry for all borderline cases (non-atrophic lesions with suspected increased IEL) and for all seronegative patients with any histological abnormality","target":"clinicians","evidence_basis":"CD3 IHC detects ~10% additional cases (Mubarak 2015); may be the difference between diagnosis and dismissal for seronegative patients with borderline IEL counts; H&E vs CD3 concordance only 66.8%"},{"recommendation":"Require expert GI pathology review for all seronegative patients with any degree of villous atrophy or borderline histological abnormality","target":"guidelines","evidence_basis":"Seronegative patients lack the diagnostic anchor that improves agreement by 10% (Denholm 2024); expert re-review changes 22–78% of borderline diagnoses; university pathologists achieve κ=0.888 vs commercial labs κ=0.419"},{"recommendation":"Enforce ≥4 oriented biopsies from distal duodenum plus ≥1 from bulb, mounted on acetate cellulose filter paper, as minimum standard with quality metrics reported","target":"clinicians","evidence_basis":"Only 35% compliance; guideline compliance doubles diagnostic yield (2.6×); 14–19% patchy VA; 9–14% bulb-only atrophy; tangential sectioning converts true VA to apparent normal"},{"recommendation":"Report biopsy orientation quality, specimen adequacy, and IEL counts (with method specified) in all duodenal pathology reports","target":"clinicians","evidence_basis":"86% of community reports lack IEL count data; tangential sectioning can completely invert diagnosis; quality reporting enables clinicians to assess reliability of the interpretation"},{"recommendation":"Implement the 2025 ESsCD structured SNVA diagnostic algorithm for all patients with seronegative villous atrophy, including HLA-DQ2/DQ8 typing and consideration of gamma-delta IEL assessment","target":"guidelines","evidence_basis":"First structured approach to seronegative villous atrophy workup; provides systematic framework for a population previously lacking diagnostic guidance"},{"recommendation":"Prioritize development and validation of quantitative morphometry and AI-based histological assessment as objective alternatives to subjective grading","target":"researchers","evidence_basis":"Quantitative morphometry ICC >0.97 vs subjective κ=0.31–0.49; AI models achieve 96–97% accuracy; these approaches could eliminate the subjectivity that is the root cause of inter-observer variability"},{"recommendation":"Design a definitive study that biopsies all patients independent of serology status, uses morphometry as reference standard, includes seronegative patients, and breaks the circular validation chain","target":"researchers","evidence_basis":"No existing study validates serology against a biopsy-independent standard; the current evidence base is built on circular validation that cannot determine the true sensitivity of either test"}],"meta_analysis_summary":{"studies_reviewed":22,"total_patients":null,"pooled_estimates":{"marsh_oberhuber_kappa":{"range":"0.31–0.49","interpretation":"fair","consensus":"Three independent analyses converge on this range"},"corazza_villanacci_kappa":{"range":"0.39–0.55 (rigorous multi-center); up to 0.70 in some designs; outlier 0.98 in Ghanghoria (likely spectrum bias)","interpretation":"fair to moderate (benchmark); improvement of 0.08–0.21 over Marsh-Oberhuber"},"binary_cd_diagnosis_kappa":{"range":"0.59–0.85","interpretation":"moderate to very good depending on pathologist expertise and serology context"},"binary_va_presence_kappa":{"range":"0.70–0.84","interpretation":"substantial in expert centers"},"marsh_3a_specific_kappa":{"range":"<0.50","interpretation":"poor to fair; worst of any diagnostic category"},"quantitative_morphometry_icc":{"range":"0.961–0.983","interpretation":"near-perfect; order of magnitude better than subjective grading"},"ai_ml_accuracy":{"range":"96–97%","interpretation":"matches or exceeds expert pathologist performance"},"expert_rereview_diagnosis_change":{"range":"22–78%","interpretation":"substantial discordance between community and expert pathology"},"cd3_additional_detection":{"estimate":"~10% (6.3% actual diagnosis change per Mubarak 2015)","interpretation":"clinically significant for borderline cases"},"biopsy_guideline_compliance":{"estimate":"35% in US","interpretation":"poor; majority of patients receive substandard protocols"},"diagnosis_improvement_with_compliance":{"estimate":"2.6× (1.8% vs 0.7%)","interpretation":"highly significant; low-hanging fruit for improvement"},"serology_dependency_of_histology":{"estimate":"10% agreement improvement when tTG2 results provided","interpretation":"proves histology is not independent of serology"}},"heterogeneity_notes":"High heterogeneity across studies due to: pathologist expertise (community κ=0.42 vs university κ=0.89), study format (glass slides vs digital WSI), clinical context (serology provided vs blinded), case mix (enriched for CD vs population-based), and classification system used. The Arguelles-Grande 41% misclassification rate is an upper bound from a referral population; true population rate estimated at 20–30%. Ghanghoria κ=0.98 for Corazza-Villanacci is an outlier likely reflecting spectrum bias (only known CD cases, two pathologists). Denholm 2024 (13 pathologists, 100 digital cases, stratified by clinical context) provides the most realistic estimate of routine UK practice."}}
