{"research_topic_id":"2.3","research_topic_title":"Is Duodenal Biopsy a Valid Gold Standard for Celiac Disease?","date_completed":"2026-02-07","executive_summary":"Duodenal biopsy carries an estimated 12-20% cumulative false-negative rate in typical clinical practice (5-10% under optimal conditions) due to three partially correlated error sources: sampling error from patchy villous atrophy, orientation artifact, and inter-pathologist disagreement (κ=0.35 for Marsh-Oberhuber). When serology is validated against this imperfect reference standard, verification bias inflates IgA-tTG2 sensitivity from the commonly cited ~93% to an adjusted 57.1% (95% CI: 35.4-76.4%; Hujoel et al. 2021). Bayesian latent class analysis — the appropriate statistical method for imperfect gold standard scenarios — has never been applied to CD diagnostic accuracy, representing the most critical methodological gap in the field. The 2025 ESsCD guidelines now conditionally permit no-biopsy diagnosis in adults <45 years with IgA-tTG2 ≥10×ULN, implicitly acknowledging biopsy limitations, though this pathway applies to only ~30-50% of adult CD patients.","key_findings":[{"finding_id":"2.3.1","finding":"Cumulative biopsy false-negative rate estimated at 12-20% in typical clinical practice, 5-10% under optimal conditions. Estimate is synthesized from component errors (not directly measured in biopsy-independent cohorts) and assumes partial correlation between error sources — patients with mild patchy disease are also hardest to interpret histologically, reducing pure multiplicative compounding.","evidence_strength":"moderate","quantitative_estimate":"12-20% typical practice; 5-10% optimal (academic center, ≥4+bulb biopsies, expert pathologist, orientation protocol)","confidence_interval":"Wide uncertainty; no direct measurement exists. Component estimates well-supported individually.","key_citations":["PMID:18308317","PMID:21601201","PMID:18058655","PMID:21668407","PMID:17499606","DOI:10.1371/journal.pone.0076163"],"contradicts_guidelines":false,"affected_patient_population":"All patients undergoing CD diagnostic biopsy; disproportionately affects Marsh 3a patients where inter-observer κ=0.19"},{"finding_id":"2.3.2","finding":"Patchy villous atrophy affects 10-15% of celiac patients; Hopper et al. found 18.9% of seropositive adults had variable Marsh grades across biopsy sites. Pais et al. demonstrated 10% miss rate with only 2 biopsies vs 100% detection with 4 specimens. Evans et al. found 8.7% of newly diagnosed CD had atrophy confined to the duodenal bulb.","evidence_strength":"strong","quantitative_estimate":"10-15% patchy distribution; 2.4-8.7% bulb-only lesions depending on study","confidence_interval":null,"key_citations":["PMID:18058655","PMID:18308317","PMID:19664631","DOI:10.1007/s00428-020-02832-6"],"contradicts_guidelines":false,"affected_patient_population":"CD patients with milder or early-stage disease; Marsh 3a most susceptible"},{"finding_id":"2.3.3","finding":"Only 35% of US biopsies have ≥4 specimens submitted. Lebwohl et al. (2011) analyzed 132,352 patients across a national pathology laboratory and found CD diagnostic yield doubled from 0.7% to 1.8% when ≥4 biopsies were taken — powerful indirect evidence that typical practice misses substantial CD.","evidence_strength":"strong","quantitative_estimate":"35% compliance with ≥4 specimen guideline; diagnostic yield doubles with compliance","confidence_interval":null,"key_citations":["PMID:21601201"],"contradicts_guidelines":true,"affected_patient_population":"All patients biopsied in US healthcare settings"},{"finding_id":"2.3.4","finding":"Inter-pathologist agreement for Marsh-Oberhuber classification is only fair (κ=0.35 overall, κ=0.19 for Marsh 3a specifically). The simplified Corazza-Villanacci classification improved this only to κ=0.55. Arguelles-Grande et al. found expert re-review of 102 community/commercial lab biopsies changed the diagnosis in 25% of cases, with IEL counts missing in 86% of community reports and villous atrophy grading missing in 26%.","evidence_strength":"strong","quantitative_estimate":"κ=0.35 overall; κ=0.19 Marsh 3a; κ=0.465 community vs κ=0.888 academic hospitals; 25% diagnosis change on expert re-review","confidence_interval":null,"key_citations":["PMID:17499606","PMID:21668407","PMID:29372596"],"contradicts_guidelines":false,"affected_patient_population":"Patients with borderline histology (Marsh 2-3a); those diagnosed at community hospitals or commercial laboratories"},{"finding_id":"2.3.5","finding":"Biopsy orientation artifact can make true Marsh 3b/3c lesions appear as Marsh 0-1 on tangential cutting. Only 30-66% of biopsies are well-oriented depending on technique and setting. Taavela et al. (2013) demonstrated five independent pathologists all graded tangentially cut sections as normal while properly oriented sections from the same block showed total villous atrophy.","evidence_strength":"moderate","quantitative_estimate":"30-66% well-oriented depending on technique; tangential cutting can cause 3+ grade downshift","confidence_interval":null,"key_citations":["DOI:10.1371/journal.pone.0076163","PMID:25638509","PMC10404828"],"contradicts_guidelines":false,"affected_patient_population":"All biopsied patients; particularly those without dedicated GI pathology review or orientation protocols"},{"finding_id":"2.3.6","finding":"Villous atrophy is not pathognomonic for CD: 55-72% of seronegative villous atrophy (SNVA) cases have non-celiac diagnoses. DeGaetani (2013): 28% SNCD, 26% drug-induced (mostly olmesartan), 16% CVID among 72 SNVA patients. Aziz (2017): 31% SNCD among 200 prospective SNVA. Ching (2023): only 31% of 162 unselected VA patients (no prior serology) had positive tTG2-IgA, meaning ~2/3 of biopsy-proven VA was non-CD.","evidence_strength":"strong","quantitative_estimate":"28-31% of SNVA confirmed as seronegative CD; 69-72% alternative diagnoses","confidence_interval":null,"key_citations":["PMID:23562821","PMID:27605538","DOI:10.1007/s10620-023-08217-4"],"contradicts_guidelines":false,"affected_patient_population":"All patients with villous atrophy on biopsy, particularly those with negative or absent serology"},{"finding_id":"2.3.7","finding":"Verification bias correction dramatically reduces apparent IgA-tTG2 sensitivity. Hujoel et al. (2021) found only 3.6% of tTG2-negative patients underwent biopsy vs 79.2% of tTG2-positive patients. After Begg-Greenes correction, sensitivity dropped from 92.6% to 57.1%. The point estimate suggests IgA-tTG2 sensitivity is substantially overestimated in published literature, though it still provides meaningful diagnostic value given high specificity.","evidence_strength":"strong","quantitative_estimate":"57.1% adjusted sensitivity (point estimate); uncorrected 92.6%","confidence_interval":"95% CI: 35.4-76.4% — wide interval reflects genuine uncertainty, not uselessness","key_citations":["PMID:32433257","PMC7674196"],"contradicts_guidelines":true,"affected_patient_population":"All patients screened with IgA-tTG2; implications for population screening strategies"},{"finding_id":"2.3.8","finding":"ESPGHAN 2020 pediatric no-biopsy pathway (IgA-tTG2 ≥10×ULN + EMA on second sample) achieves PPV >99%. ProCeDE study (n=707, 33 centers, 21 countries) found PPV 99.75% and explicitly noted discordance between local and central pathologists 'questions histopathology as a reference standard.' ESsCD 2025 now conditionally permits no-biopsy in adults <45 years. Shiha et al. (2024) meta-analysis (18 studies, 12,103 adults): specificity 100% (95% CI 98-100%), PPV 95-99% at ≥10×ULN.","evidence_strength":"strong","quantitative_estimate":"Pediatric PPV 99.75% (CI 98.61-99.99%); Adult specificity 100% (CI 98-100%), PPV 95-99%","confidence_interval":"Pediatric: 98.61-99.99%; Adult specificity: 98-100%","key_citations":["PMID:28245107","PMID:38176661","DOI:10.1002/ueg2.70119","PMID:28624578"],"contradicts_guidelines":false,"affected_patient_population":"~50-56% of pediatric CD qualifies; only ~30-50% of adult CD qualifies (sensitivity ~51%)"},{"finding_id":"2.3.9","finding":"Flow cytometry IEL phenotyping (celiac lymphogram: increased TCRγδ+ IELs plus decreased surface CD3-negative IELs) achieves pooled sensitivity 93% and specificity 98% per Fernández-Bañares et al. (2019) meta-analysis. TCRγδ+ elevation persists on GFD, uniquely valuable for patients already gluten-free. Can distinguish CD from other villous atrophy causes in seronegative cases.","evidence_strength":"moderate","quantitative_estimate":"93% sensitivity, 98% specificity, AUROC 0.98","confidence_interval":null,"key_citations":["PMID:31461778","PMID:27184127","PMID:20833175"],"contradicts_guidelines":false,"affected_patient_population":"Seronegative VA patients; patients already on GFD; discordant serology/histology cases"},{"finding_id":"2.3.10","finding":"Intestinal tTG2-IgA deposits detected by immunofluorescence on frozen sections are present in ~100% of untreated adult CD and 65-100% of seronegative CD cases. Gatti et al. (2014) systematic review of 23 studies: mean specificity 94.15%. Salmi et al. (2006) showed deposits predict forthcoming CD with 93% sensitivity/specificity even when serum antibodies are negative. However, technique requires fresh frozen tissue and specialized equipment — unavailable outside research centers.","evidence_strength":"moderate","quantitative_estimate":"~100% sensitivity in untreated CD; 94% specificity; 65-100% in seronegative CD","confidence_interval":null,"key_citations":["DOI:10.3389/fmed.2014.00009","PMID:16886921","PMID:16782829"],"contradicts_guidelines":false,"affected_patient_population":"Seronegative CD; potential/early CD; research settings only currently"},{"finding_id":"2.3.11","finding":"Bayesian latent class analysis (LCA) — the statistical method designed to estimate diagnostic accuracy without assuming any single gold standard — has never been applied to CD diagnostic accuracy. This is the most critical methodological gap in the field. Existing multi-test datasets (ProCeDE, Bi.A.CeD) contain tTG2-IgA, EMA, biopsy, and HLA data across multiple populations and are ready for LCA re-analysis.","evidence_strength":"emerging","quantitative_estimate":null,"confidence_interval":null,"key_citations":["PMID:17085745"],"contradicts_guidelines":false,"affected_patient_population":"All CD patients — LCA would provide first unbiased sensitivity/specificity estimates for all tests"},{"finding_id":"2.3.12","finding":"Seronegative CD represents an estimated 2-10% of diagnosed CD in clinical series. Higher figures (12-38%) reported in some literature reflect proportion of seronegative cases among villous atrophy referrals, not among all CD. True population prevalence remains unknown due to verification bias — seronegative patients are rarely biopsied, so cases are undercounted by definition.","evidence_strength":"moderate","quantitative_estimate":"2-10% of diagnosed CD; true prevalence unknown and likely higher","confidence_interval":"Wide uncertainty; verification bias makes estimation inherently difficult","key_citations":["PMID:32433257","PMID:27605538","PMID:23562821"],"contradicts_guidelines":false,"affected_patient_population":"Seronegative HLA-DQ2/DQ8+ individuals with gluten-responsive symptoms"}],"biases_documented":[{"bias_type":"Verification bias (partial verification)","description":"79.2% of serology-positive patients receive biopsy vs only 3.6% of serology-negative patients (Hujoel 2021). Seronegative CD cases rarely enter the denominator for sensitivity calculation, inflating apparent serology sensitivity.","magnitude_estimate":"Reduces apparent IgA-tTG2 sensitivity from 92.6% to 57.1% (95% CI 35.4-76.4%) when corrected via Begg-Greenes method","evidence_sources":["PMID:32433257","PMC7674196"]},{"bias_type":"Imperfect gold standard bias","description":"Using biopsy (12-20% FN rate) to validate serology creates positive dependence: patients with mild disease missed by biopsy are also more likely to have lower antibody titers, making both tests appear more accurate than they are. This circular validation makes independent assessment impossible.","magnitude_estimate":"Unknown but potentially substantial; no correction method applied to CD literature to date","evidence_sources":["DOI:10.1111/acem.12255","PMID:17085745"]},{"bias_type":"Spectrum bias","description":"Diagnostic accuracy studies are conducted in symptomatic, high-prevalence populations (median prevalence 62% in Shiha 2024 meta-analysis vs ~1% general population). Additionally, Marsh 3a patients — most susceptible to all three biopsy error sources — are systematically underrepresented in validation cohorts.","magnitude_estimate":"Marsh 3a inter-observer κ=0.19 vs overall κ=0.35; prevalence inflation inflates PPV/NPV estimates","evidence_sources":["PMID:17499606","PMID:38176661"]},{"bias_type":"Sampling bias from inadequate biopsy number","description":"Only 35% of US biopsies meet ≥4 specimen guideline. Diagnostic yield doubles with compliance. This means real-world biopsy sensitivity is substantially lower than research-setting sensitivity.","magnitude_estimate":"Diagnostic yield 0.7% with <4 biopsies vs 1.8% with ≥4 (Lebwohl 2011, n=132,352)","evidence_sources":["PMID:21601201","PMID:18308317"]},{"bias_type":"Practice-setting bias in pathology interpretation","description":"Expert re-review of community hospital/commercial lab biopsies changed diagnosis in 25% of cases (Arguelles-Grande). Agreement with university hospitals κ=0.888 vs community κ=0.465 vs commercial κ=0.419. IEL counts missing in 86% of community reports.","magnitude_estimate":"20% net increase in CD diagnoses on expert re-review; 25% overall diagnostic reclassification","evidence_sources":["PMID:21668407"]}],"unproven_assumptions_identified":[{"assumption":"Biopsy is a reliable gold standard for validating serological tests","evidence_against":"Biopsy has 12-20% FN rate in typical practice; 55-72% of seronegative VA is non-celiac; inter-observer κ=0.35; ProCeDE authors explicitly questioned 'histopathology as a reference standard'","evidence_for":"Biopsy remains most direct assessment of mucosal pathology; under optimal conditions (expert center, ≥6 specimens, orientation protocol) FN rate drops to 5-10%; no single alternative has better overall accuracy across all disease severities","clinical_impact":"All prior diagnostic accuracy studies that used biopsy as sole reference standard have produced estimates of uncertain validity. Serology sensitivity likely overestimated; true burden of missed CD substantially underappreciated."},{"assumption":"Villous atrophy is pathognomonic for celiac disease","evidence_against":"At least 16 conditions produce histologically similar VA. Ching 2023: only 31% of unselected VA had positive tTG2-IgA. DeGaetani 2013: 26% of SNVA was drug-induced. Olmesartan enteropathy is 'undistinguishable from CD' histologically and 61-81% of affected patients carry HLA-DQ2/DQ8.","evidence_for":"With positive high-titer serology + HLA + VA, specificity for CD approaches 100%. VA combined with celiac-specific IEL phenotype (TCRγδ+ ↑) is highly specific.","clinical_impact":"VA alone cannot establish CD diagnosis without confirmatory serology, GFD response, or IEL phenotyping — particularly in seronegative cases"},{"assumption":"High-titer IgA-tTG2 (≥10×ULN) reliably identifies all CD patients eligible for no-biopsy diagnosis","evidence_against":"Only ~30-50% of adult CD patients have titers ≥10×ULN; no-biopsy pathway sensitivity is only ~51%. Excludes seronegative CD by definition. Seronegative patients with IgG subclass deficiencies or low secretory IgA may never produce detectable tTG2 antibodies.","evidence_for":"Specificity approaches 100%; PPV 95-99.75% in validation studies; ESsCD 2025 and ESPGHAN 2020 endorse for eligible subsets","clinical_impact":"No-biopsy pathway is a rule-in strategy for a minority of CD; the majority still requires histological confirmation, making biopsy improvement essential"},{"assumption":"Seronegative CD is rare enough (<5%) to be clinically negligible","evidence_against":"Verification bias means seronegative patients are rarely biopsied, so prevalence is inherently undercounted. Hujoel correction implies substantial seronegative population. Among VA patients specifically, 28-31% have seronegative CD.","evidence_for":"In clinical series, seronegative CD typically represents 2-10% of diagnosed cases. Optimized serology + biopsy achieves near-perfect accuracy for overt seropositive CD (no-biopsy PPV >99%).","clinical_impact":"Even if seronegative CD is 5-10% of total CD, this represents a significant overlooked population given CD prevalence of ~1%. True prevalence requires biopsy-independent ascertainment."},{"assumption":"Current diagnostics are approximately correct for all CD","evidence_for":"For high-titer seropositive CD (the ~30-50% qualifying for no-biopsy), diagnostics work extremely well. Optimized biopsy at expert centers achieves low FN rates. The system is well-validated for overt, severe disease.","evidence_against":"The system is optimized for and validated within a subset of CD patients. Low-titer seropositive, seronegative, atypical presentation, and Marsh 3a cases are where diagnostic failures concentrate. The verification bias correction suggests these failures may be more common than assumed.","clinical_impact":"A two-tier diagnostic reality: excellent for classic seropositive CD, potentially poor for the diagnostic periphery where missed patients accumulate"}],"overlooked_populations":[{"population":"Seronegative Marsh 3a patients with patchy villous atrophy","estimated_size":"Unknown; potentially 5-10% of total undiagnosed CD based on seronegative prevalence estimates and Marsh 3a error rates","why_missed":"Triple vulnerability: (1) negative serology → 3.6% biopsy referral rate, (2) Marsh 3a has poorest inter-observer agreement (κ=0.19), (3) patchy distribution requires multiple biopsies often not obtained. The seronegative patient context profile (negative IgA-tTG2 <1, negative DGP IgG <1, low IgG1 subclass, low secretory IgA, DQ8, Marsh 3A) represents the maximally invisible patient.","proposed_solution":"Lower threshold for biopsy in symptomatic HLA-DQ2/8+ patients regardless of serology; mandatory ≥4 distal + ≥2 bulb biopsies; expert pathology review for all borderline cases; consider flow cytometry IEL phenotyping for discordant/seronegative results"},{"population":"Patients with bulb-only villous atrophy","estimated_size":"2.4-8.7% of CD patients (Evans et al.: 8.7%; meta-analysis: 5-8% added yield)","why_missed":"Many centers do not routinely biopsy duodenal bulb; D2-only sampling misses these entirely","proposed_solution":"Mandatory bulb biopsies per ESsCD 2025 recommendations; education on bulb-only CD phenotype"},{"population":"Adults ≥45 years with high-titer serology ineligible for ESsCD 2025 no-biopsy pathway","estimated_size":"~30-40% of adult CD patients based on age distribution","why_missed":"ESsCD 2025 no-biopsy restricted to <45 years due to lymphoma/malignancy risk concerns requiring endoscopic visualization; ACG 2023 remains conservative for all adults","proposed_solution":"Risk-stratified approach based on alarm symptoms rather than arbitrary age cutoff; consider no-biopsy for low-risk older adults with very high titers and no alarm features"},{"population":"Patients with immunoglobulin abnormalities (selective IgA deficiency, IgG subclass deficiencies, low secretory IgA)","estimated_size":"Selective IgA deficiency: 2-3% of CD; IgG subclass deficiencies: poorly characterized in CD","why_missed":"Standard IgA-tTG2 testing is uninformative in IgA deficiency; IgG-based tests (DGP-IgG, tTG2-IgG) have lower sensitivity; IgG subclass deficiency may impair even IgG-based antibody production; low secretory IgA may affect mucosal immune detection","proposed_solution":"Universal total IgA measurement with serology; consider IgG-DGP or IgG-tTG2 if IgA deficient; low threshold for biopsy with IEL phenotyping in symptomatic immunodeficient patients; research needed on IgG subclass deficiency impact on CD serology"},{"population":"Patients diagnosed at community hospitals/commercial laboratories without expert GI pathology","estimated_size":"Majority of CD diagnostic biopsies in US healthcare system","why_missed":"Expert re-review changes diagnosis in 25% of cases; IEL counts missing in 86% of community reports; community κ=0.465 vs academic κ=0.888","proposed_solution":"Centralized expert pathology review for borderline/discordant cases; standardized reporting templates requiring IEL counts and orientation quality assessment; AI-assisted morphometric analysis for quality assurance"}],"diagnostic_step_sensitivity":{"step_name":"Duodenal biopsy (overall diagnostic pathway)","reported_sensitivity":"~100% (assumed as gold standard — not independently measured)","adjusted_sensitivity":"80-88% typical practice; 90-95% optimal conditions (synthesized estimate, not directly measured)","false_negative_rate":"12-20% typical practice; 5-10% optimal. Component sources: sampling 5-15%, orientation 5-10%, interpretation 5-15% — partially correlated (patients with mild patchy disease also have lowest inter-observer agreement, reducing pure multiplicative compounding).","key_limitations":["Patchy VA in 10-15% of patients; bulb-only in 2.4-8.7%","Only 35% of US biopsies meet ≥4 specimen guideline","30-66% of specimens well-oriented depending on technique","Inter-observer κ=0.35 overall; κ=0.19 for critical Marsh 3a category","Expert re-review changes diagnosis in 25% of community/commercial lab cases","IEL counts absent in 86% of community reports","Cannot distinguish CD from 16+ other causes of VA without confirmatory evidence","No direct measurement of cumulative FN rate exists — estimate is model-based"]},"contradictory_studies":[{"citation":"Hujoel IA et al. (2021) - Estimating the Impact of Verification Bias on Celiac Disease Testing","pmid":"32433257","finding":"After Begg-Greenes verification bias correction, IgA-tTG2 sensitivity drops from 92.6% to 57.1% (95% CI: 35.4-76.4%). Only 3.6% of seronegative patients received biopsy verification vs 79.2% of seropositive.","contradicts":"Widely cited >90% IgA-tTG2 sensitivity from meta-analyses that did not correct for verification bias; guideline statements that tTG2 is 'highly sensitive'"},{"citation":"Aziz I et al. (2017) - Seronegative villous atrophy in adults","pmid":"27605538","finding":"Only 31% of 200 prospective seronegative VA patients had confirmed seronegative CD; 69% had alternative diagnoses","contradicts":"Implicit assumption that villous atrophy in symptomatic patients is highly specific for CD"},{"citation":"Ching HA et al. (2023) - Predictors of subsequent CD seropositivity in VA patients","pmid":null,"finding":"Among 162 patients with biopsy-proven VA and no prior serology, only 31% subsequently had positive tTG2-IgA — ~2/3 of biopsy-proven VA was not CD","contradicts":"Assumption that VA on duodenal biopsy is predominantly caused by CD"},{"citation":"Corazza GR et al. (2007) - Interobserver reproducibility of celiac disease histologic criteria","pmid":"17499606","finding":"Mean κ=0.35 for Marsh-Oberhuber classification across 6 pathologists; 7.4% received different normal/abnormal diagnoses between observers; Marsh 3a κ=0.19","contradicts":"Assumption that histological diagnosis provides objective, reproducible classification"},{"citation":"Lebwohl B et al. (2011) - Adherence to biopsy guidelines increases CD diagnosis","pmid":"21601201","finding":"Only 35% of 132,352 US biopsies had ≥4 specimens; CD diagnostic yield doubled from 0.7% to 1.8% with compliance","contradicts":"Assumption that guideline-recommended biopsy protocols are routinely followed; implies real-world biopsy sensitivity far below research-setting estimates"},{"citation":"Arguelles-Grande C et al. (2012) - Variability in small bowel histopathology reporting","pmid":"21668407","finding":"Expert re-review changed diagnosis in 25% of community/commercial lab cases; IEL counts missing in 86%; community hospital κ=0.465 vs academic κ=0.888","contradicts":"Assumption that pathological diagnosis quality is uniform across practice settings"},{"citation":"Werkstetter KJ et al. (2017) - ProCeDE study","pmid":"28245107","finding":"PPV 99.75% for no-biopsy pathway; authors noted discordance between local and central pathologists 'questions histopathology as a reference standard in validation studies'","contradicts":"Historical assumption that biopsy is the unquestionable gold standard against which all other tests must be validated"},{"citation":"Pallav K et al. (2012) - Non-celiac enteropathy misdiagnosis","pmid":null,"finding":"70% (21/30) of patients with non-celiac enteropathy were initially misdiagnosed with CD and placed on GFD; none showed histological improvement","contradicts":"Assumption that VA-based CD diagnosis is sufficiently specific without confirmatory GFD response"}],"research_gaps":[{"gap":"Bayesian latent class analysis has never been applied to CD diagnostic accuracy despite being the appropriate method for imperfect gold standard scenarios. Existing datasets (ProCeDE n=707, Bi.A.CeD, Shiha meta-analysis n=12,103) contain multi-test data ready for re-analysis.","importance":"high","proposed_study_design":"Apply Bayesian LCA to existing multi-test datasets (≥3 tests: tTG2-IgA, EMA, biopsy, HLA across ≥2 populations with different prevalence). This would yield the first unbiased sensitivity/specificity estimates for each CD diagnostic test."},{"gap":"No prospective study has performed universal biopsy regardless of serology status to calculate true serology sensitivity without verification bias","importance":"high","proposed_study_design":"Prospective cohort: biopsy all symptomatic HLA-DQ2/8+ patients regardless of serology result; calculate sensitivity/specificity without differential verification. Add flow cytometry IEL phenotyping and intestinal tTG2-IgA deposits to all specimens."},{"gap":"True population prevalence of seronegative CD is unknown due to verification bias in ascertainment","importance":"high","proposed_study_design":"Population screening study with biopsy of all HLA-DQ2/DQ8+ individuals regardless of serology, combined with LCA for prevalence estimation"},{"gap":"Flow cytometry IEL phenotyping lacks standardized reference ranges, large non-European validation studies, and performance data in immunodeficient patients","importance":"medium","proposed_study_design":"Prospective multicenter study (including non-European sites) establishing standardized reference ranges and validating against clinical outcomes; specifically include patients with IgA deficiency and IgG subclass deficiencies"},{"gap":"No direct measurement of cumulative biopsy false-negative rate exists — all estimates are model-based syntheses of component errors","importance":"medium","proposed_study_design":"Systematic mapping study: repeat comprehensive biopsy (≥8 specimens including bulb, all expertly oriented and interpreted) in patients with initially negative biopsies but high clinical suspicion; compare with clinical outcomes at 2 years"},{"gap":"Long-term outcomes of no-biopsy diagnosed adults vs biopsy-confirmed adults are unknown","importance":"medium","proposed_study_design":"Registry-based cohort comparing complications, lymphoma rates, mucosal healing, and quality of life between no-biopsy and biopsy-diagnosed adults over ≥5 years"},{"gap":"Impact of IgG subclass deficiency on CD serological test performance is virtually unstudied","importance":"medium","proposed_study_design":"Prospective study measuring IgG subclasses in all patients undergoing CD evaluation; correlate with serological test results and biopsy findings"},{"gap":"ESsCD 2025 includes a seronegative VA algorithm but validation data for this pathway are limited","importance":"medium","proposed_study_design":"Prospective multicenter validation of the ESsCD 2025 SNVA diagnostic algorithm against composite reference standard including GFD response at 12 months"}],"differential_diagnoses_relevant":[{"condition":"Olmesartan-induced enteropathy","overlap_with_cd":"Villous atrophy with IEL increase; 61-81% HLA-DQ2/DQ8+; similar symptoms (diarrhea, weight loss, malabsorption). Described as 'undistinguishable from CD' histologically.","distinguishing_features":"Negative celiac serology; history of olmesartan use (average 3.1 years before onset); resolves within weeks-months of drug withdrawal; estimated prevalence 1:4,000-5,000 olmesartan users"},{"condition":"Common variable immunodeficiency (CVID)","overlap_with_cd":"Villous atrophy, diarrhea, malabsorption; 77% carry HLA-DQ2/DQ8","distinguishing_features":"Paucity or absence of plasma cells on biopsy (though 30% have normal numbers); low serum immunoglobulins; may have nodular lymphoid hyperplasia; increased infections; does not respond to GFD"},{"condition":"Autoimmune enteropathy","overlap_with_cd":"Severe villous atrophy; refractory diarrhea","distinguishing_features":"Minimal IEL increase; absent goblet and/or Paneth cells; anti-enterocyte or anti-goblet cell antibodies; typically poor GFD response; may require immunosuppressive therapy"},{"condition":"Giardiasis","overlap_with_cd":"Partial villous atrophy, IEL increase, malabsorption","distinguishing_features":"Stool antigen or biopsy identification of Giardia trophozoites; responds to metronidazole; can coexist with CD"},{"condition":"Tropical sprue","overlap_with_cd":"Villous atrophy, malabsorption, weight loss","distinguishing_features":"Endemic area exposure history; ileal involvement (CD typically spares ileum); decrescendo IEL pattern; prominent eosinophilia; responds to antibiotics + folate; affects jejunum and ileum more than duodenum"},{"condition":"Crohn's disease with upper GI involvement","overlap_with_cd":"Villous atrophy, inflammation, duodenal involvement","distinguishing_features":"Granulomas; transmural inflammation; skip lesions; other GI tract involvement; negative celiac serology; may have fistulae/strictures"},{"condition":"Collagenous sprue","overlap_with_cd":"Severe villous atrophy; malabsorption; may overlap with refractory CD","distinguishing_features":"Subepithelial collagen band >10μm on trichrome stain; often refractory to GFD; may represent complication of longstanding CD or separate entity"},{"condition":"Small intestinal bacterial overgrowth (SIBO)","overlap_with_cd":"Partial villous atrophy possible; malabsorption; bloating","distinguishing_features":"Responds to antibiotics; diagnosed by breath test or jejunal aspirate culture; can coexist with CD"},{"condition":"HIV enteropathy","overlap_with_cd":"Villous atrophy; malabsorption; IEL changes","distinguishing_features":"HIV seropositivity; CD4+ T-cell depletion; other opportunistic infections common"}],"recommendations":[{"recommendation":"Apply Bayesian latent class analysis to existing multi-test CD datasets (ProCeDE, Bi.A.CeD) to generate the first unbiased diagnostic accuracy estimates for all CD tests","target":"researchers","evidence_basis":"LCA is the established statistical method for imperfect gold standard scenarios; has never been applied to CD despite necessary data existing; would resolve fundamental uncertainty about true test performance"},{"recommendation":"Acknowledge biopsy's 12-20% false-negative rate in guidelines and communicate this uncertainty to clinicians","target":"guidelines","evidence_basis":"Cumulative error from patchy VA (5-15%), orientation artifact (5-10%), and inter-observer variability (5-15%, κ=0.35); diagnostic yield doubles with ≥4 specimens (Lebwohl 2011)"},{"recommendation":"Mandate ≥4 distal duodenal biopsies + ≥2 bulb biopsies for all diagnostic endoscopies, with orientation quality assessment","target":"clinicians","evidence_basis":"ESsCD 2025; Pais et al.: 4 specimens for ~100% sensitivity; bulb-only lesions in 2.4-8.7%; only 35% current US compliance"},{"recommendation":"Lower threshold for biopsy in symptomatic HLA-DQ2/8+ patients regardless of serology result","target":"clinicians","evidence_basis":"Only 3.6% of seronegative patients currently biopsied (Hujoel 2021); verification bias leads to systematic underdiagnosis of seronegative CD"},{"recommendation":"Require GFD response as mandatory confirmatory evidence for all seronegative villous atrophy diagnoses, per Paris Consensus 2022","target":"guidelines","evidence_basis":"55-72% of SNVA is non-celiac; 70% of non-celiac enteropathy initially misdiagnosed as CD (Pallav 2012); GFD response is the only practical way to distinguish in seronegative cases"},{"recommendation":"Develop and validate a composite reference standard incorporating serology, HLA, histology (with orientation/specimen adequacy criteria), IEL flow cytometry, and clinical GFD response","target":"researchers","evidence_basis":"No single test is adequate as reference standard; multi-modal approach reduces circular validation; tiered criteria (seropositive pathway vs seronegative pathway) accommodate different clinical scenarios"},{"recommendation":"Report biopsy referral rates stratified by serology status in all future diagnostic accuracy studies to enable verification bias correction","target":"researchers","evidence_basis":"Hujoel methodology requires differential referral rates; without this data, sensitivity estimates remain uncorrectable"},{"recommendation":"Consider flow cytometry IEL phenotyping (celiac lymphogram) for discordant or seronegative cases, and invest in standardization for wider availability","target":"clinicians, researchers","evidence_basis":"93% sensitivity, 98% specificity; persists on GFD; can distinguish CD from other VA causes; currently limited to specialized (mainly Spanish) centers — needs standardization and broader validation"},{"recommendation":"Implement centralized expert pathology review or AI-assisted quality assurance for borderline CD biopsies from community/commercial laboratories","target":"clinicians, guidelines","evidence_basis":"Expert re-review changes diagnosis in 25% of community cases; community κ=0.465 vs academic κ=0.888; IEL counts missing in 86% of community reports"},{"recommendation":"Recognize that every prior diagnostic accuracy study using biopsy as sole gold standard has produced estimates of uncertain validity — interpret published sensitivity/specificity figures with this caveat","target":"guidelines, researchers, clinicians","evidence_basis":"Imperfect gold standard bias + verification bias + spectrum bias collectively corrupt the evidence base; LCA needed to generate corrected estimates"}],"meta_analysis_summary":{"studies_reviewed":50,"total_patients":null,"pooled_estimates":{"biopsy_cumulative_false_negative_rate":"12-20% typical practice; 5-10% optimal; model-based synthesis, not directly measured","verification_bias_corrected_IgA_tTG2_sensitivity":"57.1% (95% CI: 35.4-76.4%)","uncorrected_IgA_tTG2_sensitivity":"92.6% (inflated by verification bias)","seronegative_VA_proportion_that_is_CD":"28-31% (tertiary referral series)","inter_observer_kappa_marsh_oberhuber":"0.35 overall; 0.19 for Marsh 3a","inter_observer_kappa_corazza_villanacci":"0.55","expert_rereview_diagnostic_change_rate":"25% (community/commercial labs)","biopsy_compliance_geq4_specimens_US":"35%","pediatric_no_biopsy_PPV":"99.75% (95% CI: 98.61-99.99%)","adult_no_biopsy_specificity_geq10xULN":"100% (95% CI: 98-100%)","adult_no_biopsy_sensitivity":"~51% (95% CI: 42-60%)","adult_no_biopsy_PPV":"95-99.4%","flow_cytometry_IEL_sensitivity":"93%","flow_cytometry_IEL_specificity":"98%","intestinal_tTG2_deposits_sensitivity_untreated":"~100%","intestinal_tTG2_deposits_specificity":"94%","seronegative_CD_proportion_of_diagnosed":"2-10% (clinical series; likely undercount due to verification bias)"},"heterogeneity_notes":"Substantial heterogeneity across all estimates due to: (1) practice-setting differences (academic vs community; 35% vs 100% biopsy compliance), (2) population spectrum (symptomatic referral cohorts vs screening), (3) pathologist expertise (κ=0.465 community vs 0.888 academic), (4) variable biopsy protocols (2 vs ≥4 specimens; with/without bulb). The cumulative FN rate is inherently uncertain because no biopsy-independent ascertainment cohort exists. Verification bias correction has very wide CIs (35.4-76.4%) reflecting genuine uncertainty, not methodological weakness. Future LCA on multi-test datasets is needed to narrow these estimates."}}
