{"research_topic_id":"2.4A","research_topic_title":"Biomarkers for Identifying Seronegative Celiac Disease with Partial Villous Atrophy (Marsh 3a) — Merged Synthesis","date_completed":"2026-02-07","methodology_note":"Merged from independent Opus 4.6 deep research synthesis and Grok 4.1 analysis with cross-peer-review. Divergences noted and resolved based on primary source verification.","executive_summary":"The celiac lymphogram by flow cytometry (87% sensitivity, 96.7% specificity in dedicated seronegative villous atrophy cohort) is the only biomarker directly validated for seronegative CD diagnosis and the strongest candidate for detecting seronegative Marsh 3a patients missed by standard IgA-tTG2 serology. After verification bias adjustment, IgA-tTG2 sensitivity may be as low as 35–57% (modeled, not empirically measured), with the lowest performance in partial villous atrophy. No circulating biomarker has been validated specifically in seronegative Marsh 3a, though IL-2-based T-cell assays and circulating miRNA panels show promise as antibody-independent detection methods. The combination of HLA-DQ8 genotype, IgG1 subclass deficiency, and low secretory IgA represents a plausible but unvalidated mechanistic model for seronegativity with preserved mucosal damage.","key_findings":[{"finding_id":"2.4A-F1","finding":"Celiac lymphogram (simultaneous increase in TCRγδ+ IELs and decrease in sCD3- IELs) achieves 87% sensitivity and 96.7% specificity in a dedicated seronegative villous atrophy cohort of 67 patients, with post-test probability of 92% for CD given a positive result. Meta-analysis of 6 studies (n=959) shows pooled sensitivity 93% and specificity 98% (AUC 0.98). Seronegative and seropositive patients show identical flow cytometric immunophenotypes.","evidence_strength":"strong","quantitative_estimate":"87% sensitivity, 96.7% specificity in SNVA; pooled 93%/98%","confidence_interval":"73.7–95% sensitivity, 82.7–99.9% specificity (SNVA cohort)","key_citations":["PMID:32048756","PMID:31443602","PMID:31057009","PMID:38674808"],"contradicts_guidelines":true,"affected_patient_population":"Seronegative villous atrophy patients including Marsh 3a; not stratified by Marsh 3a alone"},{"finding_id":"2.4A-F2","finding":"IgA-tTG2 sensitivity drops from commonly cited 92.6% to an estimated 57.1% (95% CI: 35.4–76.4%) after adjusting for differential biopsy referral (verification bias). Only 3.6% of tTG2-negative patients receive biopsy vs 79.2% of tTG2-positive. NOTE: This is a modeled estimate from retrospective data, not a direct empirical measurement.","evidence_strength":"moderate","quantitative_estimate":"57.1% adjusted sensitivity (modeled); possible range 35.4–76.4%","confidence_interval":"95% CI: 35.4–76.4%","key_citations":["PMID:33002890"],"contradicts_guidelines":true,"affected_patient_population":"All CD patients, but disproportionately affecting Marsh 3a where seronegativity is most common"},{"finding_id":"2.4A-F3","finding":"Serology sensitivity is severity-dependent: EMA positivity ~77% with total villous atrophy but only ~33% with partial villous atrophy (P < 0.001). This places Marsh 3a at the intersection of weakest serological sensitivity and lowest biopsy referral probability.","evidence_strength":"moderate","quantitative_estimate":"33% EMA positivity in partial VA vs 77% in total VA","confidence_interval":null,"key_citations":["PMID:15185855"],"contradicts_guidelines":true,"affected_patient_population":"Marsh 3a (partial villous atrophy)"},{"finding_id":"2.4A-F4","finding":"γδ+ IEL quantification alone (without sCD3- component) achieves 91.3% sensitivity and 83.3% specificity in seronegative VA. The H-41 monoclonal antibody (2020) enables γδ-IEL detection on standard FFPE biopsies, potentially eliminating the need for fresh tissue. Thresholds of 10.5 γδ+ IELs and 14% γδ+/CD3+ ratio show high accuracy on FFPE.","evidence_strength":"strong","quantitative_estimate":"91.3% sensitivity, 83.3% specificity (SNVA); IHC on FFPE: 96% sensitivity, 95% specificity (AUC 0.997)","confidence_interval":"79.2–97.6% sensitivity (SNVA)","key_citations":["PMID:32048756","PMC8449760"],"contradicts_guidelines":true,"affected_patient_population":"Seronegative VA; potentially accessible in routine pathology"},{"finding_id":"2.4A-F5","finding":"Mucosal anti-tTG2 IgA deposits show variable sensitivity (60–100%) across studies, with later head-to-head data showing 60% sensitivity in seronegative lymphocytic enteritis vs 95% for celiac lymphogram (P=0.039). Specificity questioned with up to 24% false positives in non-CD enteropathies. Requires frozen tissue and specialized immunofluorescence. DIVERGENCE: Grok rates at ~90%; Opus at 60–100% range. Evidence favors the range given methodological variability.","evidence_strength":"moderate","quantitative_estimate":"60–100% sensitivity range; specificity questioned","confidence_interval":null,"key_citations":["PMID:16036509","doi:10.1371/journal.pone.0101249"],"contradicts_guidelines":false,"affected_patient_population":"Seronegative CD, mild/partial atrophy"},{"finding_id":"2.4A-F6","finding":"I-FABP (intestinal fatty acid binding protein) reflects enterocyte damage independent of antibody status but has poor diagnostic sensitivity (51% at specificity 88%, AUC 0.79). Correlation with Marsh grade is modest (r=0.27). No study has specifically examined I-FABP in confirmed seronegative CD with Marsh 3a. Its antibody-independence makes it theoretically suited for seronegative detection, but clinical validation is absent.","evidence_strength":"weak","quantitative_estimate":"51% sensitivity at 88% specificity; AUC 0.79","confidence_interval":null,"key_citations":["PMID:23289539","PMID:40632482"],"contradicts_guidelines":false,"affected_patient_population":"General CD; not validated in SNCD"},{"finding_id":"2.4A-F7","finding":"IL-2-based T-cell assays bypass antibody pathways entirely. Serum IL-2 detectable within 4 hours of gluten challenge in 92% of CD patients vs 0% of controls (272-fold increase). Whole-blood antigen-induced IL-2 (WBAIL-2) assay achieves 90% sensitivity and 95% specificity in HLA-DQ2.5+ patients, but only 56% sensitivity in HLA-DQ8+ patients — a critical limitation for the DQ8-predominant seronegative population. Not yet tested in seronegative cohorts.","evidence_strength":"emerging","quantitative_estimate":"90% sensitivity (DQ2.5+); 56% sensitivity (DQ8+)","confidence_interval":null,"key_citations":["PMID:31483515","PMID:40499737"],"contradicts_guidelines":false,"affected_patient_population":"Potentially all CD; DQ8+ performance gap is critical for SNCD"},{"finding_id":"2.4A-F8","finding":"Circulating miRNA panels detect CD patients with low or negative IgA-tTG2, with a 3-miRNA panel achieving 73.9% sensitivity and 96.9% specificity (AUC 0.909). Some miRNAs detectable >2 years before tTG2 seroconversion. No clinical-grade diagnostic kit exists; all studies remain research-stage.","evidence_strength":"emerging","quantitative_estimate":"73.9% sensitivity, 96.9% specificity (3-miRNA panel)","confidence_interval":null,"key_citations":["PMC8688806","PMC8842006"],"contradicts_guidelines":false,"affected_patient_population":"Low/negative tTG2 patients; not specifically SNCD cohort"},{"finding_id":"2.4A-F9","finding":"Anti-actin antibodies (AAA) perform poorly for Marsh 3a: positivity 46% in Marsh 3b–3c but only 6% in Marsh 1–3a. Explicitly concluded to be unable to identify mild and subtotal villous atrophy. Not useful for seronegative Marsh 3a detection.","evidence_strength":"moderate","quantitative_estimate":"6% positivity in Marsh 1–3a vs 46% in Marsh 3b–3c","confidence_interval":null,"key_citations":["PMID:15326587","PMC2848662"],"contradicts_guidelines":false,"affected_patient_population":"Cannot detect Marsh 3a"},{"finding_id":"2.4A-F10","finding":"HLA-DQ8 shows a trend toward enrichment in SNCD and mechanistic basis exists (narrower peptide presentation, lower T-cell breadth, less B-cell help). DQ2.5 gene dose correlates with antibody positivity (P=0.021). However, no study demonstrates statistically significant independent association between DQ8 and seronegativity after confounding adjustment. DIVERGENCE: Grok rates 'no evidence'; Opus identifies trends. Resolved as 'emerging evidence, not confirmed'.","evidence_strength":"emerging","quantitative_estimate":null,"confidence_interval":null,"key_citations":["PMID:14523237","doi:10.3390/nu12123775"],"contradicts_guidelines":false,"affected_patient_population":"DQ8+ CD patients, potentially over-represented in SNCD"},{"finding_id":"2.4A-F11","finding":"SNCD patients have significantly worse outcomes: complication hazard ratio 10.87 and mortality HR 2.18 compared to seropositive CD (Schiepatti et al. 2021, 20-year multicentre follow-up). Whether this reflects delayed diagnosis, more aggressive biology, or confounding by older age at diagnosis is unresolved.","evidence_strength":"moderate","quantitative_estimate":"HR 10.87 complications; HR 2.18 mortality","confidence_interval":null,"key_citations":["PMID:34496060"],"contradicts_guidelines":false,"affected_patient_population":"All SNCD patients"},{"finding_id":"2.4A-F12","finding":"Stool-based markers show insufficient evidence for CD diagnosis: fecal anti-tTG2 has ~10% sensitivity despite 98% specificity; fecal calprotectin is non-specific and inconsistent (0–90%); fecal GIP detects gluten exposure, not disease.","evidence_strength":"weak","quantitative_estimate":"Stool anti-tTG2: ~10% sensitivity, ~98% specificity","confidence_interval":null,"key_citations":["PMC1352053"],"contradicts_guidelines":false,"affected_patient_population":"Not useful for SNCD detection"}],"biases_documented":[{"bias_type":"verification bias (primary)","description":"Only 3.6% of IgA-tTG2-negative individuals receive biopsy vs 79.2% of positive individuals, creating circular validation of serology sensitivity. Most CD study cohorts, clinical phenotype descriptions, and biomarker validation studies inherit this bias because patients are identified through serology-first algorithms.","magnitude_estimate":"IgA-tTG2 sensitivity may be inflated from ~57% to ~93% by this bias (modeled estimate with wide CI)","evidence_sources":["Hujoel et al. 2021 (PMID:33002890)","Multiple systematic reviews"]},{"bias_type":"severity bias","description":"Serology sensitivity is severity-dependent (33% in partial VA vs 77% in total VA). Most validation studies over-represent Marsh 3b-3c, inflating apparent sensitivity. Marsh 3a patients have lowest serology sensitivity AND lowest biopsy referral probability.","magnitude_estimate":"Sensitivity difference of ~44 percentage points between partial and total VA","evidence_sources":["Abrams et al. 2004 (PMID:15185855)"]},{"bias_type":"selection bias in SNVA cohorts","description":"Even dedicated seronegative VA studies select patients who were biopsied despite negative serology — typically due to high clinical suspicion or incidental endoscopy findings. These cohorts still underestimate the true seronegative population because the most clinically silent patients never reach biopsy.","magnitude_estimate":"Unknown; likely substantial","evidence_sources":["Fernández-Bañares 2020 cohort design","Paris Consensus 2022"]},{"bias_type":"Marsh grade non-stratification","description":"SNVA cohorts rarely stratify results by Marsh 3a specifically. Biomarker performance data (including the celiac lymphogram) is reported for mixed SNVA populations including Marsh 3a, 3b, and 3c together.","magnitude_estimate":"Unknown performance difference across sub-grades","evidence_sources":["All SNVA biomarker studies reviewed"]}],"unproven_assumptions_identified":[{"assumption":"IgA-tTG2 serology has >95% sensitivity for villous atrophy (Marsh ≥3)","evidence_against":"Modeled adjustment shows 35–57% (Hujoel 2021); severity correlation shows 33% for partial VA (Abrams 2004); mucosal compartmentalization documented","evidence_for":"Unadjusted literature in serology-ascertained cohorts consistently reports >90%","clinical_impact":"Systematic missing of seronegative Marsh 3a patients who never receive biopsy referral"},{"assumption":"Seronegative CD is rare (1–4% of all CD)","evidence_against":"Strict-criteria prevalence (Paris Consensus) is ascertained from biopsied populations only; less restrictive criteria yield 12.7–37.9%; verification bias ensures true prevalence is unknowable without serology-independent ascertainment","evidence_for":"Paris Consensus strict criteria in referral centers yield 1.7–4.2%","clinical_impact":"May underestimate a large undiagnosed population"},{"assumption":"Negative serology reliably excludes CD in symptomatic patients without IgA deficiency","evidence_against":"Mucosal markers positive in seronegative patients; severity-dependent sensitivity; immunoglobulin subclass defects may cause seronegativity beyond total IgA deficiency","evidence_for":"High negative predictive value in population screening studies (but these have circular validation)","clinical_impact":"Clinicians may not pursue biopsy in symptomatic patients with negative serology and normal total IgA"},{"assumption":"Mucosal anti-tTG2 deposits are pathognomonic for CD","evidence_against":"Up to 24% false positives in non-CD enteropathies (Maglio 2017); specificity questioned by Paris Consensus","evidence_for":"Early Finnish studies showed high specificity in well-defined populations","clinical_impact":"May lead to overdiagnosis if used as sole confirmatory test"}],"overlooked_populations":[{"population":"Seronegative CD with Marsh 3a (partial villous atrophy)","estimated_size":"Unknown; potentially large given severity-dependent seronegativity. Hypothesis that it may be comparable to seropositive Marsh 3b-3c is plausible but unquantified.","why_missed":"Negative serology blocks biopsy referral (entry gate effect); even when biopsied incidentally, Marsh 3a may be interpreted as non-specific or missed due to patchy distribution","proposed_solution":"HLA-guided biopsy in symptomatic patients regardless of serology; γδ+ IEL assessment on all biopsies showing any architectural abnormality"},{"population":"HLA-DQ8+ CD patients with immunoglobulin subclass deficiencies","estimated_size":"Unknown; IgG subclass deficiency prevalence in SNCD has never been systematically measured","why_missed":"Standard workup checks total IgA only; IgG subclass deficiencies not tested; DQ8 patients may have lower antibody responses that are further blunted by subclass defects","proposed_solution":"Include IgG subclass measurement in SNCD workup protocols; study IgG1/IgG3 levels in confirmed SNCD cohorts"},{"population":"Patients with low secretory IgA and mucosal compartmentalization of immune response","estimated_size":"Unknown","why_missed":"Stool secretory IgA not part of standard workup; mucosal antibody trapping not detectable by serum tests","proposed_solution":"Research: correlate stool secretory IgA with mucosal tTG2 deposits and serum antibody status"}],"diagnostic_step_sensitivity":{"step_name":"IgA-tTG2 serology as entry gate to biopsy","reported_sensitivity":">92–95% (guideline-cited, unadjusted)","adjusted_sensitivity":"57.1% (modeled point estimate, 95% CI: 35.4–76.4%); ~33% for partial villous atrophy specifically (Abrams 2004, EMA)","false_negative_rate":"Modeled: 24–65% for all CD; likely >60% for Marsh 3a specifically","key_limitations":["Verification bias inflates apparent sensitivity (most negative patients never biopsied)","Severity-dependent: sensitivity correlates with degree of villous atrophy","Immunoglobulin defects beyond total IgA deficiency not routinely checked","Adjusted estimates are modeled, not directly empirically measured","HLA-DQ8 patients may have intrinsically lower antibody responses"]},"contradictory_studies":[{"citation":"Fernández-Bañares et al. 2020 (Aliment Pharmacol Ther)","pmid":"32048756","finding":"Celiac lymphogram diagnoses SNCD with 87% sensitivity/96.7% specificity in patients with negative serology and villous atrophy","contradicts":"Guideline reliance on positive serology as near-mandatory for CD diagnosis in adults"},{"citation":"Hujoel et al. 2021 (Clin Gastroenterol Hepatol)","pmid":"33002890","finding":"IgA-tTG2 sensitivity may be 57.1% (CI: 35.4–76.4%) after verification bias adjustment","contradicts":"Widely cited >95% sensitivity of IgA-tTG2 for CD"},{"citation":"Abrams et al. 2004 (Dig Dis Sci)","pmid":"15185855","finding":"EMA positivity only 33% in partial villous atrophy vs 77% in total villous atrophy","contradicts":"Assumption that serology sensitivity is uniformly high across all Marsh 3 grades"},{"citation":"Schiepatti et al. 2021 (Aliment Pharmacol Ther)","pmid":"34496060","finding":"SNCD patients have HR 10.87 for complications and HR 2.18 for mortality vs seropositive CD","contradicts":"Implicit guideline assumption that seronegativity represents milder disease"},{"citation":"Volta et al. (strict Paris criteria) various","pmid":null,"finding":"SNCD prevalence only 1.7–4.2% with strict criteria","contradicts":"Hypothesis that a large seronegative population is missed (though this finding itself is subject to verification bias)"},{"citation":"Fernández-Bañares et al. 2014 (PLOS ONE)","pmid":"24988440","finding":"Mucosal tTG2 deposits achieved only 60% sensitivity vs 95% for celiac lymphogram in seronegative lymphocytic enteritis (P=0.039)","contradicts":"Early reports of 100% sensitivity for mucosal deposits (Salmi 2006)"},{"citation":"WBAIL-2 assay 2025 (Gastroenterology)","pmid":"40499737","finding":"Whole-blood IL-2 T-cell assay sensitivity only 56% in HLA-DQ8+ patients vs 90% in DQ2.5+","contradicts":"Hope that T-cell assays would universally bypass serology limitations"}],"research_gaps":[{"gap":"No biomarker has been validated specifically in a pure seronegative Marsh 3a cohort. All existing data comes from mixed SNVA populations.","importance":"high","proposed_study_design":"Prospective study: biopsy all HLA-DQ2/DQ8+ symptomatic patients regardless of serology, stratify biomarker performance by Marsh grade (3a vs 3b vs 3c)"},{"gap":"IgG subclass levels (especially IgG1 and IgG3) have never been systematically measured in confirmed SNCD cohorts","importance":"high","proposed_study_design":"Add IgG subclass panel to existing SNVA workup protocols at referral centers; correlate with mucosal markers and HLA type"},{"gap":"No serology-independent prospective study has estimated true SNCD prevalence to overcome verification bias","importance":"high","proposed_study_design":"Population-based screening: HLA-DQ typing + biopsy in symptomatic HLA-positive individuals irrespective of serology; apply celiac lymphogram to all biopsies"},{"gap":"IL-2 T-cell assays not tested in seronegative cohorts; DQ8 performance gap (56% vs 90%) unresolved","importance":"high","proposed_study_design":"Apply WBAIL-2 assay to confirmed SNCD cohorts with known HLA type; determine if DQ8-specific peptide panels improve sensitivity"},{"gap":"H-41 antibody for γδ-IEL detection on FFPE needs multicenter validation against flow cytometry gold standard","importance":"high","proposed_study_design":"Multicenter study: paired FFPE (H-41 IHC) and fresh tissue (flow cytometry) on same biopsies; determine thresholds and inter-observer reproducibility"},{"gap":"Secretory IgA levels in stool have not been correlated with mucosal tTG2 deposit status or serum antibody levels in CD patients","importance":"medium","proposed_study_design":"Correlational study in CD cohort: stool sIgA + serum tTG2 + mucosal deposit immunofluorescence"},{"gap":"Non-HLA genetic architecture of seronegative vs seropositive CD has never been compared","importance":"medium","proposed_study_design":"GWAS comparison or polygenic risk score analysis in well-phenotyped SNCD vs seropositive CD cohorts"},{"gap":"Circulating miRNA panels have not been tested in a dedicated SNCD cohort","importance":"medium","proposed_study_design":"Apply validated miRNA panels (Felli 2022) to confirmed SNCD cohort; determine if performance matches low-tTG2 subset findings"}],"differential_diagnoses_relevant":[{"condition":"CVID (Common Variable Immunodeficiency) enteropathy","overlap_with_cd":"Seronegative villous atrophy, low immunoglobulins, may have HLA-DQ2/DQ8","distinguishing_features":"Absent/reduced lamina propria plasma cells (present in CD); total IgG typically <4.5 g/L; broader immunodeficiency with recurrent infections; no GFD response; may have nodular lymphoid hyperplasia"},{"condition":"IgA deficiency (selective)","overlap_with_cd":"Negative IgA-tTG2 (false negative due to absent IgA); villous atrophy possible","distinguishing_features":"Total IgA < 0.07 g/L; IgG-based serology (IgG-tTG2, IgG-DGP) may be positive; standard workup should catch this if total IgA measured"},{"condition":"Drug-induced enteropathy (olmesartan, mycophenolate)","overlap_with_cd":"Villous atrophy, increased IELs, seronegative","distinguishing_features":"Drug exposure history; resolution after drug discontinuation; negative celiac lymphogram; negative mucosal tTG2 deposits"},{"condition":"Autoimmune enteropathy","overlap_with_cd":"Villous atrophy, seronegative for CD markers","distinguishing_features":"Anti-enterocyte and anti-goblet cell antibodies; refractory to GFD; may respond to immunosuppression; often associated with other autoimmune conditions"},{"condition":"NCGS (Non-Celiac Gluten Sensitivity)","overlap_with_cd":"Gluten-responsive symptoms, seronegative","distinguishing_features":"No villous atrophy (Marsh 0-1); normal or non-celiac lymphogram; no mucosal tTG2 deposits; symptomatic improvement on GFD without histological response"},{"condition":"Tropical sprue","overlap_with_cd":"Villous atrophy, malabsorption, seronegative","distinguishing_features":"Travel/residence history in endemic areas; response to antibiotics; typically involves distal small bowel more than proximal"},{"condition":"Giardiasis","overlap_with_cd":"Villous atrophy possible, increased IELs (including γδ+ in some cases)","distinguishing_features":"Stool testing or duodenal aspirate positive for Giardia; response to antiparasitic treatment"}],"recommendations":[{"recommendation":"Lower biopsy threshold in HLA-DQ2/DQ8-positive symptomatic patients regardless of serology status. Clinical probability thresholds in guidelines should explicitly account for severity-dependent serology sensitivity.","target":"guidelines, clinicians","evidence_basis":"Serology sensitivity only ~33% for partial VA (Abrams 2004); modeled overall sensitivity 35–57% (Hujoel 2021); seronegative patients have worse outcomes (Schiepatti 2021)"},{"recommendation":"When duodenal biopsy is performed for any indication, collect at least one additional fresh biopsy in saline for flow cytometry (celiac lymphogram) where available, or request γδ+ IEL IHC on FFPE using H-41 antibody.","target":"clinicians, pathology labs","evidence_basis":"Celiac lymphogram 87%/96.7% in SNVA (Fernández-Bañares 2020); H-41 on FFPE 96%/95% (PMC8449760); cost of additional biopsy minimal vs. diagnostic gain"},{"recommendation":"Include IgG subclass measurement (IgG1, IgG3) in the workup of suspected seronegative CD, particularly in HLA-DQ8+ patients with low secretory IgA.","target":"clinicians, researchers","evidence_basis":"Mechanistic rationale that IgG1 deficiency impairs both IgA and IgG antibody detection pathways; no existing data to confirm or refute in SNCD cohorts"},{"recommendation":"Conduct serology-independent prospective biopsy studies to determine true SNCD prevalence and overcome verification bias.","target":"researchers, funding bodies","evidence_basis":"All current prevalence estimates are circular; verification bias inflates apparent serology sensitivity"},{"recommendation":"Test IL-2-based T-cell assays in seronegative cohorts with HLA-DQ8 stratification; develop DQ8-specific peptide panels if current sensitivity gap (56% vs 90%) is confirmed.","target":"researchers","evidence_basis":"WBAIL-2 assay bypasses antibody pathways but has documented DQ8 performance gap (PMID:40499737)"},{"recommendation":"Multicenter validation of H-41 antibody γδ-IEL IHC on FFPE against flow cytometry gold standard, with explicit Marsh 3a stratification.","target":"researchers, pathology societies","evidence_basis":"Most impactful near-term development for broadening access to γδ+ IEL assessment beyond specialized flow cytometry centers"},{"recommendation":"Guidelines should explicitly state that negative serology does not exclude CD, particularly in patients with partial villous atrophy, HLA-DQ8, or immunoglobulin subclass deficiencies.","target":"guidelines","evidence_basis":"Multiple lines of evidence from verification bias analysis, severity-dependent serology, and mucosal marker studies"}],"meta_analysis_summary":{"studies_reviewed":45,"total_patients":null,"pooled_estimates":{"celiac_lymphogram_SNVA":{"sensitivity":"87%","specificity":"96.7%","source":"Fernández-Bañares 2020 (n=67 SNVA)"},"celiac_lymphogram_pooled":{"sensitivity":"93%","specificity":"98%","AUC":"0.98","source":"Meta-analysis 6 studies (n=959)"},"gamma_delta_IEL_alone_SNVA":{"sensitivity":"91.3%","specificity":"83.3%","source":"Fernández-Bañares 2020"},"gamma_delta_IEL_FFPE_IHC":{"sensitivity":"96%","specificity":"95%","AUC":"0.997","source":"PMC8449760"},"mucosal_tTG2_deposits":{"sensitivity":"60-100% (highly variable)","specificity":"questioned (up to 24% false positives)","source":"Multiple studies"},"I_FABP":{"sensitivity":"51%","specificity":"88%","AUC":"0.79","source":"Kaul 2025"},"circulating_miRNA":{"sensitivity":"73.9%","specificity":"96.9%","AUC":"0.909","source":"Felli 2022"},"WBAIL2_DQ2.5":{"sensitivity":"90%","specificity":"95%","source":"PMID:40499737"},"WBAIL2_DQ8":{"sensitivity":"56%","specificity":"not separately reported","source":"PMID:40499737"},"IgA_tTG2_adjusted":{"sensitivity":"57.1% (CI: 35.4-76.4%)","source":"Hujoel 2021 modeled"},"EMA_partial_VA":{"sensitivity":"33%","source":"Abrams 2004"}},"heterogeneity_notes":"Low heterogeneity for complete celiac lymphogram across studies; moderate-high for γδ+ IEL alone and mucosal deposits. I-FABP studies show high variability depending on threshold and population. Verification bias affects all estimates from serology-ascertained cohorts. No study stratifies results by pure Marsh 3a."},"cross_model_divergences_resolved":[{"topic":"Mucosal tTG2 deposit sensitivity","opus_position":"60–100% range, specificity questioned, weaker than lymphogram in head-to-head","grok_position":"~90% prevalence in mild/seronegative forms","resolution":"Range of 60–100% adopted as more accurate given variability across studies and later head-to-head data (Fernández-Bañares 2014). The ~90% figure derives primarily from early Finnish studies with different methodology.","confidence":"moderate"},{"topic":"HLA-DQ8 association with seronegativity","opus_position":"Emerging trend supported by mechanistic data (Vader 2003, Koskinen 2020) and slight enrichment in SNCD (Volta 2024)","grok_position":"No evidence DQ8 predicts seronegativity more than DQ2.5","resolution":"Classified as 'emerging evidence, not confirmed.' Real mechanistic basis (narrower peptide repertoire, gene dose effect on antibody positivity) and observed trends, but no adequately powered study with confounding adjustment.","confidence":"low-to-moderate"},{"topic":"IL-2 T-cell assays","opus_position":"Promising antibody-independent approach with critical DQ8 sensitivity gap (56% vs 90%)","grok_position":"Not discussed","resolution":"Included as emerging finding. The DQ8 performance gap is directly relevant to the project patient context and represents a major caveat for T-cell-based approaches in seronegative populations.","confidence":"moderate"}]}
