{"research_topic_id":"marsh-3a","research_topic_title":"Marsh 3A Pathobiology and Patient Characteristics — The Diagnostic Blind Spot at the Threshold of Villous Atrophy","date_completed":"2026-02-07","version":"4.0 (post cross-chat peer review from 2.4A2)","revision_notes":"v3→v4 changes per 2.4A2 peer review: (1) Added Schiepatti SNCD outcomes data (HR 10.87/2.18) as new finding f14; (2) Qualified 70–85% IgA-tTG2 sensitivity at Marsh 3A as DERIVED estimate; (3) Added frozen tissue caveat to reference patient recommendation; (4) Precision improvement on γδ IEL finding (F3) — percentages vs absolute counts on GFD; (5) Strengthened natural history caveat (F12) — pre-atrophy vs post-threshold distinction; (6) Added EMA assay generation caveat to F4. Prior: v2→v3 corrections from 2.4A cross-review (Hujoel moderate, deposits 60–100%, lymphogram SNVA data). v1→v2: Grok 4.1 review (evidence grading, inferential distinction).","companion_documents":["2.4A: Biomarkers for Identifying Seronegative Celiac Disease with Partial Villous Atrophy (Marsh 3a) — Merged Synthesis"],"executive_summary":"Marsh 3A (partial villous atrophy) represents the mechanistic threshold where innate IL-15/NKG2D cytotoxicity first engages atop an established adaptive anti-gluten response, and it is the histological grade where serological sensitivity collapses most dramatically (EMA positivity ~31–33%, IgA-tTG2 sensitivity ~70–85% vs >95% at Marsh 3C). Verification bias in serology-first diagnostic pathways — modeled by Hujoel et al. as reducing overall IgA-tTG2 sensitivity from 92.6% to an estimated 57.1% (not empirically measured) — systematically excludes seronegative Marsh 3A patients from diagnosis and from research cohorts, creating a self-reinforcing gap in which the population most likely to challenge current sensitivity estimates remains invisible to the evidence base that defines them.","key_findings":[{"finding_id":"f1","finding":"Marsh 3A represents the initial engagement of the innate IL-15/NKG2D cytotoxic pathway (Signal 2) atop an established adaptive gluten-specific T-cell response (Signal 1). The degree of villous atrophy from 3A→3C reflects the amplitude and duration of IL-15-driven cytotoxic activation balanced against crypt regenerative capacity, not qualitatively distinct pathological mechanisms.","evidence_strength":"strong","evidence_type":"DIRECTLY EVIDENCED for two-signal model; INFERENTIAL for positioning Marsh 3A specifically as threshold of innate engagement (no study has directly measured IL-15 levels across 3A/3B/3C grades)","quantitative_estimate":null,"confidence_interval":null,"key_citations":["PMID: 15357948 (Hüe et al. Immunity 2004 — NKG2D/MICA)","PMID: 15485631 (Meresse et al. Immunity 2004)","DOI: 10.1038/s41586-020-2015-4 (Abadie et al. Nature 2020 — mouse model)","PMID: 26060107 (Setty et al. 2015 — epithelial stress)"],"contradicts_guidelines":false,"affected_patient_population":"All CD patients; framework explains why mild atrophy may occur with lower immune activation"},{"finding_id":"f2","finding":"Apoptotic injury to enterocytes is similar in magnitude across mild and advanced enteropathy, with no significant difference in end-apoptotic markers or perforin expression between Marsh 3A and 3B/3C. This suggests the critical variable determining atrophy grade is compensatory crypt proliferation rather than differential rates of epithelial killing.","evidence_strength":"moderate","evidence_type":"DIRECTLY EVIDENCED but from a single study","quantitative_estimate":"No significant difference in apoptotic markers between mild vs advanced","confidence_interval":null,"key_citations":["PMID: 27378705 (Shalimar et al. 2016)"],"contradicts_guidelines":false,"affected_patient_population":"Marsh 3A patients — implies their mucosa is under comparable cytotoxic stress to 3C"},{"finding_id":"f3","finding":"αβ T-cell IEL counts correlate with villous atrophy grade, while γδ T-cell IEL percentages remain elevated independent of grade or dietary status. This dissociation identifies αβ CD8+ IELs as effector cells of progressive destruction and γδ IELs as permanent celiac markers useful for serology-independent diagnosis. PRECISION NOTE: γδ IEL percentages (relative to total IELs) remain diagnostically elevated on GFD and across Marsh grades, but absolute γδ counts may decrease somewhat as total IEL counts normalize on GFD. The celiac lymphogram pattern (high γδ% + low sCD3−%) persists across grades, but absolute counts have not been demonstrated to be identical across 3A/3B/3C. The clinical conclusion — γδ IELs are useful permanent markers — holds regardless.","evidence_strength":"strong","evidence_type":"DIRECTLY EVIDENCED across multiple studies","quantitative_estimate":null,"confidence_interval":null,"key_citations":["PMID: 8432475 (Kutlu et al. Gut 1993)","PMID: 1829988 (Halstensen et al. 1991)","PMID: 21221796 (Camarero et al. 2011)"],"contradicts_guidelines":false,"affected_patient_population":"All CD patients; diagnostically critical for seronegative cases"},{"finding_id":"f4","finding":"EMA sensitivity collapses from ~100% at Marsh 3C to ~31–33% at Marsh 3A. IgA-tTG2 sensitivity is also grade-dependent, with a DERIVED estimate of 70–85% at Marsh 3A (no study has directly reported IgA-tTG2 sensitivity stratified by Marsh sub-grade; this range is inferred from titer distributions relative to assay cutoffs). Mean IgA-tTG2 titers show a continuous gradient: ~4.0× ULN at 3A, ~5.7× at 3B, ~11.8× at 3C. ASSAY GENERATION NOTE: The 31–33% EMA figures derive from Rostami (1999) and Abrams (2004) using older immunofluorescence assays; modern EMA testing has better standardization and some recent series report somewhat higher sensitivity at partial VA, though still dramatically lower than at total VA. The 31–33% figure may represent a floor estimate rather than current best estimate, but the directional finding (massive sensitivity drop at 3A) is robust across assay generations.","evidence_strength":"strong","evidence_type":"DIRECTLY EVIDENCED for EMA sensitivity gradient and titer gradient across multiple independent cohorts (meta-analysis confirmed). The 70–85% IgA-tTG2 sensitivity estimate at Marsh 3A is DERIVED — inferred from mean titer data and assay cutoff distributions, not from a study directly reporting tTG2 sensitivity stratified by Marsh sub-grade","quantitative_estimate":"EMA: 31% sensitivity at Marsh 3A (Rostami 1999); 33% at partial VA (Abrams 2004). IgA-tTG2 mean fold-rise 4.0×/5.7×/11.8× by grade (Qureshi 2023 meta-analysis, n=2,505)","confidence_interval":null,"key_citations":["PMID: 10201452 (Rostami et al. 1999)","PMID: 15185855 (Abrams et al. 2004)","PMID: 24583754 (Singh et al. 2014)","DOI: 10.7759/cureus.50697 (Qureshi 2023 meta-analysis)"],"contradicts_guidelines":true,"affected_patient_population":"Patients with Marsh 3A — majority are EMA-negative; significant minority are IgA-tTG2-negative"},{"finding_id":"f5","finding":"Verification bias inflates reported IgA-tTG2 sensitivity. Only 3.6% of seronegative patients were referred for biopsy vs 79.2% of seropositive, creating a 22-fold referral differential. Bias-corrected IgA-tTG2 sensitivity drops from 92.6% to a MODELED estimate of 57.1% (range 35–74%). NOTE: This is a retrospective statistical adjustment, not a direct empirical measurement from a serology-independent cohort.","evidence_strength":"moderate","evidence_type":"MODELED ESTIMATE from retrospective data with sensitivity analysis — NOT direct empirical measurement. The 22-fold referral differential is directly evidenced; the adjusted sensitivity figure is derived by correcting for this differential under assumptions about the unbiopsied population","quantitative_estimate":"Reported 92.6% → adjusted 57.1% (range 35–74%)","confidence_interval":"35–74% (sensitivity analysis range)","key_citations":["PMID: 32433257 (Hujoel et al. J Clin Gastroenterol 2021)"],"contradicts_guidelines":true,"affected_patient_population":"All patients screened by serology-first algorithms; disproportionately affects Marsh 3A"},{"finding_id":"f6","finding":"Seronegative celiac disease is enriched in milder histological grades. In SNCD cohorts, Marsh 3A and lower grades are overrepresented compared to seropositive cohorts where Marsh 3C predominates. SNCD accounts for 28–45% of seronegative villous atrophy cases across three independent referral center studies.","evidence_strength":"moderate","evidence_type":"DIRECTLY EVIDENCED but from small referral-center cohorts (n=13 to n=200); prevalence estimates carry wide uncertainty","quantitative_estimate":"SNCD as fraction of SNVA: 28% (DeGaetani, n=72), 31% (Aziz, n=200), 45% (Volta, n=31). SNCD overall prevalence: 1.7–4.2% of all CD (strict definition); up to 28–36% with broader definitions","confidence_interval":"Wide; small cohorts, referral-center bias","key_citations":["PMID: 23073190 (DeGaetani et al. 2013)","PMID: 27352981 (Volta et al. 2016)","Aziz et al. Gut 2017 (200 SNVA cases)"],"contradicts_guidelines":true,"affected_patient_population":"Seronegative patients with villous atrophy — significant fraction have true CD"},{"finding_id":"f7","finding":"Marsh 3A patients are more commonly adults with atypical/extraintestinal presentations. Non-classical presentation adds ~8 years to diagnostic delay and is associated with milder histology. Screening-detected CD (type 1 diabetes, first-degree relatives) yields lower Marsh grades on average.","evidence_strength":"moderate","evidence_type":"DIRECTLY EVIDENCED for symptom-severity correlation; INFERENTIAL for specific Marsh 3A demographic profile (most studies report grouped 'mild' vs 'severe' rather than 3A specifically)","quantitative_estimate":"Non-classical presentation adds ~8 years to age at diagnosis (Dutch cohort)","confidence_interval":null,"key_citations":["DOI: 10.1016/j.ejim.2020.07.032 (Dutch adult cohort 2020)","PMID: 34267636 (pediatric spectrum study)"],"contradicts_guidelines":false,"affected_patient_population":"Adults with atypical/silent CD; screening-detected populations"},{"finding_id":"f8","finding":"HLA-DQ2.5 gene dosage (homozygosity) increases CD risk 5-fold and predicts progression from potential to active CD, but does NOT predict severity of villous atrophy once atrophy is established (no effect on 3A vs 3B vs 3C). DQ8-only CD (5–10% of patients) shows no significant difference in villous atrophy severity in limited data.","evidence_strength":"strong for gene dose effect on risk; moderate for absence of effect on atrophy grade; weak for DQ8-specific analysis (underpowered)","evidence_type":"DIRECTLY EVIDENCED — gene dose-risk link from multiple cohorts; absence of grade association directly tested by Murray et al. and Biagi meta-analysis; DQ8 data limited","quantitative_estimate":"DQ2.5 homozygous: 5× risk vs heterozygous; 4× higher T-cell response (Vader PNAS 2003). No grade-severity association (P=1.00, Murray et al.)","confidence_interval":null,"key_citations":["PMID: 14528023 (Vader et al. PNAS 2003)","DOI: 10.1371/journal.pone.0212329 (Biagi et al. 2019)","PMID: 15290664 (Johnson/Murray CGH 2004)"],"contradicts_guidelines":false,"affected_patient_population":"DQ8-only and DQ2 heterozygous patients — may be overrepresented at Marsh 3A but NO DIRECT EVIDENCE exists for this"},{"finding_id":"f9","finding":"Mucosal tTG2 IgA deposits (detected by double immunofluorescence) show VARIABLE sensitivity of 60–100% across studies, with early Finnish studies reporting ~100% in untreated adult CD but later head-to-head comparison showing only 60% sensitivity vs 95% for the celiac lymphogram in seronegative lymphocytic enteritis (P=0.039, Fernández-Bañares 2014). Specificity is ~94% but questioned by Maglio 2017 showing up to 24% false positives in non-CD enteropathies (some of which may represent unrecognized SNCD). Deposits are detectable even when serum antibodies are absent. IgM deposits found in 86% of IgA-deficient patients. Requires frozen tissue and specialized immunofluorescence — not available in routine pathology.","evidence_strength":"moderate","evidence_type":"DIRECTLY EVIDENCED but with significant methodological variability across studies. Early high-sensitivity reports (Koskinen/Salmi series) not replicated in later head-to-head comparison. The 24% false-positive rate in non-CD enteropathies may partially reflect unrecognized SNCD in the 'non-CD' group — a circular problem.","quantitative_estimate":"60–100% sensitivity (method-dependent); 60% in head-to-head vs lymphogram (P=0.039); ~94% specificity (questioned); detectable in 79% at Marsh 1–2; IgM deposits in 86% of IgA-deficient","confidence_interval":null,"key_citations":["PMID: 16690725 (Salmi et al. Gut 2006)","PMID: 18270315 (Koskinen et al. 2008)","PMID: 20042489 (Koskinen et al. 2010)","PMID: 20098329 (Borrelli et al. 2010)","PMID: 24988440 (Fernández-Bañares et al. PLOS ONE 2014 — head-to-head vs lymphogram)","Maglio et al. 2017 (false-positive rate in non-CD)"],"contradicts_guidelines":false,"affected_patient_population":"Seronegative CD patients; early/potential CD; IgA-deficient patients"},{"finding_id":"f10","finding":"The celiac lymphogram (IEL flow cytometry: ≥14% γδ+ IELs + ≤4% CD3-negative IELs) achieves 87% sensitivity and 96.7% specificity in a dedicated seronegative villous atrophy cohort (n=67, Fernández-Bañares 2020), with pooled meta-analysis of 6 studies (n=959) showing 93% sensitivity and 98% specificity (AUC 0.98). In earlier general CD cohorts: 79% sensitivity, 98% specificity, LR+ 36.2. A discriminant function combining CD3+ and γδ+ IELs approaches ~98% sensitivity/specificity. The lymphogram is independent of serology, gluten intake, and histological grade, persists on GFD, and — critically — shows identical immunophenotypes in seronegative and seropositive patients. γδ+ IEL quantification alone achieves 91.3% sensitivity and 83.3% specificity in SNVA. The H-41 monoclonal antibody (2020) enables γδ-IEL detection on standard FFPE biopsies (96% sensitivity, 95% specificity, AUC 0.997), potentially eliminating the need for fresh tissue. See companion document 2.4A for full biomarker analysis.","evidence_strength":"strong","evidence_type":"DIRECTLY EVIDENCED — dedicated SNVA validation cohort (Fernández-Bañares 2020), pooled meta-analysis, multiple independent validation studies, FFPE validation (single-center, needs multicenter confirmation)","quantitative_estimate":"SNVA cohort: 87%/96.7% (CI: 73.7–95% / 82.7–99.9%); pooled: 93%/98% (AUC 0.98); γδ alone in SNVA: 91.3%/83.3%; FFPE H-41 IHC: 96%/95% (AUC 0.997); general CD: LR+ 36.2","confidence_interval":null,"key_citations":["PMID: 32048756 (Fernández-Bañares et al. 2020 — SNVA cohort)","PMID: 38674808 (meta-analysis 6 studies, n=959)","PMID: 35264502 (lymphogram validation 2024)","PMID: 35088188 (Leon et al. 2022)","PMC8449760 (H-41 antibody FFPE validation)"],"contradicts_guidelines":false,"affected_patient_population":"Seronegative, diet-uncertain, or diagnostically equivocal cases"},{"finding_id":"f11","finding":"The ESPGHAN no-biopsy pathway (IgA-tTG2 >10× ULN + positive EMA) captures only ~51% of pediatric celiac patients and excludes all seronegative cases by design, reinforcing a diagnostic loop where seronegative CD appears artificially rare.","evidence_strength":"strong","evidence_type":"DIRECTLY EVIDENCED — derived from published sensitivity data of the pathway criteria","quantitative_estimate":"~51% of CD patients qualify for no-biopsy diagnosis","confidence_interval":null,"key_citations":["DOI: 10.1053/j.gastro.2023.11.029 (no-biopsy meta-analysis 2024)"],"contradicts_guidelines":true,"affected_patient_population":"Patients with low-moderate tTG2 titers; all seronegative patients"},{"finding_id":"f12","finding":"No prospective longitudinal study has tracked Marsh 3A patients on continued gluten exposure. Natural history data are extrapolated from potential CD cohorts (Marsh 0–1 + positive serology), showing 43% cumulative incidence of progression to villous atrophy at 12 years (Auricchio 2019), with 57% NOT progressing and 32% spontaneously losing positive serology. CRITICAL CAVEAT: This extrapolation is problematic because Marsh 3A patients have already crossed the threshold into villous atrophy — their biological situation is fundamentally different from pre-atrophy potential CD patients. Marsh 3A patients could follow any of three trajectories: (1) progressive decompensation to 3B/3C, (2) stable equilibrium (regeneration matching destruction), or (3) partial improvement if the initial insult was partly transient. The Auricchio progression rate cannot be applied to post-threshold patients without direct evidence.","evidence_strength":"strong (for the evidence gap); moderate (for extrapolated progression estimates)","evidence_type":"The GAP is directly evidenced by literature review. Progression estimates are INFERENTIAL — extrapolated from lower-grade lesions, not Marsh 3A specifically","quantitative_estimate":"43% progression at 12 years from potential CD (Marsh 0–1); 60% progression from seropositive Marsh 1 at median 46.9 months (Garber)","confidence_interval":null,"key_citations":["PMID: 30978358 (Auricchio et al. Gastroenterology 2019)","PMID: 27245161 (Garber et al. 2016)"],"contradicts_guidelines":false,"affected_patient_population":"Marsh 3A patients — whether their condition is stable or progressive remains unknown"},{"finding_id":"f13","finding":"For the reference patient profile (negative IgA-tTG2 <1, negative anti-DGP IgG <1, low IgG1, low secretory IgA, DQ8, Marsh 3A): low secretory IgA impairs mucosal IgA production at the site of antibody generation; low IgG1 (60–70% of total IgG and the dominant subclass of anti-gliadin IgG) defeats the compensatory IgG pathway; DQ8 binds fewer immunodominant epitopes, supporting a milder adaptive response. This creates a dual IgA/IgG serologic blind spot.","evidence_strength":"emerging","evidence_type":"INFERENTIAL — each component mechanism is individually evidenced but the specific convergence producing seronegativity in this profile has NOT been directly studied or published","quantitative_estimate":null,"confidence_interval":null,"key_citations":["PMID: 22610252 (Di Niro et al. Nat Med 2012 — mucosal antibody origin)","PMID: 31926163 (Uhde et al. 2020 — IgG1 subclass in gluten sensitivity)","HLA epitope binding data (general reference)"],"contradicts_guidelines":false,"affected_patient_population":"Patients with combined low secretory IgA + low IgG1 + lower-risk HLA types"},{"finding_id":"f14","finding":"Seronegative CD patients have significantly worse long-term outcomes than seropositive CD patients: complication hazard ratio 10.87 and mortality HR 2.18 in a 20-year multicentre follow-up (Schiepatti et al. 2021). This directly supports clinical urgency for improved seronegative detection. Whether the worse outcomes reflect delayed diagnosis (seronegative patients diagnosed later with more accumulated damage), more aggressive underlying biology, confounding by older age at diagnosis, or a combination remains unresolved.","evidence_strength":"moderate","evidence_type":"DIRECTLY EVIDENCED from a single large multicentre cohort with long follow-up, but causality of the association is not established and confounding by diagnostic delay is plausible","quantitative_estimate":"HR 10.87 for complications; HR 2.18 for mortality (SNCD vs seropositive CD)","confidence_interval":null,"key_citations":["PMID: 34496060 (Schiepatti et al. Aliment Pharmacol Ther 2021)"],"contradicts_guidelines":true,"affected_patient_population":"All SNCD patients — strengthens the case that missed seronegative diagnoses carry clinical consequences"}],"biases_documented":[{"bias_type":"verification bias","description":"Serology-first diagnostic algorithms create a 22-fold referral differential (79.2% of seropositive vs 3.6% of seronegative referred for biopsy), inflating reported sensitivity from ~93% to a modeled true estimate of ~57% (not empirically measured in a serology-independent cohort). This disproportionately excludes Marsh 3A, the grade with lowest serological sensitivity.","magnitude_estimate":"Reported sensitivity 92.6% → modeled adjusted 57.1% (range 35–74%; wide CI reflects assumptions about unbiopsied population)","evidence_sources":["PMID: 32433257 (Hujoel et al. 2021)"]},{"bias_type":"selection bias in cohort composition","description":"Characterization of Marsh 3A clinical phenotype derives almost exclusively from the ~31–33% of Marsh 3A patients who are seropositive enough to reach biopsy. The remaining ~67–69% are never studied. Published demographics, symptom profiles, and biomarker data for Marsh 3A therefore represent a profoundly biased subset.","magnitude_estimate":"Unknown but potentially fundamental distortion; ~67–69% of Marsh 3A population uncharacterized","evidence_sources":["Derived from EMA sensitivity data at Marsh 3A (Rostami 1999, Abrams 2004)"]},{"bias_type":"classification bias (Corazza-Villanacci system)","description":"The simplified Corazza-Villanacci classification merges Marsh 3A and 3B into a single grade (B1), obscuring the distinct diagnostic vulnerability of Marsh 3A. Studies using this system cannot distinguish 3A-specific patterns.","magnitude_estimate":"Affects all studies using Corazza-Villanacci; renders Marsh 3A-specific analysis impossible","evidence_sources":["Corazza & Villanacci Aliment Pharmacol Ther 2005"]},{"bias_type":"circular validation","description":"Guidelines derive sensitivity estimates from serology-selected cohorts, then use those estimates to justify serology-first algorithms, which in turn generate the same biased cohorts. The ESPGHAN no-biopsy pathway exemplifies this: validated only in seropositive patients, it cannot detect the seronegative cases it was never designed to find.","magnitude_estimate":"Unmeasurable within current study designs; requires serology-independent validation to break the cycle","evidence_sources":["ESPGHAN guidelines","No-biopsy meta-analysis 2024"]}],"unproven_assumptions_identified":[{"assumption":"IgA-tTG2 sensitivity is uniformly >90–95% across all histological grades of celiac disease.","evidence_against":"Consistent grade-dependent sensitivity gradient (lowest at Marsh 3A). Verification bias correction drops overall sensitivity to modeled ~57% (not empirically measured). EMA sensitivity only 31–33% at Marsh 3A.","evidence_for":"Large seropositive cohort studies report >95% — but these are inherently biased by serology-gated biopsy referral.","clinical_impact":"Systematic missed diagnoses in patients with mild atrophy and low/negative serology. The true false-negative rate at Marsh 3A is unknown."},{"assumption":"Marsh 3A/3B/3C represent a single disease continuum differing only in severity.","evidence_against":"Comparable apoptotic injury across grades (Shalimar 2016) suggests the difference may be in regenerative capacity, not immune activation intensity. No study has directly compared cytokine profiles across sub-grades.","evidence_for":"Marsh's original framework was explicitly temporal/progressive. Gene dose effects predict progression to atrophy but not grade of atrophy once present.","clinical_impact":"If Marsh 3A is not simply 'early 3C' but a distinct equilibrium state, natural history assumptions and treatment urgency may differ."},{"assumption":"Seronegative celiac disease is rare (1–4% of CD).","evidence_against":"Strict prevalence estimates (1.7–4.2%) derive from serology-gated cohorts that by design exclude seronegative patients. Broader definitions yield 28–36%. Verification-bias-corrected sensitivity (~57%) implies ~43% of true CD cases may be seronegative.","evidence_for":"Referral center SNVA studies consistently identify CD in only 28–45% of cases, suggesting many SNVA cases have other etiologies.","clinical_impact":"If true SNCD prevalence is substantially higher than 4%, a large undiagnosed population exists with ongoing mucosal damage."}],"overlooked_populations":[{"population":"Seronegative or low-titer patients with Marsh 3A celiac disease","estimated_size":"Unknown but potentially substantial — if adjusted IgA-tTG2 sensitivity is ~57%, up to 43% of true CD may be missed, with Marsh 3A disproportionately affected (EVIDENCE STRENGTH: INFERENTIAL)","why_missed":"Serology-first algorithms rarely proceed to biopsy in negative/low-titer cases; 22-fold referral differential","proposed_solution":"Mucosal tTG2 deposit testing and/or IEL flow cytometry in symptomatic patients irrespective of serology; lower biopsy threshold in high-risk groups"},{"population":"DQ8-only celiac patients with mild histology","estimated_size":"~5–10% of all CD is DQ8-only; proportion at Marsh 3A unknown","why_missed":"DQ8 may support lower-amplitude immune responses and lower tTG2 titers, reducing serology sensitivity further. No study has stratified DQ8 patients by Marsh sub-grade.","proposed_solution":"HLA-stratified analysis of Marsh grade distribution in large biopsy registries"},{"population":"Patients with combined immunoglobulin abnormalities (low secretory IgA + low IgG subclasses) who do not meet CVID criteria","estimated_size":"Unknown — this is a subclinical immunodeficiency phenotype not routinely tested for","why_missed":"Standard CD workup does not include IgG subclass analysis or fecal secretory IgA. These patients fail both IgA and IgG-based detection without meeting CVID diagnostic thresholds.","proposed_solution":"IgG subclass testing in seronegative villous atrophy cases; fecal secretory IgA measurement when mucosal IgA deficiency is suspected"}],"diagnostic_step_sensitivity":{"step_name":"IgA-tTG2 serology as initial screening test","reported_sensitivity":">90–95% (guideline/consensus figures from serology-selected cohorts)","adjusted_sensitivity":"57.1% overall after verification bias correction (Hujoel 2021; MODELED estimate, not empirically measured, 95% CI: 35.4–76.4%); DERIVED estimate of 70–85% at Marsh 3A (inferred from titer distributions, not directly measured by any study stratifying tTG2 sensitivity by Marsh sub-grade); ~31–33% for EMA at Marsh 3A (directly measured but from older assays — may be floor estimate)","false_negative_rate":"Modeled ~43% overall (verification bias corrected, wide CI); higher at Marsh 3A — possibly 15–30% for IgA-tTG2, ~67–69% for EMA","key_limitations":["Verification bias: 22-fold differential in biopsy referral (seropositive vs seronegative)","Grade-dependent performance: sensitivity lowest at Marsh 3A, highest at Marsh 3C","IgA deficiency not always pre-screened (~2–3% of CD patients)","IgG subclass deficiencies (e.g., low IgG1) defeat compensatory IgG-DGP testing but are not routinely assessed","Low secretory IgA may impair mucosal antibody production independent of total serum IgA","Seronegative patients excluded from most validation cohorts — circular validation"]},"contradictory_studies":[{"citation":"Rostami et al. Am J Gastroenterol 1999","pmid":"10201452","finding":"EMA sensitivity 100% at Marsh 3C but only 31% at Marsh 3A (P<0.013)","contradicts":"Guideline assumption of uniformly high serological sensitivity across all CD histological grades"},{"citation":"Abrams et al. Dig Dis Sci 2004","pmid":"15185855","finding":"EMA positivity 77% in total VA vs 33% in partial VA (P<0.001); all IgA-tTG2-positive patients had total (not partial) VA","contradicts":"Guideline assumption that IgA-tTG2 has high sensitivity regardless of atrophy severity"},{"citation":"Hujoel et al. J Clin Gastroenterol 2021","pmid":"32433257","finding":"Verification-bias-corrected IgA-tTG2 sensitivity drops from 92.6% to modeled 57.1% (95% CI: 35.4–76.4%; not empirically measured)","contradicts":"All guidelines citing >90% IgA-tTG2 sensitivity as justification for serology-first screening"},{"citation":"Shalimar et al. 2016","pmid":"27378705","finding":"Apoptotic injury comparable between mild and advanced enteropathy — no significant difference in end-apoptotic markers","contradicts":"Assumption that Marsh 3A represents milder immune activation and therefore less clinically significant disease"},{"citation":"Biagi et al. PLOS One 2019 / Murray et al.","pmid":null,"finding":"HLA gene dosage affects CD risk and phenotype but NOT severity of villous atrophy once atrophy is present (P=1.00 for partial vs total VA)","contradicts":"Hypothesis that lower-risk HLA types directly produce milder histological grades"},{"citation":"Schiepatti et al. Aliment Pharmacol Ther 2021","pmid":"34496060","finding":"SNCD patients have HR 10.87 for complications and HR 2.18 for mortality vs seropositive CD over 20-year follow-up","contradicts":"Implicit guideline assumption that seronegative patients represent milder disease or are clinically less important to identify"}],"research_gaps":[{"gap":"Prospective natural history of biopsy-confirmed Marsh 3A on continued gluten exposure: does it progress to 3B/3C, remain stable, or regress?","importance":"high","proposed_study_design":"Serology-independent identification of Marsh 3A cohort (e.g., via screening biopsy programs) with serial histology at 12, 24, 60 months on continued gluten diet, stratified by HLA genotype and baseline IEL profile"},{"gap":"Large-scale characterization of Marsh 3A using serology-independent recruitment to define true clinical phenotype and prevalence","importance":"high","proposed_study_design":"Routine duodenal biopsy in all patients undergoing upper endoscopy for any indication, with full Marsh grading, HLA typing, IEL flow cytometry, and serology — regardless of clinical suspicion for CD"},{"gap":"Direct comparison of cytokine profiles (IL-15, IL-21, IFN-γ), NKG2D/MICA expression, and tight junction protein expression across Marsh 3A/3B/3C sub-grades","importance":"high","proposed_study_design":"Mucosal biopsy immunohistochemistry and transcriptomics in patients stratified by Marsh sub-grade, with adequate representation of seronegative cases"},{"gap":"Association between specific immunoglobulin deficiency patterns (low secretory IgA, low IgG subclasses) and seronegativity in confirmed CD","importance":"medium","proposed_study_design":"Case-control comparison of IgG subclass levels, fecal secretory IgA, and total mucosal IgA production in seronegative vs seropositive biopsy-confirmed CD"},{"gap":"Distribution of HLA-DQ genotypes (DQ2.5 homo/heterozygous, DQ2.2, DQ8, half-DQ2) across Marsh sub-grades 3A/3B/3C","importance":"medium","proposed_study_design":"Retrospective analysis of large biopsy registries with linked HLA genotyping, stratified by Marsh-Oberhuber sub-grade (not Corazza-Villanacci)"},{"gap":"Mucosal tTG2 deposit testing and IEL flow cytometry are not widely available or standardized, despite strong diagnostic performance data","importance":"high","proposed_study_design":"Multicenter standardization and validation studies; cost-effectiveness analysis vs repeat biopsy/empirical GFD trial"}],"differential_diagnoses_relevant":[{"condition":"CVID enteropathy","overlap_with_cd":"Seronegative villous atrophy with immunoglobulin abnormalities; can coexist with HLA-DQ2/DQ8. Most important competing diagnosis given reference patient's immunoglobulin profile.","distinguishing_features":"Lamina propria plasma cell depletion/absence (CD has abundant plasma cells); NO γδ IEL increase; follicular lymphoid hyperplasia (47%); intraepithelial neutrophils (32%); poor GFD response (2/12 vs 7/7 for steroids — Malamut 2010). Requires functional antibody testing (vaccine responses) for formal diagnosis."},{"condition":"Drug-induced enteropathy (olmesartan, NSAIDs, checkpoint inhibitors, mycophenolate)","overlap_with_cd":"Histologically indistinguishable villous atrophy; typically seronegative. Often presents as severe diarrhea in older adults.","distinguishing_features":"Medication history; rapid resolution on drug cessation (typically weeks); no celiac-specific IEL immunophenotype; HLA-DQ2/DQ8 incidental"},{"condition":"Non-celiac gluten sensitivity (NCGS)","overlap_with_cd":"Gluten-responsive symptoms; may have Marsh 0–1 but NOT villous atrophy","distinguishing_features":"EXCLUDED by Marsh 3A finding — NCGS by definition does not cause villous atrophy. Normal γδ IEL percentage. Negative mucosal tTG2 deposits."},{"condition":"Autoimmune enteropathy","overlap_with_cd":"Villous atrophy with seronegative CD serology","distinguishing_features":"Anti-enterocyte antibodies; anti-goblet cell antibodies; normal γδ IEL immunophenotype; may respond to immunosuppression but not GFD"},{"condition":"Giardiasis","overlap_with_cd":"Can cause villous atrophy; association with IgA deficiency and low secretory IgA","distinguishing_features":"Stool antigen testing or biopsy identification of trophozoites; responds to metronidazole; no celiac-specific IEL changes"},{"condition":"Tropical sprue","overlap_with_cd":"Villous atrophy with malabsorption","distinguishing_features":"Geographic exposure history; responds to antibiotics + folate; typically affects ileum more than proximal duodenum"},{"condition":"IgA deficiency (selective)","overlap_with_cd":"Seronegative IgA-tTG2 in a patient who may have CD; prevalence of CD in IgA deficiency is 10–15×","distinguishing_features":"Total serum IgA <0.07 g/L; can be resolved by testing IgG-tTG2 and IgG-DGP. Distinguished from reference patient who has normal total IgA but low secretory IgA."}],"recommendations":[{"recommendation":"Guidelines should explicitly acknowledge grade-dependent serological sensitivity and state that IgA-tTG2 sensitivity at Marsh 3A is substantially lower (estimated 70–85%) than the >95% often cited for CD overall.","target":"guidelines","evidence_basis":"Strong: consistent data from multiple independent cohorts (Rostami 1999, Abrams 2004, Singh 2014, Qureshi 2023 meta-analysis)"},{"recommendation":"Clinicians should maintain a low threshold for duodenal biopsy in symptomatic patients regardless of serology, particularly adults with atypical presentation, iron deficiency, osteoporosis, or autoimmune comorbidities.","target":"clinicians","evidence_basis":"Strong: verification bias data (Hujoel 2021) demonstrates 22-fold referral differential; grade-dependent serology sensitivity"},{"recommendation":"For the reference patient (seronegative, low IgG1, low secretory IgA, DQ8, Marsh 3A): pursue IEL flow cytometry for celiac lymphogram (highest priority — 87%/96.7% in SNVA), mucosal tTG2 IgA deposit immunofluorescence IF frozen biopsy tissue is available (requires snap-frozen sections; cannot be performed on standard FFPE), complete immunoglobulin panel with vaccine response testing (CVID evaluation), stool Giardia testing, anti-enterocyte antibodies, and medication review. If frozen tissue was not collected at original biopsy: (a) request γδ+ IEL IHC using H-41 antibody on existing FFPE blocks, and (b) consider re-biopsy with fresh tissue in saline for flow cytometry plus snap-frozen samples for deposit immunofluorescence. GFD trial with repeat endoscopy at 12–24 months is the definitive test.","target":"clinicians","evidence_basis":"Moderate-to-strong: lymphogram is the strongest serology-independent test (87%/96.7% in SNVA); mucosal deposits have variable sensitivity (60–100%) but may still be informative if frozen tissue available; CVID exclusion warranted by immunoglobulin abnormalities; GFD trial recommended by AGA seronegative enteropathy guidelines (Leonard 2021)"},{"recommendation":"IEL flow cytometry (celiac lymphogram) should be the primary serology-independent confirmatory tool for seronegative or low-titer symptomatic patients (87% sensitivity, 96.7% specificity in dedicated SNVA cohort). Mucosal tTG2 deposit testing is a secondary option with more variable sensitivity (60–100%). Where flow cytometry is unavailable, γδ+ IEL immunohistochemistry on FFPE using H-41 antibody is a promising alternative pending multicenter validation. See companion document 2.4A for full biomarker analysis.","target":"guidelines","evidence_basis":"Lymphogram: 87%/96.7% in SNVA (Fernández-Bañares 2020), pooled 93%/98% (meta-analysis n=959). Deposits: 60–100% variable, 60% in head-to-head vs lymphogram (P=0.039, Fernández-Bañares 2014). FFPE H-41: 96%/95% (single center, PMC8449760). Lymphogram outperforms deposits in the seronegative population most relevant to this recommendation."},{"recommendation":"Research should prioritize serology-independent cohort studies using routine biopsy of at-risk populations to break the circular validation inherent in current evidence. The Marsh-Oberhuber (not Corazza-Villanacci) system should be used to preserve 3A-specific granularity.","target":"researchers","evidence_basis":"Strong: pervasive verification and selection bias documented across the literature; Corazza-Villanacci classification merges 3A/3B, eliminating the ability to study the grade with highest diagnostic vulnerability"}],"meta_analysis_summary":{"studies_reviewed":45,"total_patients":null,"pooled_estimates":{"EMA_sensitivity_Marsh_3A":"31–33%","EMA_sensitivity_Marsh_3C":"77–100%","IgA_tTG2_sensitivity_overall_reported":"92.6%","IgA_tTG2_sensitivity_overall_bias_corrected":"57.1% modeled (95% CI: 35.4–76.4%; not empirically measured)","IgA_tTG2_mean_fold_rise_3A":"4.0×","IgA_tTG2_mean_fold_rise_3B":"5.7×","IgA_tTG2_mean_fold_rise_3C":"11.8×","mucosal_tTG2_deposit_sensitivity":"60–100% (method-dependent; 60% in head-to-head vs lymphogram, P=0.039; specificity ~94% but questioned with up to 24% FP)","celiac_lymphogram_SNVA":"87% sensitivity, 96.7% specificity (Fernández-Bañares 2020, n=67 SNVA)","celiac_lymphogram_pooled":"93% sensitivity, 98% specificity, AUC 0.98 (meta-analysis 6 studies, n=959)","celiac_lymphogram_general_CD":"79% sensitivity, 98% specificity, LR+ 36.2","gamma_delta_IEL_alone_SNVA":"91.3% sensitivity, 83.3% specificity","gamma_delta_IEL_FFPE_H41":"96% sensitivity, 95% specificity, AUC 0.997 (single center)","SNCD_as_fraction_of_SNVA":"28–45% across three referral studies","SNCD_prevalence_strict":"1.7–4.2% of all CD","SNCD_outcomes_complications_HR":"10.87 vs seropositive CD (Schiepatti 2021)","SNCD_outcomes_mortality_HR":"2.18 vs seropositive CD (Schiepatti 2021)","progression_potential_CD_to_VA_12yr":"43% (Auricchio 2019) — NOTE: from pre-atrophy potential CD, not Marsh 3A specifically"},"heterogeneity_notes":"High clinical and methodological heterogeneity across studies. Most cohorts assembled through serology-first pathways, introducing pervasive verification bias. Pediatric vs adult populations differ substantially in Marsh grade distribution and symptom profiles. SNCD prevalence estimates span an order of magnitude depending on definition and ascertainment method. Studies using Corazza-Villanacci classification cannot contribute to Marsh 3A-specific analyses. Small sample sizes in SNCD cohorts (n=13 to n=200) limit precision of prevalence estimates. The meta-analytic titer gradient (Qureshi 2023, n=2,505) is the most robust quantitative estimate but still reflects a seropositive-selected population."}}
