{"research_topic_id":"2.4B","research_topic_title":"Marsh 3A Detection Failure: Biopsy Sampling, Pathologist Accuracy, Orientation Artifacts, and Combined False-Negative Rate","date_completed":"2026-02-07","merge_note":"Merged from Opus 4.6 chat 2.4B2 (primary) and Grok 4.1 chat 2.4B1 (supplementary), with PMID verification and peer review corrections applied. Opus 2.4B2 used as base due to substantially greater depth (25 studies, ~140k patients vs 8 studies, ~600 patients). Grok contributions noted where incorporated.","executive_summary":"Marsh 3A (partial villous atrophy) is the celiac disease grade most vulnerable to diagnostic failure, with an estimated combined biopsy false-negative rate of 20–35% in real-world community practice arising from three independent mechanisms: patchy lesion distribution missed by standard sampling (5–10%), pathologist misclassification at the Marsh 2/3A boundary (κ=0.33, 15–25% downgrading rate), and orientation artifacts that obscure mild villous atrophy (5–10% additional loss). When layered onto the serology gateway—where IgA-tTG2 sensitivity drops to ~85% for Marsh 3A and 6–10% of celiac patients are truly seronegative—the overall probability of detecting a seronegative patient with patchy Marsh 3A through standard diagnostic protocols is estimated at only 15–25%.","key_findings":[{"finding_id":"2.4B-F1","finding":"Celiac mucosal damage is patchy in 47% of pediatric patients (different Marsh grades across sites) and 19% of seropositive adults. The most common intra-biopsy variable combination is Marsh 2 + Marsh 3A (43% of variable biopsies). All patients with variable histology had increased IELs even in normal-appearing areas on CD3 immunostaining. Lesion severity follows a proximal-to-distal gradient (p<0.0001).","evidence_strength":"strong","quantitative_estimate":"46.6% inter-site variability (n=686 children); 16.9% intra-biopsy variability; 19% patchy in adults (n=53)","confidence_interval":null,"key_citations":["PMID:20372112","PMID:18058655"],"contradicts_guidelines":false,"affected_patient_population":"All celiac patients, especially those with milder (Marsh 3A) or patchy disease"},{"finding_id":"2.4B-F2","finding":"Biopsy number directly determines diagnostic yield: 2 biopsies detect 90%, 3 detect 95%, 4 detect 100% of villous atrophy in seropositive adults. However, only 35% of US endoscopies submit ≥4 specimens (n=132,352). The probability of celiac diagnosis was 2.6-fold higher with ≥4 specimens (1.8% vs 0.7%, p<0.0001). Site diversity outperforms raw count: 3 biopsies longitudinally (bulb + proximal + distal D2) = 100% sensitivity; 4 quadrantic D2-only = 81.25%.","evidence_strength":"strong","quantitative_estimate":"2.6-fold increased detection with ≥4 biopsies; only 35% US compliance (n=132,352)","confidence_interval":"95% CI 93.2–100% for ≥3 biopsies with bulb","key_citations":["PMID:21601201","PMID:18058655"],"contradicts_guidelines":true,"affected_patient_population":"All patients undergoing endoscopy, particularly in low-adherence settings"},{"finding_id":"2.4B-F3","finding":"Duodenal bulb biopsies add 5–8% incremental diagnostic yield in adults. Bulb-only villous atrophy (ultra-short celiac disease) occurs in 9% of newly diagnosed (95% CI 7.8–10.9%) and 14% of established celiac patients. In 76% of cases with severity discordance between bulb and distal duodenum, the more severe lesion was in the bulb. Within the bulb, 12-o'clock position detects most severe atrophy in 92% vs 65% at 3 o'clock (p=0.02). Ultra-short CD patients tend to be younger, have lower IgA-tTG2 titers, and fewer classical symptoms.","evidence_strength":"strong","quantitative_estimate":"9.2% bulb-only prevalence (95% CI 7.8–10.9%); 5–8% added diagnostic yield","confidence_interval":"7.8–10.9% for USCD prevalence","key_citations":["PMID:21606978","PMID:22624810","PMID:30410959"],"contradicts_guidelines":false,"affected_patient_population":"All celiac patients; particularly those with bulb-restricted disease"},{"finding_id":"2.4B-F4","finding":"Interobserver agreement for Marsh-Oberhuber classification is only fair (κ=0.35 overall), with Marsh 3A achieving κ=0.33 versus κ=0.73 for Marsh 3C. Marsh 2 agreement (κ=0.18) did not reach statistical significance. The simplified Corazza-Villanacci system improves κ to 0.55. Community-to-expert agreement is κ=0.211 for villous atrophy grading, with 27% of cases upgraded on expert re-review.","evidence_strength":"strong","quantitative_estimate":"κ=0.33 for Marsh 3A; κ=0.73 for Marsh 3C; κ=0.55 with Corazza-Villanacci","confidence_interval":null,"key_citations":["PMID:17544877","PMID:22081783"],"contradicts_guidelines":false,"affected_patient_population":"All patients with borderline histology, especially in community practice settings"},{"finding_id":"2.4B-F5","finding":"41% of Marsh 3A cases were called 'normal' by community pathologists on expert re-review. Marsh 1 and 2 were missed in 100% of cases at referring institutions. IEL counts were absent from 86% of community pathology reports; 26% omitted villous atrophy grading entirely. Expert re-review increased celiac diagnosis by 20% (54% → 65%). Overall divergent diagnosis rate between community and expert centers was 46.3%.","evidence_strength":"strong","quantitative_estimate":"41% of Marsh 3A called normal; 20% increase in CD diagnosis on expert re-review; 86% of reports lacked IEL quantification","confidence_interval":null,"key_citations":["PMID:22081783","PMID:20178253"],"contradicts_guidelines":true,"affected_patient_population":"All patients evaluated by non-specialist pathologists (majority of biopsied patients in population-level practice)"},{"finding_id":"2.4B-F6","finding":"Tangential biopsy sectioning can completely invert pathological grading: a Marsh 3B/3C biopsy cut tangentially was graded as Marsh 0–1 by all 5 pathologists. 34–58% of endoscopic duodenal biopsies are suboptimally oriented in routine practice; 10.7% are frankly inadequate for diagnosis; 43% had only one well-oriented fragment. Orientation artifact disproportionately affects Marsh 3A because flat mucosa (3C) is recognizable regardless of cutting angle, while the narrow Vh:CrD window for 3A (1.1–1.7 vs normal 3–4:1) is easily crossed by slight obliquity. Note: orientation artifacts can theoretically cause bidirectional error (over- or under-grading), though net clinical effect favors under-diagnosis of Marsh 3A.","evidence_strength":"strong","quantitative_estimate":"34–58% suboptimal orientation; 10.7% inadequate procedures; complete grade inversion demonstrated","confidence_interval":null,"key_citations":["PMID:24146832","PMID:22081783"],"contradicts_guidelines":false,"affected_patient_population":"All biopsied patients; Marsh 3A most affected"},{"finding_id":"2.4B-F7","finding":"Quantitative morphometry (Vh:Cd measurement) reveals villous atrophy systematically missed by subjective assessment. In clinical trial settings, subjective assessment classified 14/16 celiac patients on GFD as Marsh 0–1, while quantitative measurement showed all 16 had persistent Marsh 3. In a larger serial biopsy cohort, 77% (20/26) with confirmed Vh:Cd atrophy were missed subjectively. Q-MARSH thresholds: Vh:Cd ≥2.3 = Marsh 0/1; 1.1–1.7 = Marsh 3A; <0.5 = Marsh 3C. Morphometric SOP achieves intraclass correlation of 0.978–0.983.","evidence_strength":"strong","quantitative_estimate":"77–100% of Marsh 3 missed by subjective assessment when Vh:Cd confirmed atrophy","confidence_interval":null,"key_citations":["PMID:24146832"],"contradicts_guidelines":true,"affected_patient_population":"All celiac patients assessed by subjective histology alone; especially those on GFD monitoring"},{"finding_id":"2.4B-F8","finding":"Gamma-delta IEL assessment using monoclonal antibody H-41 on FFPE tissue achieves 96% sensitivity / 95% specificity for active celiac disease (cutoff: 6.5 γδ-IELs/100 enterocytes). The coeliac lymphogram (TCRγδ+ increased, CD3− decreased) achieves pooled 93% sensitivity / 98% specificity in meta-analysis of 6 studies (519 patients, 440 controls). In seronegative villous atrophy specifically, coeliac lymphogram by flow cytometry achieved 87% sensitivity / 97% specificity. γδ-IELs remain elevated on GFD, enabling retrospective diagnosis. Low γδ-IEL density distinguishes non-celiac mimics from true CD in all 12 mimic cases studied.","evidence_strength":"strong","quantitative_estimate":"96% sensitivity, 95% specificity (γδ-IEL FFPE IHC); 93% sensitivity, 98% specificity (coeliac lymphogram meta-analysis); 87% sensitivity, 97% specificity (seronegative VA)","confidence_interval":"AUC 0.98 (95% CI 0.97–0.99) for coeliac lymphogram; AUC 0.97 (95% CI 0.95–0.98) for TCRγδ","key_citations":["PMID:33140183","PMID:31443602","PMID:32048756"],"contradicts_guidelines":false,"affected_patient_population":"Diagnostically difficult cases including seronegative and GFD-initiated patients"},{"finding_id":"2.4B-F9","finding":"CD3 immunostaining changed celiac diagnosis in 6.3% of pediatric patients by detecting IELs missed on H&E. CD3 detects significantly more IELs than H&E (mean 3.2 vs 2.1 per 20 enterocytes, p<0.001), but concordance between methods is only 66.8% (κ=0.33). In 9 of 10 diagnostically changed cases, celiac disease had been initially missed on H&E.","evidence_strength":"moderate","quantitative_estimate":"6.3% additional diagnoses; 66.8% concordance H&E vs CD3","confidence_interval":null,"key_citations":["PMID:26140002"],"contradicts_guidelines":false,"affected_patient_population":"Patients with borderline IEL counts on H&E"},{"finding_id":"2.4B-F10","finding":"50% (8/16) of initially normal/inconclusive biopsies were diagnosed celiac on repeat biopsy in a systematic screening study. Expert re-evaluation of original slides identified additional 6 missed cases. In 'potential celiac disease' (seropositive, Marsh 0–1) follow-up studies, 100% developed villous atrophy within 1 year on continued gluten, and 43% cumulative incidence over 12 years in children, suggesting many 'potential celiac' cases represent missed Marsh 3A due to sampling/interpretation failure rather than truly pre-atrophic disease.","evidence_strength":"moderate","quantitative_estimate":"50% diagnostic upgrade on repeat biopsy; 100% VA development within 1 year in potential CD on gluten","confidence_interval":null,"key_citations":["PMID:21502825","PMID:19111551","PMID:30978358"],"contradicts_guidelines":true,"affected_patient_population":"Patients with initial 'normal' or 'potential celiac' biopsy results"},{"finding_id":"2.4B-F11","finding":"Estimated combined biopsy false-negative rate for Marsh 3A is 20–35% in real-world community practice, arising from sampling failure (5–10%), pathologist misclassification (15–25%), and orientation artifacts (5–10%). For seronegative patients, the overall cascade detection probability is estimated at 15–25% when accounting for the low probability (~20–30%) of proceeding to biopsy without positive serology. IMPORTANT METHODOLOGICAL NOTE: This estimate assumes approximate independence of failure modes. No single study has formally modeled this combined rate, and error modes may interact (e.g., poor orientation compounds sampling error when both affect the same specimen). The estimate could overestimate or underestimate the true rate depending on error correlations.","evidence_strength":"moderate","quantitative_estimate":"20–35% biopsy FN rate (community practice); <5% (expert center, optimal protocol); 15–25% overall cascade detection for seronegative Marsh 3A","confidence_interval":null,"key_citations":["Synthesis from PMID:20372112, PMID:18058655, PMID:21601201, PMID:17544877, PMID:22081783, PMID:24146832"],"contradicts_guidelines":true,"affected_patient_population":"Seronegative celiac patients with patchy Marsh 3A; all patients in community practice settings"}],"biases_documented":[{"bias_type":"Sampling bias (patchy disease)","description":"Standard 2–4 biopsy protocols miss patchy Marsh 3A lesions that may be confined to the bulb or present in only some duodenal segments. Real-world adherence to ≥4 biopsy guidelines is only 35% (US) to 22% (UK baseline). Site diversity (including bulb) matters more than raw biopsy count.","magnitude_estimate":"5–10% miss rate with guideline-adherent protocol; substantially higher (15–20%) with substandard protocols used in 60–65% of US endoscopies","evidence_sources":["PMID:20372112","PMID:18058655","PMID:21601201","PMID:21606978"]},{"bias_type":"Inter-observer classification bias","description":"Pathologist disagreement at the Marsh 2/3A boundary (κ=0.33) systematically risks downgrading partial villous atrophy to non-atrophic categories. Community pathologists perform substantially worse than specialists (κ=0.211 vs expert centers), with 27% of cases upgraded and 41% of Marsh 3A called normal on re-review. 86% of community reports lack IEL quantification.","magnitude_estimate":"15–25% misclassification rate for Marsh 3A; 41% called normal at community labs; 46.3% divergent diagnosis community vs expert","evidence_sources":["PMID:17544877","PMID:22081783","PMID:20178253"]},{"bias_type":"Orientation artifact bias","description":"Tangential sectioning creates false villous architecture that specifically obscures mild villous atrophy while leaving total villous atrophy (Marsh 3C) recognizable. The narrow Vh:CrD window for Marsh 3A (1.1–1.7) is easily crossed by slight obliquity. While orientation can theoretically cause bidirectional error, the net clinical effect favors under-diagnosis of Marsh 3A.","magnitude_estimate":"5–10% additional false negatives for Marsh 3A; complete grade inversion (3B/3C → 0/1) demonstrated experimentally; 34–58% suboptimal orientation in routine practice","evidence_sources":["PMID:24146832","PMID:22081783"]},{"bias_type":"Verification bias (serology-first cascade)","description":"Seronegative patients rarely proceed to biopsy, so the biopsy false-negative rate is essentially never tested in this population. IgA-tTG2 sensitivity drops from ~100% for Marsh 3C to ~85% for Marsh 3A, creating systematic exclusion of milder disease from diagnostic validation studies. Biopsy sensitivity estimates are therefore derived almost entirely from seropositive cohorts with potentially more diffuse disease.","magnitude_estimate":"Estimated 20–30% probability of proceeding to biopsy without positive serology; biopsy sensitivity in seronegative patients unknown but likely lower than published figures","evidence_sources":["PMID:18058655","PMID:15185855"]},{"bias_type":"Subjective grading bias vs quantitative measurement","description":"Subjective Marsh-Oberhuber grading misses villous atrophy detected by quantitative Vh:Cd measurement in 77–100% of cases in GFD monitoring patients, demonstrating that the standard reporting method itself is a major source of false negatives. The grading system performs well for severe grades (κ=0.73 for 3C) but marginally better than chance for the grade most relevant to early/mild disease.","magnitude_estimate":"77–100% subjective miss rate for persistent Marsh 3 confirmed by morphometry; κ=0.33 for Marsh 3A vs 0.73 for 3C","evidence_sources":["PMID:24146832"]}],"unproven_assumptions_identified":[{"assumption":"Biopsy is a near-perfect gold standard with negligible false-negative rate for Marsh 3 lesions when guidelines are followed.","evidence_against":"Three independent failure modes (sampling, interpretation, orientation) each contribute 5–25% false-negative rates specifically for Marsh 3A. Quantitative morphometry reveals persistent atrophy in patients graded normal subjectively. Expert re-review reclassifies 20–41% of community readings.","evidence_for":"100% detection demonstrated in seropositive cohorts with rigorous ≥3–5 biopsy protocols including bulb (Hopper 2008). Near-perfect performance at expert centers with optimal protocol.","clinical_impact":"Creates false confidence in negative biopsy results, particularly for seronegative patients where clinical suspicion may be the only driver toward diagnosis. Guideline-adherent practice in expert centers can achieve <5% FN rate, but this does not reflect community reality."},{"assumption":"The three failure modes (sampling, interpretation, orientation) operate independently, allowing multiplicative probability estimation.","evidence_against":"No primary data on interaction effects. A poorly oriented biopsy from a patchy area compounds both sampling and orientation errors simultaneously. Errors may cluster in patients with difficult anatomy or procedures.","evidence_for":"Mechanisms are mechanistically distinct (endoscopic technique vs pathologist judgment vs laboratory processing). Different interventions address each mode.","clinical_impact":"The 20–35% combined false-negative estimate may overestimate or underestimate the true rate depending on error correlations. This is the single most important methodological uncertainty in the synthesis."},{"assumption":"Subjective Marsh-Oberhuber grading is adequate for clinical decision-making at the 3A level.","evidence_against":"κ=0.33 for Marsh 3A; 77–100% miss rate vs quantitative morphometry in treated patients; 46% divergent community vs expert diagnoses; 86% of community reports lack IEL quantification.","evidence_for":"Widely used, requires no special equipment, performs well for severe grades (κ=0.73 for Marsh 3C). Corazza-Villanacci simplification improves κ to 0.55.","clinical_impact":"Milder celiac disease grades—the ones most likely to be seronegative—are also the ones most likely to be misclassified by the standard reporting system, creating a systematic bias against detection of early/mild CD."}],"overlooked_populations":[{"population":"Seronegative celiac patients with patchy Marsh 3A","estimated_size":"6–10% of all celiac patients are truly seronegative; proportion with patchy Marsh 3A unknown but expected higher than seropositive cohorts due to lower mucosal damage severity","why_missed":"Serology-first cascade prevents biopsy referral; when biopsied, patchy distribution, poor orientation, and subjective misclassification each independently reduce detection. Combined cascade detection probability estimated at only 15–25%.","proposed_solution":"Lower threshold for biopsy in clinically suspicious cases regardless of serology; mandatory ≥5–6 biopsies with bulb; quantitative Vh:Cd morphometry; reflexive γδ-IEL IHC for borderline cases."},{"population":"Patients with bulb-restricted villous atrophy (ultra-short celiac disease)","estimated_size":"9% of newly diagnosed, 14% of established celiac patients","why_missed":"Bulb biopsies not routinely taken in many centers; when taken, quadrantic variation means specific positions may miss atrophy (65% sensitivity at 3-o'clock vs 92% at 12-o'clock).","proposed_solution":"Mandatory bulb biopsies from ≥2 quadrants (especially 9- and 12-o'clock positions) per ESsCD 2025 and ACG 2023 guidelines."},{"population":"Patients evaluated by community (non-specialist) pathologists","estimated_size":"Majority of biopsied patients in population-level practice","why_missed":"κ=0.211 community vs expert; IEL counts absent from 86% of community reports; 27% of cases upgraded on re-review; 41% of Marsh 3A called normal.","proposed_solution":"Expert GI pathology review for all ambiguous cases; implementation of CD3 IHC as reflex stain; training in quantitative morphometry; digital pathology consultation networks."},{"population":"Patients with 'potential celiac disease' representing missed Marsh 3A","estimated_size":"Unknown; 100% of seropositive Marsh 0–1 patients developed VA within 1 year on continued gluten in one study","why_missed":"Labeled as 'potential CD' or 'latent CD' when initial biopsy misses patchy 3A. Many may have Marsh 3A at time of initial biopsy but sampling/interpretation failure prevents detection.","proposed_solution":"Repeat enhanced biopsy in all seropositive patients with Marsh 0–2 on initial assessment; consider this a biopsy protocol failure until proven otherwise."}],"diagnostic_step_sensitivity":{"step_name":"Duodenal biopsy for Marsh 3A detection","reported_sensitivity":"Approaching 100% in guideline-compliant seropositive cohorts at expert centers","adjusted_sensitivity":"Stratified: Expert center with optimal protocol (≥6 biopsies + bulb + expert pathologist) = 95–98%; Average hospital with partial adherence (3–4 biopsies, D2 only, general pathologist) = 80–90%; Community practice with suboptimal protocol (1–2 biopsies, D2 only, no IEL count) = 65–80%","false_negative_rate":"20–35% combined in community practice (inferred from component analysis); <5% with ESsCD 2025 optimal protocol; <5% for Marsh 3C regardless of setting","key_limitations":["Patchy lesion distribution requiring bulb-inclusive ≥5–6 biopsy sampling (46.6% inter-site variability, 9% bulb-only)","Interobserver variability at Marsh 2/3A boundary (κ=0.33; κ=0.211 community vs expert)","41% of Marsh 3A called normal at community labs; 86% of reports lack IEL quantification","Orientation artifacts from tangential sectioning (34–58% suboptimal in routine practice; complete grade inversion demonstrated)","Subjective grading missing 77–100% of atrophy detected by quantitative morphometry","Lack of serology-independent validation studies (all sensitivity estimates derived from seropositive cohorts)","Low real-world guideline adherence (35% US, 22% UK baseline for ≥4 biopsies)","No guideline explicitly mandates specialist GI pathology review despite 20–41% diagnostic change rate"]},"contradictory_studies":[{"citation":"Hopper et al. 2008 - Patchy villous atrophy study","pmid":"18058655","finding":"100% detection of villous atrophy with ≥3 biopsies including bulb in seropositive adults (n=53, 95% CI 93.2–100%)","contradicts":"Synthesis estimate of 20–35% false-negative rate — however, this study used optimal protocol with bulb in seropositive cohort at expert center, not representative of real-world community practice or seronegative patients. The confidence interval lower bound (93.2%) actually allows up to 6.8% false-negative rate even in this ideal setting."},{"citation":"Brown et al. 2013 (Modern Pathology) - CD3/CD8 staining study","pmid":null,"finding":"CD3 and CD8 immunohistochemical stains did not improve detection of gluten-sensitive enteropathy in duodenal biopsies","contradicts":"Mubarak et al. 2015 (PMID:26140002) finding that CD3 staining changed diagnosis in 6.3% of pediatric cases. Methodological differences (adult vs pediatric, different staining protocols, different outcome definitions) may explain discrepancy."},{"citation":"Older pre-2010 studies and some current practice","pmid":null,"finding":"Bulb biopsy unnecessary, risky, or adds no diagnostic value due to Brunner's glands and normal architectural variation","contradicts":"Current guidelines (ESsCD 2025, ACG 2023, ESPGHAN 2020) all recommending bulb inclusion, supported by 9% ultra-short CD prevalence and 5–8% incremental yield data."},{"citation":"Studies showing high patchiness rates primarily in pediatric seropositive cohorts","pmid":"20372112","finding":"46.6% inter-site variability in 686 children — but adult seropositive cohort showed 19% (Hopper 2008). Some argue patchiness is overstated in adults with high tTG2 titers where disease tends to be more diffuse.","contradicts":"The generalizability of pediatric patchiness data to adult populations, especially adults with high serological titers. The absolute number of missed Marsh 3A patients in population screening may be smaller than the per-case miss rate suggests if most Marsh 3A occurs in seropositive patients with more diffuse disease."}],"research_gaps":[{"gap":"No study has formally modeled the combined false-negative rate for Marsh 3A across all three failure domains (sampling, interpretation, orientation) in a single cohort, or tested the independence assumption.","importance":"high","proposed_study_design":"Prospective study with ≥9 oriented biopsies from multiple sites, blinded multi-pathologist review with both subjective and quantitative Vh:Cd assessment, in symptomatic patients regardless of serology status. Error interaction analysis to test independence."},{"gap":"Biopsy sensitivity in seronegative or low-pretest-probability patients has never been directly measured. All published sensitivity estimates derive from seropositive cohorts.","importance":"high","proposed_study_design":"Population-based screening study performing duodenal biopsies on all symptomatic patients undergoing endoscopy regardless of serology, with blinded histological and serological analysis."},{"gap":"Real-world diagnostic yield of implementing quantitative morphometry and γδ-IEL IHC in routine clinical practice (outside research settings).","importance":"high","proposed_study_design":"Multicenter pragmatic trial comparing standard H&E subjective grading vs enhanced protocol (quantitative Vh:Cd + reflexive CD3/γδ-IEL IHC) on diagnostic yield, inter-observer agreement, and time/cost."},{"gap":"Specific false-negative rate for Marsh 3A vs 3B/3C in large retrospective cohorts with expert re-review.","importance":"high","proposed_study_design":"Expert re-review of large archived negative/mild biopsies from community hospitals with clinical follow-up and correlation with serological data."},{"gap":"Impact of AI-assisted histopathology on Marsh 3A detection accuracy compared to subjective pathologist grading.","importance":"medium","proposed_study_design":"Diagnostic accuracy study training deep learning models on digitized biopsies with quantitative Vh:Cd ground truth, comparing AI vs pathologist grading for Marsh 3A specifically. Source: Grok 2.4B1."},{"gap":"Interaction effects between the three failure modes — does poor orientation compound sampling error, or are the errors partially redundant?","importance":"medium","proposed_study_design":"Retrospective analysis of multi-biopsy sets with documented orientation quality scores, assessing whether orientation and sampling failures cluster in the same patients."}],"differential_diagnoses_relevant":[{"condition":"NCGS (Non-celiac gluten sensitivity)","overlap_with_cd":"May present with increased IELs (Marsh 1) and symptoms identical to celiac disease; seronegative by definition","distinguishing_features":"No villous atrophy (Marsh 0–1 only); no celiac-specific antibodies; normal γδ-IEL pattern; symptoms resolve on GFD but no mucosal damage progression. Coeliac lymphogram can help distinguish."},{"condition":"Drug-induced enteropathy (especially olmesartan, other ARBs, mycophenolate)","overlap_with_cd":"Can produce Marsh 3A-equivalent villous atrophy with increased IELs; seronegative by definition","distinguishing_features":"Temporal relationship with drug initiation; resolves on drug withdrawal; may lack HLA-DQ2/DQ8; low γδ-IEL density distinguishes from CD (all 12 mimic cases in Popp 2021 had low γδ-IELs). Often more diffuse than celiac patchiness."},{"condition":"Common Variable Immunodeficiency (CVID)","overlap_with_cd":"Can produce villous atrophy and increased IELs; patients may have low IgA confounding serology","distinguishing_features":"Panhypogammaglobulinemia; absent plasma cells on biopsy; recurrent infections; does not respond to GFD. IgG subclass deficiency or low secretory IgA may also affect diagnostic serology."},{"condition":"Autoimmune enteropathy","overlap_with_cd":"Patchy mild-severe villous atrophy with increased IELs","distinguishing_features":"Anti-enterocyte antibodies; multi-organ autoimmunity; often affects stomach and colon; poor response to GFD."},{"condition":"Tropical sprue / post-infectious enteropathy","overlap_with_cd":"Partial villous atrophy, increased IELs","distinguishing_features":"Travel history; tends to affect entire small bowel (not patchy); responds to antibiotics; γδ-IELs not characteristically elevated."},{"condition":"Giardiasis / SIBO","overlap_with_cd":"Mild IEL increase, subtle villous blunting","distinguishing_features":"Parasites identifiable on stain or stool testing; SIBO identifiable on breath testing; resolution with antimicrobial treatment. Low γδ-IEL density."}],"recommendations":[{"recommendation":"Enforce ESsCD 2025 enhanced biopsy protocol: ≥6 biopsies (≥4 from D2 + ≥2 from bulb at 9- or 12-o'clock position), submitted in separate labeled containers, using single-bite forceps with orientation on cellulose acetate filters.","target":"endoscopists, guidelines, quality assurance programs","evidence_basis":"2.6-fold increased detection with ≥4 biopsies (Lebwohl 2011, PMID:21601201); 9–14% bulb-only atrophy (Evans 2011, PMID:21606978); 12 o'clock detects worst atrophy in 92% (Kurien 2012, PMID:22624810); only 35% US compliance. ESsCD 2025 represents current evidence-based optimum."},{"recommendation":"Replace subjective Marsh-Oberhuber subgrading with quantitative Vh:Cd morphometry as the primary histological assessment, or at minimum adopt Corazza-Villanacci simplified classification for routine reporting.","target":"pathologists, guidelines, researchers","evidence_basis":"Subjective assessment misses 77–100% of Marsh 3 lesions detected by quantitative measurement; κ=0.33 for Marsh 3A subjective grading vs excellent reproducibility with morphometry (ICC 0.978, PMID:24146832); Corazza-Villanacci improves κ from 0.35 to 0.55 (PMID:17544877)."},{"recommendation":"Implement reflexive CD3 and/or γδ-IEL immunohistochemistry for all borderline, ambiguous, or negative duodenal biopsies in patients with clinical suspicion of celiac disease.","target":"pathologists, guidelines","evidence_basis":"CD3 changes diagnosis in 6.3% of cases (PMID:26140002); γδ-IEL FFPE IHC achieves 96% sensitivity/95% specificity (PMID:33140183); coeliac lymphogram 93%/98% (PMID:31443602); γδ persists on GFD enabling retrospective diagnosis; low γδ distinguishes mimics from true CD."},{"recommendation":"Mandate specialist GI pathologist review for all duodenal biopsies, or at minimum implement a structured reporting template requiring IEL quantification (>25/100 enterocytes threshold), explicit villous atrophy grading, and orientation quality assessment.","target":"pathology departments, guidelines, quality assurance programs","evidence_basis":"41% of Marsh 3A called normal at community labs; 86% of reports lack IEL quantification; 27% upgraded on expert re-review; κ=0.211 community vs expert (PMID:22081783, PMID:20178253)."},{"recommendation":"Maintain high clinical suspicion and proceed to biopsy in symptomatic patients regardless of negative serology, especially with HLA-DQ2/DQ8 positivity, and use enhanced biopsy protocol when clinical suspicion is high.","target":"clinicians, guidelines","evidence_basis":"IgA-tTG2 sensitivity drops to ~85% for Marsh 3A; 6–10% of celiac patients are truly seronegative; standard cascade misses estimated 75–85% of seronegative Marsh 3A patients. EMA sensitivity only 33% in partial villous atrophy (PMID:15185855)."},{"recommendation":"Lower threshold for repeat enhanced biopsy in patients with persistent clinical suspicion despite initial negative histology, and re-review original slides with expert pathologist before repeating endoscopy.","target":"clinicians","evidence_basis":"50% diagnostic upgrade on repeat biopsy (PMID:21502825); patchy distribution means single negative biopsy does not exclude CD; expert re-review often identifies missed lesions without need for repeat endoscopy."},{"recommendation":"Commission a formal study modeling the combined false-negative rate of the celiac diagnostic cascade for Marsh 3A specifically, including testing the independence assumption for failure modes.","target":"researchers, funding bodies","evidence_basis":"No published study has quantified the multiplicative failure across sampling, interpretation, and orientation domains — this is the single most important research gap for understanding true celiac disease prevalence."}],"meta_analysis_summary":{"studies_reviewed":30,"total_patients":145000,"pooled_estimates":{"marsh_3a_interobserver_kappa":0.33,"marsh_3c_interobserver_kappa":0.73,"marsh_oberhuber_overall_kappa":0.35,"corazza_villanacci_kappa":0.55,"community_vs_expert_kappa":0.211,"community_marsh_3a_called_normal_rate":"41%","expert_rereview_diagnostic_upgrade":"20%","biopsy_adherence_rate_us_4plus":"35%","suboptimal_orientation_rate":"34–58%","inadequate_biopsy_rate":"10.7%","bulb_only_atrophy_newly_diagnosed":"9% (95% CI 7.8–10.9%)","bulb_only_atrophy_established":"14%","bulb_incremental_diagnostic_yield":"5–8%","subjective_vs_morphometry_miss_rate":"77–100%","gamma_delta_iel_ffpe_ihc_sensitivity":"96%","gamma_delta_iel_ffpe_ihc_specificity":"95%","coeliac_lymphogram_pooled_sensitivity":"93%","coeliac_lymphogram_pooled_specificity":"98%","cd3_ihc_additional_diagnoses":"6.3%","diagnostic_upgrade_on_repeat_biopsy":"50%","estimated_marsh_3a_biopsy_fn_rate_community":"20–35%","estimated_marsh_3a_biopsy_fn_rate_expert":"<5%","estimated_seroneg_marsh_3a_cascade_detection":"15–25%"},"heterogeneity_notes":"Studies span pediatric and adult populations, predominantly seropositive cohorts. Patchiness data strongest in pediatrics (Ravelli n=686) than adults (Hopper n=53). Inter-observer studies use 5–6 pathologists with differing expertise. Quantitative morphometry data primarily from clinical trial settings. Combined false-negative estimates are synthesized inferences from component analysis, not directly measured in any single study. The independence assumption for failure modes has not been empirically tested. Sensitivity estimates for seronegative patients are entirely extrapolated, as no biopsy study has been conducted independent of serological selection."},"pmid_verification_notes":{"verified_correct":["PMID:17544877 — Corazza 2007, Clin Gastroenterol Hepatol, interobserver reproducibility ✓","PMID:20372112 — Ravelli 2010, Am J Gastroenterol, patchy villous atrophy pediatric ✓","PMID:21601201 — Lebwohl 2011, Gastrointest Endosc, biopsy guideline adherence ✓","PMID:18058655 — Hopper 2008, Endoscopy, patchy VA adults ✓","PMID:24146832 — Taavela 2013, PLoS One, morphometric validation ✓","PMID:22081783 — Arguelles-Grande 2012, J Clin Pathol, practice setting variability ✓","PMID:20178253 — Pinto Sánchez 2009, Acta Gastroenterol Latinoam, misdiagnosis rate ✓","PMID:22624810 — Kurien 2012, Gastrointest Endosc, bulb biopsy site ✓","PMID:21606978 — Evans 2011, Am J Gastroenterol, bulb biopsy prospective ✓","PMID:21502825 — Webb 2011, J Pediatr Gastroenterol Nutr, biopsy process accuracy ✓","PMID:26140002 — Mubarak 2015, World J Gastroenterol, CD3 IHC additional diagnoses ✓","PMID:33140183 — Popp/Viiri 2021, Dig Dis Sci, γδ-IEL H-41 FFPE marker ✓ (via web search)","PMID:31443602 — Fernández-Bañares 2019, Nutrients, γδ+coeliac lymphogram meta-analysis ✓","PMID:32048756 — Fernández-Bañares 2020, Aliment Pharmacol Ther, γδ in seronegative VA ✓"],"errors_found_in_source_outputs":["PMID:31759805 cited as 'Daveson 2020 morphometry' in Opus 2.4B2 — INCORRECT: actually Smith 2019, Am J Prev Med, text message physical activity meta-analysis. Correct Daveson reference not found in PubMed; may be conference abstract or cited under different first author.","PMID:34630355 cited as 'Viiri 2021 γδ-IEL' in Opus 2.4B2 — INCORRECT: actually Liu 2021, Front Microbiol, E. coli in raw milk. Correct PMID is 33140183 (Popp et al. 2021, Dig Dis Sci).","PMID:26195541 cited as 'Mubarak 2015 CD3' in Opus 2.4B2 — INCORRECT: actually Taylor 2015, Pediatrics, childhood obesity RCT. Correct PMID is 26140002.","PMID:31396150 cited as 'coeliac lymphogram meta-analysis' in Opus 2.4B2 — INCORRECT: actually DeMatteo 2019, Front Neurol, concussion return-to-school. Correct PMID is 31443602.","κ≈0.49 reported in Grok 2.4B1 — INCORRECT: the Corazza 2007 study reports κ=0.35 overall for Marsh-Oberhuber. The 0.49 figure does not appear in this paper and may represent a conflation with a different study or the midpoint between Marsh-Oberhuber (0.35) and Corazza-Villanacci (0.55)."]}}
