{"research_topic_id":"3.10","research_topic_title":"Celiac Disease / Irritable Bowel Syndrome Diagnostic Overlap","date_completed":"2026-02-08","executive_summary":"Biopsy-confirmed CD prevalence in IBS cohorts is approximately 2% (95% CI 2–3%) per the 2025 Shiha meta-analysis (29 studies, 7,209 patients), representing a 4–5-fold enrichment over general population risk, though with marked geographic heterogeneity (North American community-based 0.4–1.5%, UK/Northern European secondary care 3–5%, Middle Eastern/South Asian referral centers 5–15%). Despite near-unanimous guideline recommendations, only 2.7% of US IBS patients receive CD serology testing, and 15% of those who test seropositive never proceed to confirmatory biopsy — creating a compounding cascade of missed diagnoses. All prevalence estimates inherit verification bias because only seropositive patients are typically biopsied; the three studies performing universal biopsy yield contradictory results, and no cost-effectiveness model accounts for seronegative CD.","key_findings":[{"finding_id":"3.10.1","finding":"Biopsy-confirmed CD is 4–5× more prevalent in IBS cohorts than in the general population, with marked geographic heterogeneity. The 2025 Shiha et al. global meta-analysis (PMID: 40493044) provides the most current pooled estimate at 2% biopsy-proven prevalence. Older meta-analyses (Ford 2009, Irvine/Chey/Ford 2017) reported higher figures (~4%) but were driven by European/Middle Eastern referral-center studies. North American community-based studies (Cash 2011, Locke 2004) show minimal or no enrichment (0.4–1.5%), while UK secondary care and Middle Eastern/South Asian referral centers show 3–15%.","evidence_strength":"strong","quantitative_estimate":"Pooled biopsy-proven prevalence 2% (95% CI 2–3%); seroprevalence 6% (95% CI 5–8%); OR 4.42 (95% CI 2.82–6.92) vs controls. IBS-D subtype shows highest enrichment: ~5.4% (95% CI 3.3–7.8%) in the 2017 meta-analysis.","confidence_interval":"95% CI 2–3% (biopsy-proven); 95% CI 5–8% (seroprevalence)","key_citations":["PMID:40493044","PMID:19364994","PMID:27753436","PMID:21762658","PMID:21468583","PMID:11705563"],"contradicts_guidelines":false,"affected_patient_population":"Patients diagnosed with IBS using Rome III/IV symptom-based criteria, with strongest enrichment in IBS-D subtype"},{"finding_id":"3.10.2","finding":"Only 2.7% of IBS patients in the largest US practice audit (141,295 patients, Kaiser Permanente) ever had CD serology performed. Even at Mayo Clinic, only 27% of IBS patients had prior CD testing. Internists make 68% of IBS diagnoses but rarely order celiac-specific serology. Additionally, the 2025 meta-analysis found that 15% (95% CI 6–24%) of IBS patients who tested seropositive for CD never proceeded to confirmatory biopsy — meaning the diagnostic cascade fails at both the screening and confirmation steps.","evidence_strength":"strong","quantitative_estimate":"2.7% testing rate (US primary care); 27% (Mayo Clinic); 15% seropositive-but-never-biopsied dropout rate","confidence_interval":"95% CI 6–24% for biopsy dropout among seropositives","key_citations":["PMID:22210469","PMC5738260","PMID:40493044"],"contradicts_guidelines":true,"affected_patient_population":"All IBS patients, particularly those diagnosed in primary care"},{"finding_id":"3.10.3","finding":"Cost-effectiveness analyses unanimously support CD screening in IBS at prevalences >1%. ICERs range from $7,400–$11,000/QALY (US) and €6,200/QALY (Netherlands). NNT to identify one CD case is ~25–30 IBS patients. Screening becomes cost-saving (dominant) when CD prevalence exceeds 8%. These figures compare favorably with accepted screening programs (colorectal cancer screening costs $261–$4,777/QALY). However, no existing cost-effectiveness model accounts for seronegative CD — all assume IgA-tTG2 sensitivity of 93–98%, meaning all models underestimate the benefit of biopsy-inclusive strategies.","evidence_strength":"moderate","quantitative_estimate":"ICER $7,400–$11,000/QALY; NNT ~25–30; cost per CD case detected $375–$1,250","confidence_interval":null,"key_citations":["PMID:15188167","PMID:15153173","PMID:23179163","PMID:36321689"],"contradicts_guidelines":false,"affected_patient_population":"IBS-D and IBS-M patients; most cost-effective in populations with CD prevalence >1%"},{"finding_id":"3.10.4","finding":"Approximately 38% of all CD patients (95% CI 27–50%) report IBS-type symptoms, with 20–23% of GFD-adherent patients meeting formal Rome IBS criteria. Multiple overlapping mechanisms explain persistence: inadvertent gluten exposure (48% of GFD-adherent adults have detectable fecal/urine GIP), persistent villous atrophy (18–53% depending on study/timeframe), SIBO (18–28% prevalence, OR 5.1), bile acid malabsorption (~35%), pancreatic exocrine insufficiency (8–28%), microscopic colitis (4–6%, 70-fold increased risk), visceral hypersensitivity (36% by rectal balloon distension), and FODMAP sensitivity (RCT-confirmed benefit of low-FODMAP GFD).","evidence_strength":"strong","quantitative_estimate":"Pooled IBS-type symptom prevalence 38% (95% CI 27–50%); OR 5.60 vs controls; 20–23% meet Rome criteria among adherent patients","confidence_interval":"95% CI 27–50%","key_citations":["PMID:23246645","PMID:32217152","PMID:33491958","PMID:35734803","PMID:35051648","PMID:12738465"],"contradicts_guidelines":false,"affected_patient_population":"Treated CD patients on GFD"},{"finding_id":"3.10.5","finding":"NCGS as a distinct gluten-driven entity is increasingly undermined by DBPC trial evidence. Meta-analysis of 10 DBPC trials shows only 16% of self-reported NCGS patients have gluten-specific symptoms; 40% show nocebo responses. Skodje et al. (2018) demonstrated fructans — not gluten — drove symptoms (GSRS-IBS scores: fructan 38.6, gluten 33.1, placebo 34.3). Biesiekierski, who conducted the original 2011 trial establishing NCGS, has subsequently moved toward characterizing NCGS as part of the gut-brain interaction spectrum. Wheat ATIs activating TLR4-mediated innate immunity and fructan-driven osmotic/fermentative effects likely explain most 'gluten sensitivity' in non-CD patients.","evidence_strength":"moderate","quantitative_estimate":"Only 16% gluten-specific response; 40% nocebo rate in DBPC trials","confidence_interval":null,"key_citations":["PMID:29102613","PMID:23583460","PMID:27523634","PMID:23209317"],"contradicts_guidelines":false,"affected_patient_population":"Patients self-reporting gluten sensitivity without CD; significant overlap with IBS"},{"finding_id":"3.10.6","finding":"Three shared pathophysiological pathways connect CD, NCGS, and IBS: (1) Barrier dysfunction via gliadin–CXCR3–zonulin pathway operates across all three conditions with graded severity (serum zonulin: CD 0.033, NCGS 0.030, IBS-D 0.012, controls 0.007 ng/mg); (2) Innate immune activation — CD drives adaptive immunity (IFN-γ, IL-21, IL-17A) while NCGS/IBS involve innate immunity (TLR1/2/4 upregulation, mast cell hyperplasia); (3) Dysbiosis with reduced Bifidobacterium across all three conditions. IBS patients carrying HLA-DQ2/DQ8 (~50%) show increased small bowel permeability on gluten challenge (Vazquez-Roque). Wahnschaffe et al. found that 30% of IBS-D patients had positive intestinal mucosal anti-tTG antibodies in duodenal aspirate despite negative serum IgA-tTG2 — demonstrating active mucosal autoimmune activity invisible to serum serology.","evidence_strength":"moderate","quantitative_estimate":"30% mucosal antibody positivity in IBS-D with negative serum serology (Wahnschaffe); ~50% of IBS patients carry HLA-DQ2/DQ8","confidence_interval":null,"key_citations":["PMID:21392369","PMID:20145412","PMID:16635908","PMID:27459152","PMID:36647022","PMID:19183150"],"contradicts_guidelines":false,"affected_patient_population":"IBS-D patients, particularly HLA-DQ2/DQ8 carriers"},{"finding_id":"3.10.7","finding":"No symptom reliably distinguishes IBS from undiagnosed CD. Weight loss is present in only 25.2% of newly diagnosed CD adults; average BMI at diagnosis is now overweight. Non-classical presentations now exceed classical presentations. Among first-degree relatives with screen-detected CD, 28% had no symptoms and 68% had only atypical symptoms. Nutritional deficiencies represent the single most reliable distinguishing feature (zinc deficiency 59.4%, iron deficiency anemia up to 81.5%, B12 deficiency 8–41%), as IBS does not cause malabsorption. The average diagnostic delay for CD patients initially misdiagnosed with IBS is 9.7–13 years. Card et al. found 16% of CD patients had a prior formal IBS diagnosis (28% including IBS treatment codes), with excess IBS diagnoses present >10 years before CD diagnosis.","evidence_strength":"strong","quantitative_estimate":"9.7–13 year diagnostic delay; 16–28% prior IBS diagnosis/treatment in CD patients","confidence_interval":null,"key_citations":["PMID:23697749","PMID:30846842"],"contradicts_guidelines":false,"affected_patient_population":"CD patients presenting with IBS-like symptoms, particularly those without classic diarrheal presentation"},{"finding_id":"3.10.8","finding":"Self-initiated GFD before testing creates a growing cohort of effectively undiagnosable patients. An estimated 82% of patients referred for NCGS evaluation have already initiated GFD before medical advice. IgA-tTG2 titers drop ~50% within 30–60 days of GFD; by 12 months 67% normalize, by 24 months 90% are negative. Gluten challenge protocols (3–6g/day for 12+ weeks) are frequently refused. This creates a permanent diagnostic blind spot that compounds the existing CD-IBS overlap.","evidence_strength":"moderate","quantitative_estimate":"82% pre-initiated GFD; 50% titer drop in 30–60 days; 90% seronegative by 24 months on GFD","confidence_interval":null,"key_citations":["PMID:26096570"],"contradicts_guidelines":false,"affected_patient_population":"Patients self-experimenting with GFD, particularly those subsequently found to have IBS/NCGS overlap"}],"biases_documented":[{"bias_type":"verification bias (serology-first gating)","description":"Nearly all CD prevalence studies in IBS use serology as the gateway to biopsy: only seropositive patients are biopsied, preventing detection of seronegative CD. Of the studies in major meta-analyses, only three (Sanders 2001, El-Salhy 2011, and one Iranian study) biopsied all patients regardless of serology. Sanders found 3/14 (21%) CD cases were EMA-negative — but this used EMA (sensitivity ~85–90%), not IgA-tTG2 (sensitivity ~93–95%), so some of those 3 might have been IgA-tTG2-positive. With only n=3 seronegative cases, the 95% CI around '21%' is approximately 5–51%, making this point estimate too imprecise to anchor a prevalence adjustment. Wahnschaffe's finding of 30% mucosal anti-tTG positivity in seronegative IBS-D patients provides stronger biological evidence that mucosal autoimmunity can exist without seroconversion.","magnitude_estimate":"Potentially 10–30% underestimate of true CD prevalence in serology-gated studies, but magnitude is genuinely uncertain. Sanders suggests 21% (but n=3, EMA not tTG2, 95% CI 5–51%). El-Salhy's universal-biopsy study found LOWER CD prevalence than meta-analytic average, suggesting referral/selection bias may inflate estimates more than verification bias deflates them.","evidence_sources":["PMID:11705563","PMID:21468583","PMID:40493044","Wahnschaffe et al."]},{"bias_type":"referral/selection bias","description":"Meta-analytic prevalence estimates are driven disproportionately by European and Middle Eastern/South Asian referral-center studies, which enrich for more severe or complex presentations. North American community-based studies consistently show minimal or no CD enrichment in IBS. The 2025 Shiha meta-analysis (pooled biopsy prevalence 2%) represents a downward revision from older estimates (~4%), partly because it includes more geographic diversity. The commonly cited '4–16% range' collapses geographically heterogeneous data into a misleading single figure.","magnitude_estimate":"Explains most of the difference between older ~4% pooled estimates and newer ~2% pooled estimates. North American community-based prevalence may not significantly exceed general population CD prevalence (0.4–1.5% vs ~1%).","evidence_sources":["PMID:40493044","PMID:21762658","PMID:27753436"]},{"bias_type":"biopsy confirmation dropout","description":"The 2025 meta-analysis found that 15% (95% CI 6–24%) of IBS patients who tested seropositive for CD never proceeded to confirmatory biopsy. This means the diagnostic cascade fails not only at the screening step (97% never tested) but also at the confirmation step (15% of those with positive serology never biopsied). This creates a diagnosed-but-abandoned population that inflates seroprevalence relative to biopsy-proven prevalence.","magnitude_estimate":"Seroprevalence 6% (95% CI 5–8%) vs biopsy-proven prevalence 2% (95% CI 2–3%) — the 3:1 ratio partly reflects biopsy dropout","evidence_sources":["PMID:40493044"]},{"bias_type":"implementation gap (testing rate bias)","description":"The 2.7% testing rate in US primary care creates a massive ascertainment gap. IBS is diagnosed predominantly by PCPs (68% of diagnoses per Ladabaum), but CD is not on most primary care differential checklists for abdominal pain. Rome criteria framing IBS as a 'positive symptom-based diagnosis' may paradoxically discourage exclusion testing. No automated clinical decision support embeds IgA-tTG2 ordering into IBS diagnostic pathways in most EHR systems. This is primarily an implementation science problem, not a knowledge gap.","magnitude_estimate":"97.3% of IBS patients in the largest US audit never tested for CD","evidence_sources":["PMID:22210469","PMC5738260"]}],"unproven_assumptions_identified":[{"assumption":"Symptom-based Rome IV IBS diagnosis is safe without mandatory CD exclusion","evidence_against":"4–5-fold higher CD prevalence in IBS cohorts; 16–28% of CD patients had prior IBS diagnosis/treatment >10 years before CD diagnosis (Card et al.); 2025 Shiha meta-analysis explicitly concludes positive IBS diagnosis should not be made without CD exclusion","evidence_for":"Low absolute biopsy-proven prevalence (2%) in most settings; North American community studies show minimal enrichment; IBS-C shows least CD enrichment","clinical_impact":"Delayed or missed CD diagnosis leading to 9.7–13 years of ongoing mucosal damage, excess healthcare costs ($4,000+ per 4 years), and risk of irreversible complications (osteoporosis, lymphoma, infertility)"},{"assumption":"Uniform global enrichment of CD in IBS justifies universal screening","evidence_against":"Marked geographic variation: North American community-based studies show 0.4–1.5% CD prevalence in IBS, not clearly elevated above general population. Cash (2011) found 0.41% in 492 US IBS patients. 2025 meta-analysis pooled prevalence only 2%.","evidence_for":"Cost-effectiveness demonstrated at >1% prevalence; all major Western guidelines recommend screening for IBS-D/M; referral-center studies consistently show 3–15%","clinical_impact":"Risk of over-testing in low-prevalence North American community settings vs missed diagnoses in higher-risk referral settings. However, even 1% prevalence exceeds cost-effectiveness threshold."},{"assumption":"IgA-tTG2 negative result reliably excludes CD in IBS populations","evidence_against":"Sanders: 21% of CD cases in IBS were EMA-negative (though using EMA, not IgA-tTG2, and n=3). Wahnschaffe: 30% of IBS-D patients had positive mucosal anti-tTG antibodies despite negative serum IgA-tTG2. Abrams: EMA sensitivity only 33% for partial villous atrophy vs 77% for total VA. Sensitivity estimates are circularly validated in serology-first cohorts.","evidence_for":"El-Salhy biopsied 968 IBS-D patients universally and found no hidden seronegative reservoir (CD prevalence 0.4%). Guideline-reported sensitivity 93–98% in established cohorts. Seronegative CD may represent <2% of all CD cases by conventional estimates.","clinical_impact":"If true sensitivity in unselected IBS populations is lower than guideline figures, a significant fraction of CD cases are missed even when screening is performed. Particularly affects patients with milder histology (Marsh 3A), DQ8 genotype, or immunoglobulin abnormalities."}],"overlooked_populations":[{"population":"IBS patients never tested for CD (97.3% in US primary care)","estimated_size":"Tens of millions globally. IBS affects ~11% of the global population; CD affects ~1% of the general population and ~2% of IBS cohorts. If ~30–40 million IBS patients exist in North America/Europe combined and 97% are untested, ~600,000–800,000 may have undiagnosed CD.","why_missed":"Rome IV criteria are purely symptom-based; no mandatory exclusion testing. IBS diagnosed predominantly by PCPs who rarely order celiac-specific serology. No automated CDS in EHR systems.","proposed_solution":"Embed IgA-tTG2 (with total IgA) as an automated order in IBS diagnostic pathways. Implement AGA 2025 Quality Indicators tied to reimbursement/accreditation. Minimum: mandatory testing in IBS-D and IBS-M before finalizing diagnosis."},{"population":"Seronegative CD patients presenting as treatment-resistant IBS (including reference patient profile: DQ8, Marsh 3A, IgA-tTG2 <1, anti-DGP IgG <1, low IgG1, low secretory IgA)","estimated_size":"Unknown. Conventional estimates place seronegative CD at 1.5–6% of all CD. However, Wahnschaffe's finding of 30% mucosal antibody positivity in IBS-D patients with negative serum serology suggests a larger subclinical population may exist. Sanders found 21% seronegative rate in IBS-associated CD (but n=3, wide CI).","why_missed":"Serology-first diagnostic algorithms preclude biopsy in seronegative patients. Low IgG1 subclass impairs mucosal IgA production via sequential IgM→IgG1→IgA class switching (Siniscalco 2025), creating a mechanistic bottleneck independent of HLA. DQ8-associated CD may generate weaker antibody responses than DQ2.5-associated CD (unstudied). Even if endoscopy is performed for 'IBS,' routine duodenal biopsies are not universally taken when the indication is 'IBS' rather than 'suspected CD.' Note: seronegative villous atrophy has a differential diagnosis including drug-induced enteropathy (olmesartan), autoimmune enteropathy, CVID-associated enteropathy, tropical sprue, and giardiasis — these must be excluded before attributing Marsh 3A to seronegative CD.","proposed_solution":"Protocol duodenal biopsies (≥4 from D2 + ≥1 from bulb per ESPGHAN) in persistent IBS-D/M with risk factors (nutritional deficiencies, family history, HLA-DQ2/DQ8 positivity, IgG subclass abnormalities) despite negative serology. Consider mucosal antibody testing (intestinal anti-tTG) if available."},{"population":"Seropositive IBS patients who never proceed to confirmatory biopsy","estimated_size":"15% (95% CI 6–24%) of seropositive IBS patients in the 2025 meta-analysis were never biopsied","why_missed":"Biopsy dropout after positive serology — reasons likely include patient refusal, clinician uncertainty about next steps, and system-level barriers to endoscopy scheduling","proposed_solution":"Integrate positive serology into automatic endoscopy referral pathways; track biopsy completion as a quality metric alongside serology ordering"},{"population":"Patients who self-initiated GFD before testing, rendering serology unreliable","estimated_size":"82% of patients referred for NCGS evaluation had already started GFD. Growing cultural normalization of GFD means this population is expanding rapidly.","why_missed":"IgA-tTG2 drops ~50% within 30–60 days of GFD; 90% normalize by 24 months. Gluten challenge protocols are unpleasant and frequently refused.","proposed_solution":"Clinical education: test before dietary modification. HLA typing as a rule-out (negative DQ2/DQ8 effectively excludes CD regardless of diet). When HLA is positive and serology is unreliable, consider biopsy after adequate gluten challenge (≥3g/day for ≥2 weeks for histology, ≥6 weeks for serology)."}],"diagnostic_step_sensitivity":{"step_name":"IgA-tTG2 serology as screening test for CD in IBS populations","reported_sensitivity":"93–98% (guideline figures, derived primarily from Marsh 3b/3c populations identified via serology-first protocols in tertiary centers)","adjusted_sensitivity":"Unknown true sensitivity in unselected IBS populations. Likely lower for milder histological disease: EMA sensitivity drops to 33% for partial villous atrophy vs 77% for total VA (Abrams et al.). Sanders found 21% EMA-negative rate in IBS-associated CD (n=14, but using EMA not IgA-tTG2). No study has calculated IgA-tTG2 sensitivity stratified by HLA-DQ subtype or by Marsh grade in unselected IBS populations.","false_negative_rate":"Unknown true rate. Guideline estimates imply 2–7% false negative rate. Real-world rate in IBS populations likely higher due to: (a) verification bias in validation studies, (b) milder histological disease (Marsh 3A) more common in screening-detected CD, (c) potential HLA-DQ subtype variation (DQ8 vs DQ2.5), (d) IgG subclass deficiencies impairing mucosal IgA production.","key_limitations":["Circular validation: sensitivity calculated in populations identified by serology — seronegative CD excluded by design","EMA sensitivity only 33% for partial villous atrophy (Abrams) — IgA-tTG2 may show similar Marsh-grade dependence but less studied","No sensitivity stratification by HLA-DQ subtype (DQ8 vs DQ2.5 vs DQ2.2)","No biopsy-independent validation in IBS populations specifically","Serology normalizes rapidly on GFD (50% drop in 30–60 days), creating false negatives in self-treated patients","IgA deficiency (~2–3% of CD patients) causes false-negative IgA-based tests; not always checked alongside IgA-tTG2","IgA-tTG2 is a poor surrogate for mucosal healing — sensitivity <50% for detecting persistent villous atrophy on follow-up (Silvester 2017)"]},"contradictory_studies":[{"citation":"Shiha et al. 2025 global meta-analysis","pmid":"40493044","finding":"Pooled biopsy-proven CD prevalence in IBS only 2% (95% CI 2–3%), significantly lower than older meta-analytic estimates of ~4%. Recommends against positive IBS diagnosis without CD exclusion.","contradicts":"Older meta-analyses (Ford 2009 at 4.1%, Irvine/Chey/Ford 2017 at ~3.3%) and the commonly cited '4–16% range'. Also contradicts Rome IV diagnostic algorithm which is purely symptom-based without organic exclusion."},{"citation":"Cash et al. 2011","pmid":"21762658","finding":"CD prevalence of only 0.41% in 492 US nonconstipated IBS patients — identical to controls. No serological excess.","contradicts":"Meta-analytic consensus of 4–5× enrichment. Note: Cash enrolled nonconstipated IBS (IBS-D + IBS-M combined), not IBS-D alone, potentially diluting the IBS-D-specific signal where enrichment is strongest."},{"citation":"El-Salhy et al. 2011","pmid":"21468583","finding":"Universal biopsy of 968 IBS-D patients found CD in only 0.4% — below Norwegian population prevalence. No hidden seronegative CD reservoir detected.","contradicts":"Hypothesis that verification bias conceals substantial seronegative CD in IBS populations. However, biopsy protocol details (number of biopsies, bulb inclusion, pathologist blinding, Marsh threshold) are not fully documented and may affect detection sensitivity."},{"citation":"Sanders et al. 2001 (Lancet)","pmid":"11705563","finding":"Universal biopsy of IBS patients found CD prevalence of 4.6%, with 3/14 (21%) CD cases EMA-negative — i.e., would have been missed by serology-only screening.","contradicts":"Assumption that serology captures >95% of CD cases. Note: used EMA (sensitivity ~85–90%), not IgA-tTG2 (~93–95%). Sample of n=3 seronegative cases gives 95% CI of 5–51% for the seronegative proportion. Small sample limits generalizability."},{"citation":"Wahnschaffe et al.","pmid":null,"finding":"In 102 IBS-D patients with universal duodenal biopsy, none had elevated serum IgA-tTG2, yet 30% had positive intestinal CD-associated antibodies in duodenal aspirate, 35% were HLA-DQ2.5-positive, and 23% had elevated IELs. Demonstrates mucosal autoimmune activity invisible to serum serology.","contradicts":"Assumption that negative serum IgA-tTG2 excludes mucosal anti-tTG activity. Supports the project hypothesis that serology reflects mucosal damage severity rather than disease presence/absence."},{"citation":"Skodje et al. 2018","pmid":"29102613","finding":"Fructans — not gluten — drove symptoms in self-reported NCGS: fructan challenge GSRS-IBS 38.6 vs gluten 33.1 vs placebo 34.3.","contradicts":"NCGS as a distinct gluten-driven entity. Suggests most 'gluten sensitivity' is fructan/FODMAP sensitivity within the IBS spectrum."}],"research_gaps":[{"gap":"No large prospective study performing protocol-driven duodenal biopsy (≥4 from D2 + ≥1 from bulb, blinded pathologist) independent of serology in contemporary Rome IV IBS-D cohorts across geographic regions — the only way to determine true seronegative CD prevalence in IBS","importance":"high","proposed_study_design":"Prospective multicenter cohort (North America, Europe, Asia): IgA-tTG2 + total IgA + anti-DGP IgG + HLA-DQ typing + protocol duodenal biopsies in consecutive Rome IV IBS-D/M patients regardless of serology result. Biopsies read by blinded pathologist using standardized Marsh criteria including Marsh 3A. Minimum n=2,000 per region."},{"gap":"IgA-tTG2 sensitivity has never been stratified by HLA-DQ subtype (DQ2.5 vs DQ2.2 vs DQ8 vs half-DQ2) or by Marsh grade in unselected symptomatic populations","importance":"high","proposed_study_design":"Nested within the above biopsy-independent study: calculate serology sensitivity by HLA subtype and Marsh grade. Requires sufficient DQ8-positive CD cases (likely n≥50) for meaningful subgroup analysis."},{"gap":"Updated real-world data on CD serologic testing rates in IBS patients post-2020, particularly after AGA 2025 Quality Indicators publication","importance":"high","proposed_study_design":"Electronic health record audit in large US/European healthcare systems, comparing pre-2025 and post-2025 testing rates. Measure: proportion of new IBS diagnoses preceded by IgA-tTG2 order."},{"gap":"No cost-effectiveness model accounts for seronegative CD or compares serology-only vs routine biopsy strategies in IBS patients undergoing endoscopy","importance":"high","proposed_study_design":"Decision-analytic model incorporating: (a) sensitivity adjustment for seronegative CD, (b) incremental cost of routine duodenal biopsies during diagnostic endoscopy for IBS, (c) long-term complication costs of missed seronegative CD."},{"gap":"No IBS-D-specific CD prevalence estimate exists for North American populations. Cash (2011) enrolled nonconstipated IBS (IBS-D + IBS-M), potentially diluting the IBS-D signal.","importance":"medium","proposed_study_design":"Prospective cohort screening consecutive Rome IV IBS-D patients (excluding IBS-M) in US community settings with IgA-tTG2 + biopsy."},{"gap":"El-Salhy (2011) — the largest universal-biopsy IBS study — has unverified biopsy protocol details (number of biopsies per site, bulb inclusion, pathologist blinding, Marsh threshold). These details critically affect detection sensitivity for milder/patchy disease.","importance":"medium","proposed_study_design":"Methodological audit of El-Salhy biopsy protocol; if inadequate, a replication study with ESPGHAN-compliant biopsy protocol (≥4 D2 + ≥1 bulb)."},{"gap":"Impact of automated clinical decision support (CDS) for IgA-tTG2 ordering in IBS diagnostic pathways on testing rates and CD detection","importance":"medium","proposed_study_design":"Cluster-randomized implementation trial: EHR-embedded automatic IgA-tTG2 order suggestion at IBS diagnosis vs usual care. Primary outcome: proportion of IBS patients tested; secondary: CD cases detected, time to diagnosis."},{"gap":"Validation of mucosal anti-tTG antibody testing (intestinal aspirate) as a diagnostic tool for seronegative CD in IBS populations","importance":"medium","proposed_study_design":"Prospective study collecting duodenal aspirate alongside standard biopsies in IBS-D patients with negative serum serology, correlating mucosal antibody status with histology and clinical outcomes."}],"differential_diagnoses_relevant":[{"condition":"Non-celiac gluten/wheat sensitivity (NCGS)","overlap_with_cd":"High symptom overlap (pain, bloating, altered bowel habits); subset improve on GFD; ~50% of NCGS patients carry HLA-DQ2/DQ8. No validated biomarker exists for NCGS. Likely overlaps substantially with fructan-sensitive IBS.","distinguishing_features":"Negative IgA-tTG2/EMA serology AND normal/non-atrophic duodenal histology (may have Marsh 0–1 but not Marsh 3). Innate rather than adaptive immune activation (TLR1/2/4 vs IFN-γ/IL-21). Symptom improvement may reflect fructan avoidance rather than gluten avoidance. Salerno criteria (DBPC crossover challenge) rarely applied clinically."},{"condition":"IBS (functional, without CD or NCGS)","overlap_with_cd":"Identical symptom profile (abdominal pain, bloating, altered bowel habits). Low-grade mucosal inflammation present in ~30% of IBS patients (mast cell hyperplasia, mild IEL elevation). 50% carry HLA-DQ2/DQ8. Visceral hypersensitivity present in both.","distinguishing_features":"No villous atrophy (Marsh 0–1 maximum). No adaptive autoimmune response. No nutritional deficiencies (IBS does not cause malabsorption). Normal IgA-tTG2. However, none of these features are 100% discriminating in individual patients."},{"condition":"Functional IBS overlapping treated CD","overlap_with_cd":"20–38% of treated CD patients meet Rome IBS criteria despite GFD and (in some) mucosal healing. Visceral hypersensitivity may become self-sustaining after years of mucosal inflammation.","distinguishing_features":"Normal follow-up histology and serology; multifactorial etiology (FODMAP sensitivity, SIBO, bile acid malabsorption, visceral hypersensitivity, persistent low-grade inflammation). Requires systematic exclusion of ongoing gluten exposure, persistent villous atrophy, and overlapping conditions."},{"condition":"IgA deficiency with false-negative serology","overlap_with_cd":"Selective IgA deficiency occurs in 2–3% of CD patients (10–15× general population rate). Renders all IgA-based tests (IgA-tTG2, IgA-EMA) falsely negative.","distinguishing_features":"Total serum IgA <7 mg/dL. Must use IgG-based tests (IgG-DGP, IgG-tTG2). Guidelines mandate total IgA measurement alongside IgA-tTG2 — but this is not always performed in practice."},{"condition":"Drug-induced enteropathy (olmesartan, mycophenolate, methotrexate)","overlap_with_cd":"Can cause villous atrophy (Marsh 3) indistinguishable from CD on histology. Seronegative. Presents with diarrhea, weight loss, malabsorption.","distinguishing_features":"Temporal relationship to drug initiation. Resolution on drug withdrawal. No HLA-DQ2/DQ8 requirement. Must be considered in differential diagnosis of seronegative villous atrophy — directly relevant to reference patient profile."},{"condition":"Autoimmune enteropathy","overlap_with_cd":"Villous atrophy, malabsorption, diarrhea. Seronegative for CD-specific antibodies.","distinguishing_features":"Anti-enterocyte or anti-goblet cell antibodies. More severe/diffuse atrophy. Often associated with other autoimmune conditions. Poor response to GFD. Must be excluded in seronegative villous atrophy."},{"condition":"Common variable immunodeficiency (CVID) enteropathy","overlap_with_cd":"Villous atrophy, intraepithelial lymphocytosis, malabsorption, diarrhea. Seronegative (by definition — CVID impairs antibody production globally).","distinguishing_features":"Low total immunoglobulins (IgG, IgA, IgM). Recurrent infections. Nodular lymphoid hyperplasia on biopsy. Directly relevant to reference patient with low IgG1 subclass."},{"condition":"Microscopic colitis","overlap_with_cd":"Chronic watery diarrhea. Co-occurs with CD in 4–6% of cases (70-fold increased risk). May explain persistent symptoms in treated CD patients.","distinguishing_features":"Colonic (not small bowel) pathology — requires colonic biopsies. Normal endoscopic appearance but abnormal histology (collagenous or lymphocytic). Responds to budesonide."},{"condition":"SIBO","overlap_with_cd":"Bloating, diarrhea, malabsorption. Prevalence 18–28% in treated CD patients (OR 5.1). Can cause secondary villous atrophy.","distinguishing_features":"Diagnosed by glucose/lactulose breath test or duodenal aspirate culture. Responds to antibiotics (rifaximin). May coexist with CD rather than being a differential."}],"recommendations":[{"recommendation":"Perform IgA-tTG2 (with total IgA) serology in all patients meeting Rome IV criteria for IBS-D or IBS-M before finalizing IBS diagnosis. Consider extending to IBS-C in populations with high CD prevalence.","target":"clinicians, guidelines","evidence_basis":"ACG 2021, AGA 2019, BSG 2021, NICE 2017 all recommend; 4–5× prevalence enrichment; cost-effective at >1% prevalence (ICER $7,400–$11,000/QALY); NNT ~25–30. 2025 Shiha meta-analysis explicitly recommends against positive IBS diagnosis without CD exclusion."},{"recommendation":"Embed IgA-tTG2 as an automated order in EHR IBS diagnostic pathways and tie CD testing completion to quality metrics with reimbursement/accreditation consequences.","target":"health systems, implementation scientists","evidence_basis":"Current 2.7% testing rate represents an implementation science failure, not a knowledge gap. Quality indicators for other conditions (hepatitis C screening, colonoscopy quality) have dramatically improved compliance when tied to accountability. AGA 2025 Quality Indicators provide a starting framework."},{"recommendation":"Update Rome diagnostic algorithm to require exclusion of CD in diarrhea-predominant presentations before assigning a positive IBS diagnosis.","target":"Rome Foundation, international guideline committees","evidence_basis":"2025 Shiha meta-analysis conclusion; 9.7–13 year diagnostic delay for CD patients initially misdiagnosed with IBS; Rome IV symptom criteria cannot distinguish IBS from untreated CD."},{"recommendation":"In persistent IBS-D/M with negative serology but additional risk factors (unexplained nutritional deficiencies, family history of CD, HLA-DQ2/DQ8 positivity, IgG subclass abnormalities), perform diagnostic upper endoscopy with protocol duodenal biopsies (≥4 from D2 + ≥1 from bulb, blinded pathologist).","target":"clinicians","evidence_basis":"Serology sensitivity for milder histological disease (Marsh 3A) and in atypical immunological profiles (low IgG1, DQ8) is unknown but likely lower than guideline figures. Wahnschaffe demonstrates mucosal autoimmune activity invisible to serum serology. Minimal incremental cost when endoscopy is already indicated."},{"recommendation":"Test for CD before dietary modification. Educate patients and primary care physicians that self-initiated GFD can render the diagnostic pathway permanently unreliable.","target":"clinicians, public health education","evidence_basis":"82% of NCGS referrals have already started GFD; IgA-tTG2 drops 50% in 30–60 days; 90% normalize by 24 months. Gluten challenge is unpleasant and frequently refused."},{"recommendation":"In treated CD patients with persistent IBS-type symptoms despite GFD, pursue systematic workup: verify GFD adherence (GIP testing) → repeat duodenal biopsy → exclude microscopic colitis, SIBO, bile acid malabsorption, pancreatic insufficiency, lactose intolerance → trial low-FODMAP GFD.","target":"clinicians","evidence_basis":"Rubio-Tapia algorithm. Multiple treatable causes coexist: inadvertent gluten exposure (48–88% have detectable GIP), persistent villous atrophy (18–53%), SIBO (18–28%), BAM (~35%), PEI (8–28%), microscopic colitis (4–6%). Low-FODMAP GFD supported by RCT evidence."},{"recommendation":"Prioritize the 2025 Shiha meta-analysis (PMID: 40493044) as the reference estimate for CD prevalence in IBS. Retire the '4–16%' range which conflates heterogeneous geographic data.","target":"researchers, guideline authors, educators","evidence_basis":"Largest and most recent meta-analysis (29 studies, 7,209 patients) with explicit attention to geographic heterogeneity, biopsy confirmation rates, and study quality."}],"meta_analysis_summary":{"studies_reviewed":29,"total_patients":7209,"pooled_estimates":{"biopsy_proven_cd_prevalence_in_ibs":"2% (95% CI 2–3%)","seroprevalence_cd_in_ibs":"6% (95% CI 5–8%)","odds_ratio_cd_in_ibs_vs_controls":"4.42 (95% CI 2.82–6.92)","ibs_d_specific_cd_prevalence_2017_meta":"5.4% (95% CI 3.3–7.8%)","ibs_type_symptoms_in_treated_cd":"38% (95% CI 27–50%)","us_ibs_testing_rate_for_cd":"2.7%","seropositive_never_biopsied_rate":"15% (95% CI 6–24%)","cost_per_qaly_cd_screening_in_ibs":"$7,400–$11,000 (US); €6,200 (Netherlands)","nnt_to_find_one_cd_in_ibs":"~25–30"},"heterogeneity_notes":"High heterogeneity (I² >88%) driven primarily by geographic differences: North American community-based studies show 0.4–1.5% CD prevalence in IBS (no significant enrichment), while UK secondary care shows 3–5% and Middle Eastern/South Asian referral centers show 5–15%. Variable biopsy confirmation rates among seropositives (15% never biopsied). All estimates inherit verification bias from serology-first gating. Only 3 studies (Sanders 2001, El-Salhy 2011, one Iranian study) performed universal biopsy regardless of serology — with contradictory results (Sanders found 4.6% CD with 21% seronegative; El-Salhy found 0.4% with no seronegative cases)."}}
