{"research_topic_id":"3.1","research_topic_title":"Seronegative Celiac Disease: Diagnostic Bias, Overlooked Populations, and True Prevalence — Three-Model Integrated Synthesis","date_completed":"2026-02-07","version":"3.0 — Final synthesis (Opus 4.6 deep research + Grok 4.1 peer review + Opus 4.5 independent analysis, triangulated)","executive_summary":"Seronegative celiac disease (SNCD) — biopsy-proven villous atrophy with negative IgA-tTG2/EMA/DGP in HLA-DQ2/DQ8-positive patients responding to GFD — represents 2–6% of diagnosed CD under strict Paris Consensus criteria, but verification bias (Hujoel: 22-fold lower biopsy rate in seronegative patients) means this is a floor estimate with adjusted IgA-tTG2 sensitivity of only 57% (CI 35–76%). SNCD carries dramatically worse outcomes than seropositive CD (10.9-fold complication rate, 2.2-fold mortality) and shows a bimodal Marsh grade pattern: early mild disease where antibodies haven't reached detectable levels and advanced 'burnt-out' disease where high-avidity antibodies are tissue-trapped. Flow cytometry IEL phenotyping (93% sensitivity, 98% specificity), biopsy culture EMA (96–98% sensitivity, 99–100% specificity), and tissue IgA-tTG2 deposits provide serology-independent diagnostic pathways that should be incorporated into clinical guidelines.","key_findings":[{"finding_id":"3.1.F1","finding":"Verification bias fundamentally distorts reported IgA-tTG2 sensitivity. Hujoel meta-analysis found seronegative patients are 22-fold less likely to receive confirmatory biopsy (3.6% vs 79.2%), adjusting sensitivity from the guideline-reported 92.6% down to 57.1%.","evidence_strength":"strong","quantitative_estimate":"Adjusted IgA-tTG2 sensitivity: 57.1%","confidence_interval":"95% CI: 35.4–76.4%","key_citations":["PMID: 32433257"],"contradicts_guidelines":true,"affected_patient_population":"All symptomatic patients with negative serology who are denied biopsy based on guideline algorithms"},{"finding_id":"3.1.F2","finding":"Strict-definition SNCD prevalence is 2–6% of diagnosed CD (all antibodies negative, HLA-DQ2/DQ8+, GFD response confirmed, alternative causes excluded). When looser definitions are used (EMA-negative only, biopsy-first era), rates reach 12–25%. Both figures are internally valid but measure different populations.","evidence_strength":"moderate","quantitative_estimate":"Strict: 2–6%; Biopsy-first era: 12–25%","confidence_interval":null,"key_citations":["PMID: 40999951","PMID: 34496060","PMID: 27352981","PMID: 10201452","PMID: 16571636"],"contradicts_guidelines":false,"affected_patient_population":"Overall CD population — defines scope of the diagnostic blind spot"},{"finding_id":"3.1.F3","finding":"Antibody titers correlate with histological severity: mean tTG2 fold-rise 2.6× for Marsh ≤2, 4.0× for Marsh 3a, 5.7× for Marsh 3b, and 11.8× for Marsh 3c. This gradient explains why serology performs well in severe disease but fails systematically in milder forms, creating the diagnostic dead zone at Marsh 3a where only 31–33% test seropositive.","evidence_strength":"strong","quantitative_estimate":"Fold-rise gradient: 2.6→4.0→5.7→11.8 across Marsh grades; EMA sensitivity: 31% in Marsh 3a vs 100% in total VA","confidence_interval":null,"key_citations":["PMID: 24583754","PMID: 15185855","PMID: 10201452"],"contradicts_guidelines":true,"affected_patient_population":"Patients with partial villous atrophy (Marsh 3a)"},{"finding_id":"3.1.F4","finding":"OBSERVATIONAL PARADOX — Diagnosed SNCD cohorts show severe atrophy and classical malabsorption (because only severe symptoms trigger biopsy when serology is negative), while the Abrams gradient indicates the underlying undiagnosed seronegative population has predominantly milder damage (67% of Marsh 3a is seronegative vs 23% of total VA). The bimodal model (Opus 4.5 contribution) best reconciles this: SNCD exists at both extremes — early mild disease AND advanced burnt-out disease.","evidence_strength":"moderate","quantitative_estimate":"Abrams: 77% seropositive in total VA, only 33% in partial VA (Marsh 3a)","confidence_interval":null,"key_citations":["PMID: 15185855","PMID: 34496060","PMID: 27352981"],"contradicts_guidelines":false,"affected_patient_population":"Both severe-but-diagnosed and mild-but-undiagnosed seronegative CD patients"},{"finding_id":"3.1.F5","finding":"SNCD carries dramatically worse outcomes than seropositive CD: 10.87-fold higher complication rate (HR 10.87, 95% CI 6.11–19.33), 2.18-fold higher mortality (HR 2.18, 95% CI 1.12–4.26), refractory CD type 1 in 14.3% vs 0.8%, and mortality rate 6.0 per 100 person-years vs 0.2 in seropositive (30-fold difference). This is not a subtle gradation but a qualitatively different disease trajectory.","evidence_strength":"strong","quantitative_estimate":"Complications HR 10.87; Mortality HR 2.18; Refractory CD 14.3% vs 0.8%","confidence_interval":"Complications 95% CI: 6.11–19.33; Mortality 95% CI: 1.12–4.26","key_citations":["PMID: 34496060"],"contradicts_guidelines":false,"affected_patient_population":"All diagnosed SNCD patients — demands heightened surveillance"},{"finding_id":"3.1.F6","finding":"HLA-DQ8 is consistently overrepresented in SNCD cohorts (14–25% vs 2.5–10% in seropositive CD, p<0.001 in Ríos León). DQ8 and DQ2.2 present gluten peptides less efficiently than DQ2.5, potentially generating weaker humoral responses and favoring T-cell-dominant immunopathology with lower circulating antibody levels.","evidence_strength":"moderate","quantitative_estimate":"DQ8 in SNCD: 14–25% vs 2.5–10% in seropositive; ninefold enrichment in Ríos León cohort","confidence_interval":null,"key_citations":["PMID: 31057009","PMID: 27352981"],"contradicts_guidelines":false,"affected_patient_population":"DQ8 carriers with celiac-compatible symptoms"},{"finding_id":"3.1.F7","finding":"Flow cytometry IEL phenotyping (celiac lymphogram: elevated TCRγδ+ IELs + decreased CD3−CD103+ IELs) achieves 93% sensitivity and 98% specificity (AUC 0.98) in meta-analysis. In seronegative VA specifically: 87% sensitivity, 96.7% specificity for the full lymphogram. Resolves diagnosis in ~15% of inconclusive cases.","evidence_strength":"strong","quantitative_estimate":"Meta-analysis: Sensitivity 93%, Specificity 98%, AUC 0.98; SNVA-specific: 87% sens, 96.7% spec","confidence_interval":null,"key_citations":["PMID: 31443602","PMID: 32048756","PMID: 29026596"],"contradicts_guidelines":false,"affected_patient_population":"Seronegative villous atrophy patients"},{"finding_id":"3.1.F8","finding":"Tissue IgA-tTG2 deposits detected in all 22 EMA-negative patients in the Salmi 2006 study, with high-avidity binding confirmed by KSCN testing. Sensitivity 73–100%, specificity 82–100% across studies. Supports localized mucosal immunity hypothesis: antibodies produced and deposited at tissue level without reaching systemic circulation.","evidence_strength":"moderate","quantitative_estimate":"64–100% positive in SNCD; sensitivity 73–100%, specificity 82–100%","confidence_interval":null,"key_citations":["PMID: 16571636","PMID: 15082580"],"contradicts_guidelines":false,"affected_patient_population":"SNCD patients — requires frozen biopsy specimens"},{"finding_id":"3.1.F9","finding":"Biopsy organ culture EMA achieves 96–98% sensitivity and 99–100% specificity, outperforming serum EMA. Four patients with negative serum but positive culture EMA and normal villi later developed villous atrophy — detects pre-clinical celiac disease.","evidence_strength":"moderate","quantitative_estimate":"Sensitivity 96–98%; Specificity 99–100%","confidence_interval":null,"key_citations":["PMID: 11843032","PMID: 21885984"],"contradicts_guidelines":false,"affected_patient_population":"Seronegative suspected CD; pre-clinical disease detection"},{"finding_id":"3.1.F10","finding":"Open-conformation TG2 antibody assay identified 93% of untreated CD vs 68% by conventional EMA, and detected 60% of non-responding seronegative patients. This exploits the fact that TG2 is enzymatically active (open) during disease, exposing epitopes hidden in conventional assays.","evidence_strength":"emerging","quantitative_estimate":"93% detection rate in untreated CD; 60% in treatment-non-responsive seronegative patients","confidence_interval":null,"key_citations":["PMID: 21384250"],"contradicts_guidelines":false,"affected_patient_population":"Seronegative and non-responsive CD patients"},{"finding_id":"3.1.F11","finding":"Gliadin-specific T-cell detection via α1/α2-gliadin peptide-loaded Dextramers can identify CD patients including those on GFD. Short-term low-dose gluten challenge increased sensitivity. All patients tested positive within 4 weeks of challenge.","evidence_strength":"emerging","quantitative_estimate":null,"confidence_interval":null,"key_citations":["PMID: 40778297"],"contradicts_guidelines":false,"affected_patient_population":"Diagnostically challenging CD cases including SNCD and patients already on GFD"},{"finding_id":"3.1.F12","finding":"44% of patients with anti-tTG2 titer <2× ULN had biopsy-proven CD in a 366-patient Indian cohort. This contradicts the emerging practice of not biopsying low-titer patients and demonstrates that the no-biopsy threshold must be used with extreme caution.","evidence_strength":"moderate","quantitative_estimate":"43.9% of low-titer (<2× ULN) patients had CD","confidence_interval":null,"key_citations":["PMID: 24583754"],"contradicts_guidelines":true,"affected_patient_population":"Patients with low-positive or borderline anti-tTG2 titers"},{"finding_id":"3.1.F13","finding":"ESsCD 2025 guidelines estimate SNCD at 2–5% of CD and mandate HLA-DQ2/DQ8 testing (high NPV >99%) plus GFD trial with histological response for SNCD diagnosis. Referral to tertiary center recommended. Routine EMA for serology confirmation no longer recommended.","evidence_strength":"strong","quantitative_estimate":"2–5%","confidence_interval":null,"key_citations":["PMID: 40999951"],"contradicts_guidelines":false,"affected_patient_population":"All suspected SNCD patients"}],"biases_documented":[{"bias_type":"Verification bias (primary, quantified)","description":"Serology-first algorithms create circular validation: only seropositive patients routinely receive biopsy, so serology appears highly sensitive because false negatives are never tested. Hujoel quantified this: 3.6% of tTG-negative vs 79.2% of tTG-positive patients receive biopsy — a 22-fold difference. This is the single most consequential bias in celiac disease research.","magnitude_estimate":"IgA-tTG2 sensitivity drops from 92.6% to 57.1% after adjustment (35-percentage-point reduction, CI 35–76%)","evidence_sources":["PMID: 32433257"]},{"bias_type":"Selection bias in diagnosed SNCD cohorts","description":"Only patients with severe enough symptoms (malabsorption, weight loss, anemia) to override the serology-first gate receive biopsy when seronegative. This means diagnosed SNCD cohorts over-represent severe phenotypes. The underlying undiagnosed population — per the Abrams gradient — likely skews toward milder Marsh 3a damage that never triggers investigation.","magnitude_estimate":"Diagnosed SNCD: predominantly severe atrophy; Underlying population: ~67% Marsh 3a (Abrams)","evidence_sources":["PMID: 15185855","PMID: 34496060","PMID: 27352981"]},{"bias_type":"Temporal/era bias","description":"Pre-2007 studies with liberal biopsy practices (biopsy on clinical suspicion regardless of serology) found SNCD rates of 12–38%. Modern guideline-era studies applying serology-first gatekeeping find 2–6%. The difference reflects changing clinical practice, not changing disease biology.","magnitude_estimate":"5–15× difference between eras; prevalence range 1–38% driven primarily by biopsy practice differences","evidence_sources":["PMID: 10201452 (Rostami 1999: 24% seronegative)","PMID: 16571636 (Salmi 2006: 12.4%)","PMID: 34496060 (Schiepatti 2021: 3.9% strict)"]},{"bias_type":"Definition heterogeneity","description":"Older studies used EMA-only negativity. Modern strict definitions (Paris Consensus) require all antibodies negative + HLA+ + GFD response + mimic exclusion. Comparing across definitions is invalid but frequently done in reviews, inflating apparent prevalence disagreements.","magnitude_estimate":"Explains the 1–38% prevalence range more than any biological factor","evidence_sources":["PMID: 35676085 (Paris Consensus)","PMID: 38286391 (Volta 2024 review)"]},{"bias_type":"Circular evidence in serology validation","description":"Meta-analyses of IgA-tTG2 performance include studies where patients were selected based on positive serology, then biopsied. The test is validated against itself. Studies at risk for verification bias were not excluded from the 2016 Comparative Effectiveness Review that established the >92% sensitivity figure.","magnitude_estimate":"The entire evidence base for IgA-tTG2 >95% sensitivity is contaminated","evidence_sources":["PMID: 32433257 (Hujoel critique of 2016 CER)"]}],"unproven_assumptions_identified":[{"assumption":"IgA-tTG2 sensitivity exceeds 90–95% for celiac disease diagnosis","evidence_against":"Hujoel adjustment: 57% (CI 35–76%); Abrams: 67% seronegative in partial VA; Rostami: 31% EMA sensitivity in Marsh 3a; Singh: 44% of low-titer patients have CD. All evidence from studies where biopsy was performed independent of serology.","evidence_for":"Meta-analyses of serology-gated cohorts show >92% — but this is circular evidence (verification bias not excluded)","clinical_impact":"Serology-first algorithms miss a substantial and unknown proportion of CD patients, who then develop complications at 10.9-fold higher rates"},{"assumption":"True SNCD prevalence is only 2–5% of celiac disease","evidence_against":"This figure comes from verification-biased cohorts. No modern universal-biopsy population study exists. Hujoel adjustment implies much higher false-negative rate. Biopsy-first era studies consistently found 12–25%.","evidence_for":"Multiple recent strict-criteria cohorts consistently find 2–6%. Paris Consensus and ESsCD 2025 cite this range. Strict confirmation criteria (GFD response + histological recovery) may correctly exclude non-celiac enteropathies that inflate older estimates.","clinical_impact":"True prevalence unknown — likely lies between 2–6% (strict observed floor) and 10–25% (biopsy-first era ceiling). The honest answer is: we don't know, and the experiment that would tell us has never been done at scale."},{"assumption":"SNCD is primarily characterized by severe villous atrophy and classical malabsorption","evidence_against":"This reflects selection bias in diagnosed cohorts: only severe symptoms override serology-first gatekeeping. The Abrams gradient shows seronegative rates increase with milder damage. Ríos León found 34.6% Marsh 1 in SNCD vs 3.7% in seropositive.","evidence_for":"All well-confirmed SNCD cohorts (Volta 2016, Schiepatti 2021) show predominance of severe phenotype. Biological plausibility: burnt-out disease with tissue-trapped high-avidity antibodies.","clinical_impact":"Milder seronegative CD (Marsh 3a) is systematically undiagnosed. The bimodal model (early mild + late severe) best explains the data."},{"assumption":"HLA-DQ2/DQ8 distribution is similar in SNCD and seropositive CD","evidence_against":"Multiple studies show significant DQ8 overrepresentation in SNCD (23% vs 2.5%, p<0.001 in Ríos León; 14% in Volta; 25% in Pakistani cohort). DQ2.2 also enriched in some cohorts.","evidence_for":"Some older reviews state HLA distribution is comparable. Paris Consensus requires DQ2/DQ8 positivity for SNCD diagnosis.","clinical_impact":"DQ8 carriers may have a fundamentally different immune response to gluten — less humoral (antibody), more cell-mediated (T-cell) — making them invisible to current serologic screening"}],"overlooked_populations":[{"population":"Symptomatic patients with Marsh 3a villous atrophy and negative serology","estimated_size":"Unknown but potentially substantial: Abrams gradient implies 67% of Marsh 3a patients are seronegative; Marsh 3a has patchy distribution with high biopsy false-negative rate compounding the problem","why_missed":"Serology-first algorithms don't trigger biopsy; the titer-severity gradient means partial VA produces antibody levels below detection threshold; patchy Marsh 3a increases sampling error in biopsies that are performed","proposed_solution":"Lower biopsy threshold in symptomatic patients with family history, autoimmune comorbidity, iron deficiency anemia, or malabsorption features — regardless of serology. Ensure adequate biopsy sampling (≥4 post-bulbar + 1–2 bulb biopsies)."},{"population":"HLA-DQ8 heterozygous carriers with celiac-compatible symptoms","estimated_size":"DQ8 in SNCD: 14–25% (vs 2.5–10% seropositive); implies meaningful fraction of all CD patients","why_missed":"DQ8 may generate weaker antibody responses via gene dosage effect and different peptide presentation. Lower-risk genotypes produce less detectable humoral immunity while still driving T-cell-mediated mucosal damage.","proposed_solution":"Do not dismiss CD possibility in symptomatic DQ8+ patients with negative serology. Consider flow cytometry IEL phenotyping as first-line adjunctive test."},{"population":"Patients with partial immunodeficiency states (low IgG1 subclass, low secretory IgA, subclinical IgA deficiency)","estimated_size":"Unknown — no studies have profiled IgG subclasses or secretory IgA in SNCD cohorts","why_missed":"Standard workup checks total IgA deficiency but not partial deficiencies. Low IgG1 (the dominant anti-gluten subclass) impairs the IgG-based backup diagnostic pathway. Low secretory IgA may compromise mucosal immune surveillance. These compound to create a 'perfect storm' for seronegativity.","proposed_solution":"Order IgG subclass panel in seronegative patients. Measure fecal secretory IgA when available. Consider that multiple mild immunodeficiencies may interact to produce complete seronegativity — the index patient profile (negative IgA-tTG2, negative DGP-IgG, low IgG1, low fecal sIgA, DQ8, Marsh 3a) exemplifies this convergence."},{"population":"Older adults (>45 years) with late-onset malabsorption or unexplained iron deficiency","estimated_size":"SNCD median age at diagnosis: 49 years (Volta) vs 36 years (seropositive); mean 37 vs 29 in Ríos León","why_missed":"Symptoms attributed to age-related causes. Possible 'burnt-out' disease with high-avidity tissue-trapped antibodies that no longer circulate. ESsCD 2025 now recommends endoscopy with biopsy in patients >45 regardless of serology for unexplained malabsorption.","proposed_solution":"Apply ESsCD 2025 recommendation. Maintain high index of suspicion for CD in older patients with unexplained iron deficiency, osteoporosis, or weight loss even when serology is negative."},{"population":"Patients with insufficient gluten exposure at time of testing","estimated_size":"Unknown — many patients self-restrict gluten before formal testing","why_missed":"Guidelines require 1–3 slices bread/day for ≥6 weeks before testing. Gluten challenge study showed only 2/22 patients seroconverted on 84g gluten over 6 weeks. Serology is less sensitive than intestinal mucosa to gluten stimulation.","proposed_solution":"Detailed dietary history before interpreting serology. If inadequate gluten exposure: either perform gluten challenge or proceed directly to biopsy if clinical suspicion is high."}],"diagnostic_step_sensitivity":{"step_name":"IgA-tTG2 serology (cascade first step)","reported_sensitivity":"92.6% (2016 Comparative Effectiveness Review, biased cohorts); >95% in many guidelines","adjusted_sensitivity":"57.1% (Hujoel verification bias correction, 95% CI: 35.4–76.4%)","false_negative_rate":"~43% overall (Hujoel point estimate); variable by Marsh grade: ~23% in total VA, ~67% in partial VA (Abrams); ~69% in Marsh 3a (Rostami: only 31% EMA sensitivity)","key_limitations":["Wide confidence interval in Hujoel adjustment (35–76%) — reflects genuine uncertainty","Sensitivity inversely correlated with histological severity (titer-severity gradient)","Gene dosage effect: DQ8 and DQ2.2 carriers produce weaker antibody responses","Cannot detect localized mucosal immunity (tissue-bound antibodies never enter circulation)","IgG-based backup tests have lower sensitivity in IgA-sufficient patients","Performance degrades with insufficient gluten exposure","No modern validation study has biopsied all patients regardless of serology at scale","Hujoel adjustment lacks contemporary prospective validation"]},"contradictory_studies":[{"citation":"Hujoel et al. (2021) — Verification bias adjustment","pmid":"32433257","finding":"Adjusted IgA-tTG2 sensitivity 57.1% (CI 35–76%) after correcting for 22-fold differential biopsy rates","contradicts":"All guidelines claiming IgA-tTG2 sensitivity >90–95%; 2016 Comparative Effectiveness Review"},{"citation":"Rostami et al. (1999) — Biopsy-first era study","pmid":"10201452","finding":"24% of biopsy-confirmed CD patients were seronegative; EMA sensitivity only 31% in Marsh 3a","contradicts":"Modern estimates of SNCD at 2–5%; guideline claims of >95% serology sensitivity"},{"citation":"Abrams et al. (2004) — Serology sensitivity by Marsh grade","pmid":"15185855","finding":"77% EMA-positive in total VA vs only 33% in partial VA; increasing seronegativity with lesser atrophy","contradicts":"Current view that SNCD is associated with MORE severe atrophy (an artifact of selection bias in diagnosed cohorts)"},{"citation":"Singh et al. (2015) — Low-titer CD","pmid":"24583754","finding":"44% of patients with anti-tTG2 <2× ULN had biopsy-proven CD","contradicts":"Emerging no-biopsy approaches and practice of not biopsying low-titer patients"},{"citation":"Salmi et al. (2006) — EMA-negative CD with tissue deposits","pmid":"16571636","finding":"All 22 EMA-negative CD patients had TG2-specific IgA deposits in small-bowel mucosa; EMA-negative CD associated with 3/22 having small-bowel lymphoma","contradicts":"Assumption that negative serum antibodies = no mucosal autoimmunity"},{"citation":"Schiepatti et al. (2021) — 20-year SNCD outcomes","pmid":"34496060","finding":"SNCD complication HR 10.87 (CI 6.11–19.33); mortality HR 2.18 (CI 1.12–4.26) vs seropositive","contradicts":"Clinical assumption that SNCD is a benign diagnostic curiosity rather than a high-risk phenotype demanding heightened surveillance"},{"citation":"Ríos León et al. (2019) — SNCD genetics and flow cytometry","pmid":"31057009","finding":"DQ8 heterozygosity 23.1% in SNCD vs 2.5% in seropositive (p<0.001); flow cytometry IEL patterns identical in both","contradicts":"Assumption that HLA distribution is similar in seronegative and seropositive CD"}],"research_gaps":[{"gap":"Modern prospective universal-biopsy study to determine true SNCD prevalence and unbiased IgA-tTG2 sensitivity","importance":"high","proposed_study_design":"Symptomatic cohort (e.g., patients undergoing endoscopy for IBS-like symptoms, iron deficiency, or weight loss): all receive duodenal biopsy + full serology panel + HLA-DQ2/DQ8 + flow cytometry IEL + tissue deposits, regardless of any test result. GFD trial in all villous atrophy patients. Calculate sensitivity/specificity/prevalence without verification bias. N≥2000 for meaningful confidence intervals."},{"gap":"Prospective validation of Hujoel adjusted sensitivity estimate","importance":"high","proposed_study_design":"Partial verification correction applied to real-world diagnostic cohort where biopsy rates are documented by serostatus. Or: randomize symptomatic seronegative patients to biopsy vs standard care."},{"gap":"Standardization and multicenter validation of flow cytometry IEL phenotyping for clinical guidelines","importance":"high","proposed_study_design":"Multicenter study with standardized TCRγδ+ and CD3−CD103+ cutoffs across different flow cytometry platforms; compare formalin-fixed γδ immunohistochemistry to fresh flow cytometry; validate against GFD response gold standard in seronegative VA."},{"gap":"Large-scale Marsh grade distribution stratified by serostatus with verification bias correction","importance":"high","proposed_study_design":"International registry with standardized expert pathology review and mandatory reporting of serostatus at each Marsh grade. Would definitively test the Abrams gradient hypothesis."},{"gap":"HLA gene dosage effect on antibody production: do DQ8 or DQB1*02-alone carriers have systematically lower tTG2 titers?","importance":"medium","proposed_study_design":"Genotype-stratified analysis of anti-tTG2 titers in large biopsy-proven CD cohort (N≥500). Compare DQ2.5 homozygous, DQ2.5 heterozygous, DQ2.2, DQ8, and DQB1*02-alone carriers."},{"gap":"IgG subclass profiling in SNCD cohorts — particularly IgG1 (dominant anti-gluten subclass)","importance":"medium","proposed_study_design":"Case-control: confirmed SNCD (Paris Consensus criteria) vs matched seropositive CD. Measure IgG1, IgG2, IgG3, IgG4 levels and anti-gluten IgG subclass-specific antibodies."},{"gap":"Secretory IgA measurement in SNCD (never studied)","importance":"medium","proposed_study_design":"Measure fecal secretory IgA in SNCD vs seropositive CD vs healthy controls. Test hypothesis that impaired mucosal IgA transport contributes to tissue trapping of anti-TG2 antibodies."},{"gap":"DQ8-restricted antigen presentation and immune response characterization","importance":"medium","proposed_study_design":"Comparative immunology: measure gluten-specific T-cell frequencies, cytokine profiles, and B-cell activation in DQ8 vs DQ2.5 celiac patients. Test whether DQ8 generates less B-cell help."},{"gap":"Long-term lymphoma and malignancy risk specifically in SNCD","importance":"medium","proposed_study_design":"Registry-based cohort with 10+ year follow-up. Salmi 2006 already noted 3/22 EMA-negative patients had small-bowel lymphoma — needs powered confirmation."},{"gap":"Interaction between multiple mild immunodeficiency states (low IgG1, low secretory IgA, DQ8 genetics) creating 'perfect storm' for seronegativity","importance":"low","proposed_study_design":"Multivariate analysis of immune parameters in SNCD vs seropositive CD. Requires large SNCD cohort (rare disease challenge)."}],"differential_diagnoses_relevant":[{"condition":"Olmesartan/drug-induced enteropathy","overlap_with_cd":"Villous atrophy, malabsorption, diarrhea, weight loss, negative CD serology. Can present identically to SNCD on histology.","distinguishing_features":"Medication history (olmesartan mean 3.1 years use before onset; also valsartan, irbesartan, mycophenolate, methotrexate, checkpoint inhibitors). Thickened subepithelial collagen in 32% (collagenous sprue pattern). Gastric/colonic involvement common. Rapid clinical improvement within days-weeks of drug withdrawal (vs months on GFD). Negative HLA-DQ2/DQ8 in most cases. PMID: 22728033."},{"condition":"Common variable immunodeficiency (CVID)","overlap_with_cd":"Villous atrophy (51%), chronic diarrhea (92%), malabsorption (54%), negative serology (by definition — low immunoglobulins). Can cause severe enteropathy mimicking CD.","distinguishing_features":"Profound depletion of lamina propria plasma cells (CD shows INCREASED plasma cells). Nodular lymphoid hyperplasia. Low immunoglobulins across multiple isotypes (IgG, IgA, IgM). Recurrent sinopulmonary infections. No response to GFD (only 2/12 improved in Malamut 2010). Responds to steroids. PMID: 20551941."},{"condition":"Autoimmune enteropathy","overlap_with_cd":"Severe villous atrophy, malabsorption, can affect adults","distinguishing_features":"Deep crypt lymphocytosis (not surface IEL predominance). Increased crypt apoptotic bodies. Loss of goblet and Paneth cells. Minimal surface IELs (<40/100 epithelial cells). Anti-enterocyte antibodies in 50–93%. Anti-goblet cell antibodies. Responds to immunosuppression, NOT to GFD. Tissue TG2 deposits absent (unlike SNCD where they are present per Salmi 2006)."},{"condition":"Tropical sprue","overlap_with_cd":"Villous atrophy, malabsorption, diarrhea","distinguishing_features":"Travel/residence in endemic tropical regions. Responds to antibiotics (tetracycline + folate). No HLA-DQ2/DQ8 restriction. Typically affects ileum more than duodenum."},{"condition":"Giardiasis","overlap_with_cd":"Villous atrophy (partial), diarrhea, malabsorption","distinguishing_features":"Parasite detection by stool antigen, PCR, or biopsy. Responds to metronidazole. Giardia found in 20% of seronegative VA cases in Volta 2016. Must be actively excluded in all SNVA workups."},{"condition":"Refractory celiac disease (Type I and Type II)","overlap_with_cd":"Persistent villous atrophy, malabsorption. Type I has normal IELs; Type II has aberrant clonal IELs (CD3+CD8−).","distinguishing_features":"Requires prior established CD diagnosis with confirmed GFD compliance. Non-response to GFD is defining criterion. Type II has >20% aberrant IELs by flow cytometry and monoclonal T-cell receptor gene rearrangement. High lymphoma risk in Type II. SNCD progresses to Type I RCD in 14.3% vs 0.8% of seropositive."},{"condition":"Collagenous sprue","overlap_with_cd":"Villous atrophy, malabsorption, can co-occur with CD","distinguishing_features":"Thickened subepithelial collagen band (>10 μm) on trichrome staining. Can be drug-induced (olmesartan) or associated with collagenous colitis. Poor prognosis when independent of drug cause. May require steroids."},{"condition":"Small intestinal bacterial overgrowth (SIBO)","overlap_with_cd":"Bloating, diarrhea, malabsorption, can cause mild villous blunting","distinguishing_features":"Breath testing (glucose or lactulose). Responds to antibiotics. Typically milder histological changes. Can coexist with CD — consider as confounding factor rather than exclusive alternative."}],"recommendations":[{"recommendation":"Perform duodenal biopsy in symptomatic patients with negative serology if ANY of: unexplained malabsorption, persistent iron deficiency anemia, family history of CD, personal autoimmune disease (especially thyroid), HLA-DQ2/DQ8 positive, unexplained weight loss, or osteoporosis. Do not allow negative serology to close the diagnostic pathway.","target":"clinicians","evidence_basis":"ESsCD 2025 (PMID: 40999951); AGA 2021 Clinical Practice Update; Hujoel verification bias data (PMID: 32433257); ACG 2023 recommendation for biopsy when clinical probability >5% despite negative serology"},{"recommendation":"Order HLA-DQ2/DQ8 typing as immediate triage in ALL cases of seronegative villous atrophy. Negative result (NPV >99%) effectively excludes celiac disease and redirects workup to non-celiac enteropathies, saving time and resources.","target":"clinicians","evidence_basis":"ESsCD 2025; Paris Consensus (PMID: 35676085); multiple validation studies"},{"recommendation":"Pursue flow cytometry IEL phenotyping (celiac lymphogram) on fresh duodenal biopsy for all seronegative villous atrophy cases where available. This is the single best serology-independent diagnostic tool currently validated.","target":"specialized centers, clinicians","evidence_basis":"Meta-analysis: 93% sensitivity, 98% specificity (PMID: 31443602); SNVA-specific: 87% sensitivity, 96.7% specificity (PMID: 32048756); resolves 15% of inconclusive cases (PMID: 29026596)"},{"recommendation":"Confirm SNCD diagnosis with strict GFD for ≥12 months followed by repeat endoscopy with biopsy documenting histological recovery. Clinical improvement alone is insufficient — histological response is required per Paris Consensus and ESsCD 2025.","target":"clinicians","evidence_basis":"Paris Consensus (PMID: 35676085); ESsCD 2025 (PMID: 40999951); Schiepatti 2021 outcome data mandating rigorous confirmation"},{"recommendation":"Refer suspected SNCD to tertiary center with access to flow cytometry, tissue deposit analysis, and expert GI pathology. Diagnostic complexity and high misdiagnosis consequences demand specialized evaluation.","target":"primary care, community gastroenterology","evidence_basis":"ESsCD 2025 explicit recommendation; 20.2% complication rate in SNCD (PMID: 34496060)"},{"recommendation":"Systematically exclude alternative causes BEFORE attributing seronegative villous atrophy to CD: medication review (olmesartan/ARBs), Giardia testing, quantitative immunoglobulins (CVID screen), anti-enterocyte antibodies, travel history, trichrome stain for collagenous sprue.","target":"clinicians","evidence_basis":"Paris Consensus; AGA 2021; Volta 2016 found Giardia in 20% and CVID in 16% of seronegative VA (PMID: 27352981)"},{"recommendation":"Guidelines (ESPGHAN, ACG, ESsCD) should explicitly acknowledge verification bias in their sensitivity claims for IgA-tTG2, cite the Hujoel correction, and provide qualified sensitivity estimates stratified by clinical setting and biopsy practice.","target":"guideline committees","evidence_basis":"PMID: 32433257; documented 22-fold differential biopsy rate; unqualified >95% sensitivity claims are demonstrably misleading"},{"recommendation":"Formally incorporate flow cytometry IEL phenotyping into clinical guidelines for seronegative VA evaluation. Evidence (meta-analysis-validated, 93% sensitivity, 98% specificity) exceeds the threshold used to endorse many current guideline recommendations.","target":"guideline committees (ESsCD, AGA, ACG, ESPGHAN)","evidence_basis":"PMID: 31443602; PMID: 32048756; PMID: 29026596"},{"recommendation":"Mandate heightened long-term surveillance for SNCD patients including repeat biopsies, monitoring for refractory disease, and lymphoma screening — given 10.9-fold higher complication rate and 14.3% progression to refractory CD type 1.","target":"clinicians managing confirmed SNCD","evidence_basis":"PMID: 34496060; PMID: 16571636 (lymphoma association in EMA-negative CD)"},{"recommendation":"Do not use serology to monitor disease activity in SNCD. Mandatory follow-up biopsy is required since antibody titers cannot serve as a non-invasive surrogate.","target":"clinicians","evidence_basis":"Definitional: SNCD patients have undetectable antibodies at diagnosis; no basis for serologic monitoring"},{"recommendation":"Consider novel diagnostics (gliadin-specific T-cell Dextramer assay, open-conformation TG2, biopsy culture EMA) for patients already on GFD, equivocal cases, or when flow cytometry is unavailable. These are not yet guideline-endorsed but have strong pilot data.","target":"specialized centers, researchers","evidence_basis":"PMID: 40778297 (T-cell Dextramers); PMID: 21384250 (open-TG2); PMID: 11843032, PMID: 21885984 (biopsy culture EMA)"}],"meta_analysis_summary":{"studies_reviewed":35,"total_patients":null,"pooled_estimates":{"SNCD_prevalence_strict_Paris_criteria":"2–6% of diagnosed CD","SNCD_prevalence_biopsy_first_era":"12–25% (looser definitions)","IgA_tTG2_sensitivity_guideline_reported":"92.6% (95% CI: 90.2–94.5%)","IgA_tTG2_sensitivity_verification_bias_adjusted":"57.1% (95% CI: 35.4–76.4%)","EMA_sensitivity_Marsh_3a":"31% (Rostami 1999)","EMA_sensitivity_total_VA":"77–100%","seronegative_rate_partial_VA":"67% (Abrams 2004)","seronegative_rate_total_VA":"23% (Abrams 2004)","tTG2_fold_rise_by_Marsh":"Marsh ≤2: 2.6×; 3a: 4.0×; 3b: 5.7×; 3c: 11.8× (Singh 2015)","SNCD_complication_hazard_ratio":"10.87 (95% CI: 6.11–19.33)","SNCD_mortality_hazard_ratio":"2.18 (95% CI: 1.12–4.26)","SNCD_refractory_CD_type1_rate":"14.3% vs 0.8% seropositive","flow_cytometry_celiac_lymphogram_sensitivity":"93%","flow_cytometry_celiac_lymphogram_specificity":"98%","flow_cytometry_AUC":"0.98","flow_cytometry_SNVA_sensitivity":"87% (95% CI: 73.7–95%)","flow_cytometry_SNVA_specificity":"96.7% (95% CI: 82.7–99.9%)","biopsy_culture_EMA_sensitivity":"96–98%","biopsy_culture_EMA_specificity":"99–100%","tissue_tTG2_deposits_sensitivity":"73–100%","tissue_tTG2_deposits_specificity":"82–100%","open_conformation_TG2_detection_rate":"93% untreated CD","DQ8_prevalence_in_SNCD":"14–25%","DQ8_prevalence_in_seropositive_CD":"2.5–10%","HLA_DQ2_DQ8_NPV":">99%"},"heterogeneity_notes":"Extreme heterogeneity in SNCD prevalence (1–38%) driven by definition differences (EMA-only vs all-antibody-negative), biopsy threshold differences (clinical suspicion vs serology-gated), era effects (pre-2007 liberal biopsy vs modern guideline-era), and confirmation stringency (clinical improvement only vs histological recovery required). No formal meta-analysis of unbiased SNCD prevalence exists — this is the critical missing study. The Hujoel adjustment has a wide CI (35–76%) reflecting genuine uncertainty. The Abrams gradient is from a single center and needs multicenter validation. Flow cytometry meta-analysis is robust but based on only 6 studies (N=959). All three independent analyses (Opus 4.6, Grok 4.1, this synthesis) converge on the same fundamental conclusion: we do not know the true sensitivity of IgA-tTG2 because the experiment that would measure it has never been done."},"three_model_convergence_assessment":{"methodology":"Three independent AI analyses given identical starting prompt: (1) Opus 4.6 deep research with comprehensive PubMed review, (2) Grok 4.1 independent analysis + peer review of Opus 4.6, (3) this synthesis (Opus 4.6) integrating all three. Triangulation identifies consensus positions and residual disagreements.","universal_consensus":["Verification bias is real, substantial, and quantified (Hujoel 22-fold differential biopsy rate)","Hujoel adjusted IgA-tTG2 sensitivity ~57% (CI 35–76%)","Flow cytometry IEL phenotyping is the best serology-independent diagnostic tool (93% sens, 98% spec)","Tissue tTG2-IgA deposits support localized mucosal immunity hypothesis","SNCD patients are older, sicker, with worse outcomes","DQ8 is overrepresented in SNCD cohorts","HLA-DQ2/DQ8 has >99% NPV for excluding celiac disease","All three analyses agree the fundamental experiment (universal biopsy regardless of serology) has never been done"],"resolved_disagreements":{"prevalence":"Grok correctly challenged initial >10% claims. Synthesis position: 2–6% strict definition (observed floor), 10–25% biopsy-first era (looser definitions), true prevalence unknown between these bounds.","Marsh_grade_distribution":"Opus 4.5 added crucial bimodal hypothesis (early mild + late severe) that better explains data than either 'SNCD = severe' (diagnosed cohorts) or 'SNCD = mild' (Abrams gradient alone).","outcome_severity":"Opus 4.5 correctly emphasized Schiepatti outcomes data more strongly; adopted as central finding."},"unique_contributions_integrated":{"from_Opus_4.5_deep_research":"Biopsy culture EMA quantification; bimodal Marsh hypothesis; open-conformation TG2; CVID distinguishing features; quantified outcomes emphasis","from_Grok_4.1":"Methodological rigor on prevalence claims; definition clarity; temporal bias framework; null hypothesis framing","from_this_synthesis":"ESsCD 2025 guidelines; Singh titer-severity gradient with numbers; gliadin-specific T-cell Dextramer assay; observational paradox framework; three-model triangulation"}},"index_patient_profile_analysis":{"description":"Assessment of how specific patient profile (negative IgA-tTG2 <1, negative anti-DGP IgG <1, low IgG1 subclass, low fecal secretory IgA, HLA-DQ8, Marsh 3A) maps to research findings","convergent_risk_factors":[{"factor":"HLA-DQ8 genotype","research_relevance":"14–25% of SNCD cohorts are DQ8 (vs 2.5–10% seropositive); DQ8 may generate weaker humoral response favoring seronegativity","all_three_analyses_agree":true},{"factor":"Marsh 3A histology","research_relevance":"Diagnostic 'dead zone': only 31–33% EMA sensitivity at this grade; 67% of Marsh 3a patients are seronegative per Abrams gradient; tTG2 fold-rise only 4.0× (vs 11.8× for 3c)","all_three_analyses_agree":true},{"factor":"Low IgG1 subclass","research_relevance":"IgG1 is the dominant anti-gluten IgG subclass; deficiency impairs IgG-based backup testing pathway when IgA pathway fails. No SNCD study has profiled IgG subclasses — this is an unexplored research frontier.","all_three_analyses_agree":true},{"factor":"Low fecal secretory IgA","research_relevance":"May impair mucosal immune surveillance and antibody transport from mucosa to circulation. Never measured in SNCD cohorts. Potentially explains why tissue deposits are present but serum antibodies absent.","all_three_analyses_agree":true},{"factor":"Negative anti-DGP IgG","research_relevance":"DGP-IgG should serve as backup when IgA pathway fails, but is also negative here — consistent with combined IgG1 deficiency + DQ8-driven lower antibody production","all_three_analyses_agree":true}],"synthesis":"This patient profile represents a convergence of at least four independent risk factors for seronegativity, each supported by the literature but never studied in combination. The profile evades every layer of the current diagnostic algorithm: (1) negative IgA-tTG2 → serology-first gate closes; (2) negative DGP-IgG → IgG backup fails; (3) Marsh 3a → titer-severity gradient means even if antibodies were produced, levels would be low; (4) DQ8 → inherently weaker humoral response; (5) low IgG1 → impairs the one remaining backup pathway. This is precisely the type of patient the verification bias cascade predicts would be systematically missed."}}
