{"research_topic_id":"3.2","research_topic_title":"Rare HLA Types and the Gradient of Diagnostic Invisibility in Celiac Disease","date_completed":"2026-02-07","builds_on":"3.3 (Serological Outcome Bias: HLA-Genotype-Dependent Test Sensitivity)","executive_summary":"Serological outcome bias (identified in topic 3.3) predicts a gradient of diagnostic invisibility extending beyond DQ2.2 and DQ8 to rarer HLA types. Karell 2003 (European Genetics Cluster, n=1008) found 6.1% of diagnosed celiacs lacked both DQ2 and DQ8 heterodimers; 57/61 had 'half-DQ2' and 4 had completely non-DQ2/DQ8 genotypes, with 3/4 carrying DQA1*01-DQB1*05 (DQ5). A 2024 Harvard study (Flores-Marin/Therrien) found statistically significant excess enteropathy (8.7% vs 1%, p<0.02) in DQ7.5 carriers without DQ2/DQ8, with in-vitro evidence of gluten-induced immune activation. Since these rare-HLA patients are identified despite serology-gated diagnostics, the true prevalence of gluten-responsive enteropathy in non-DQ2/DQ8 carriers is likely higher than observed. The '99% NPV' of HLA-DQ2/DQ8 testing is itself a product of verification bias — only testable against serology-identified CD cases.","key_findings":[{"finding_id":"3.2.1","finding":"The European Genetics Cluster on Celiac Disease (Karell 2003) studied 1008 European celiacs and found 61 (6.1%) lacked both the complete DQ2 and DQ8 heterodimers. Of these 61, 57 encoded half of the DQ2 heterodimer (either DQB1*02 alone or DQA1*05 alone). Only 4/1008 (0.4%) lacked all known DQ2/DQ8 components entirely. Three of these four carried the DQA1*01-DQB1*05 (DQ5) haplotype. Additionally, 20/61 of the non-DQ2/DQ8 patients also carried DQ5, suggesting a possible minor susceptibility role. The proportion without DQ2/DQ8 was higher in Southern Europe (9.6%) than Northern Europe (3.7%, p=0.007), indicating geographic variation that may reflect population-specific HLA distributions.","evidence_strength":"strong","quantitative_estimate":"6.1% of diagnosed celiacs lack complete DQ2/DQ8; 0.4% lack all DQ2/DQ8 components; Southern Europe 9.6% vs Northern Europe 3.7%","confidence_interval":null,"key_citations":["PMID:12651074 (Karell 2003, Hum Immunol - European Genetics Cluster)"],"contradicts_guidelines":true,"affected_patient_population":"Celiac patients with half-DQ2, DQ5, or other rare HLA genotypes — currently told CD is 'excluded' by HLA testing"},{"finding_id":"3.2.2","finding":"Flores-Marin et al. 2024 (Harvard/Beth Israel Celiac Center) studied 216 DQ7+/DQ2-/DQ8- adults with suspected celiac disease. Among those biopsied, 8.7% had enteropathy vs only 1% in the DQ7-/DQ2-/DQ8- group (p<0.02). Eight patients had seronegative enteropathy unexplained by other etiologies. Most of those with possible CD were DQ7.5 (DQA1*05/DQB1*03:01), which shares the DQA1*05 alpha-chain with DQ2.5. The study references in-vitro evidence of IL-2 release and immune activation upon gluten exposure in DQ7.5 carriers lacking DQ2 and DQ8. 86% of patients who tried a GFD showed clinical improvement.","evidence_strength":"emerging","quantitative_estimate":"8.7% enteropathy in DQ7+ vs 1% in DQ7- (p<0.02); 86% GFD response rate","confidence_interval":null,"key_citations":["PMID:38825411 (Flores-Marin et al. 2024, Dig Liver Dis - DQ7 haplotype in suspected celiac)"],"contradicts_guidelines":true,"affected_patient_population":"DQ7.5 carriers currently classified as 'non-permissive' for CD by all major guidelines","peer_review_note":"Downgraded from moderate to emerging: Flores-Marin 2024 is a Letter to the Editor (3 pages), not a full peer-reviewed article. Statistical finding (p<0.02) is real but from small sample without full methodological reporting. Requires replication. (Peer review by Opus 4.5)"},{"finding_id":"3.2.3","finding":"DQ7.5 (DQA1*05/DQB1*03:01) shares the alpha-chain gene DQA1*05 with DQ2.5 (DQA1*05/DQB1*02). The critical difference is the beta-chain: DQB1*03:01 vs DQB1*02. Since the peptide-binding groove is formed by both chains, DQ7.5 has a different but structurally related binding pocket compared to DQ2.5. This may allow presentation of a subset of gluten peptides — potentially different from both DQ2.5-restricted and DQ2.2-restricted epitopes. The existence of in-vitro T-cell activation in DQ7.5 carriers confirms that at least some gluten peptides CAN be presented by this molecule.","evidence_strength":"moderate","quantitative_estimate":null,"confidence_interval":null,"key_citations":["PMID:38825411 (Flores-Marin 2024 - DQ7.5 clinical data)","In-vitro IL-2 data referenced by Flores-Marin from prior publications"],"contradicts_guidelines":true,"affected_patient_population":"DQ7.5 carriers — population frequency varies by ethnicity, subset of broader DQ7 frequency"},{"finding_id":"3.2.4","finding":"HLA-DPB1*04:01 was found to be protective against celiac disease autoimmunity in the TEDDY study (OR 0.71, 95% CI 0.53-0.96, p=0.025), replicated in the broader cohort (HR 0.84, 95% CI 0.73-0.96, p=0.013). This demonstrates that non-DQ HLA molecules (in this case HLA-DP) modulate celiac risk. If HLA-DP can be protective, the possibility that HLA-DP (or other class II molecules) could in rare cases be permissive for gluten presentation cannot be excluded without experimental testing.","evidence_strength":"strong","quantitative_estimate":"OR 0.71 (95% CI 0.53-0.96) for DPB1*04:01 protection","confidence_interval":"95% CI 0.53-0.96","key_citations":["PMID:26010309 (Hadley 2015, Am J Gastroenterol - DPB1*04:01 protective in TEDDY)"],"contradicts_guidelines":false,"affected_patient_population":"Demonstrates broader HLA involvement in CD than DQ alone"},{"finding_id":"3.2.5","finding":"Megiorni 2008 showed that among DQ2/DQ8-negative celiac patients, the sex ratio reverses to F:M = 0.7 (male excess), compared to F:M = 1.8 in overall CD. 15% of male celiacs were DQ2/DQ8-negative vs 6% of females. NPV of HLA testing was only 90.5% for males vs 99.1% for females. This suggests that male celiac patients are enriched for rare, non-DQ2/DQ8-mediated pathways — and these pathways are the ones most invisible to current serology-based diagnostics.","evidence_strength":"moderate","quantitative_estimate":"15% of male celiacs DQ2/DQ8-negative; NPV 90.5% males vs 99.1% females; sex ratio reverses to 0.7 in DQ2/DQ8-negative CD","confidence_interval":null,"key_citations":["PMID:18177450 (Megiorni 2008, Am J Gastroenterol - HLA-DQ sex differences)"],"contradicts_guidelines":true,"affected_patient_population":"Male celiac patients with rare HLA genotypes"},{"finding_id":"3.2.6","finding":"Serological outcome bias creates a predictable gradient of diagnostic invisibility based on HLA-DQ epitope presentation capacity. The hierarchy from most visible to least visible is: DQ2.5 homozygous > DQ2.5 heterozygous > DQ2.5/DQ2.2 compound > DQ8 alone > DQ2.2 alone > half-DQ2 (DQB1*02-only or DQA1*05-only) > DQ7.5 > DQ5 > no known permissive allele. At each step, the predicted number of presentable gluten T-cell epitopes decreases, predicted T-cell help to B cells decreases, predicted antibody production decreases, and predicted serology sensitivity decreases. Patients at the bottom of this gradient are doubly invisible: too few antibodies for serological detection AND classified as 'non-permissive' by HLA testing, so they are excluded from diagnostic consideration entirely.","evidence_strength":"emerging","quantitative_estimate":"8/8 immunodominant epitopes for DQ2.5, 3/8 for DQ2.2, unknown but >0 for DQ7.5 (in-vitro confirmed), unknown for DQ5","confidence_interval":null,"key_citations":["PMID:12535064 (Vader 2003 - DQ2.2 epitope binding)","PMID:31285344 (Iversen 2019 - T-B collaboration mechanism)","PMID:38825411 (Flores-Marin 2024 - DQ7.5 enteropathy data)","PMID:12651074 (Karell 2003 - DQ5 in DQ2/DQ8-negative celiacs)"],"contradicts_guidelines":true,"affected_patient_population":"All non-DQ2.5 genotypes, increasingly severe for rarer HLA types"},{"finding_id":"3.2.7","finding":"The commonly cited '99% NPV' for HLA-DQ2/DQ8 testing is calculated against the denominator of diagnosed celiac patients — who were identified through serology-gated diagnostics. This creates circular reasoning: HLA testing has high NPV because the cases it's validated against were found by serology, and serology preferentially detects DQ2/DQ8-positive cases. The true NPV against ALL gluten-responsive enteropathy (including seronegative cases in rare HLA genotypes) is unknown and likely lower, especially in males (Megiorni: 90.5% NPV). Flores-Marin's 8.7% enteropathy rate in DQ7+ patients provides direct evidence that the NPV for clinical decision-making may be significantly overstated.","evidence_strength":"moderate","quantitative_estimate":"Reported NPV 99% overall, 90.5% in males (Megiorni); 8.7% enteropathy in DQ7+ patients (Flores-Marin) suggests further erosion","confidence_interval":null,"key_citations":["PMID:18177450 (Megiorni 2008 - sex-specific NPV)","PMID:38825411 (Flores-Marin 2024 - DQ7+ enteropathy)","PMID:12651074 (Karell 2003 - 6.1% of celiacs without DQ2/DQ8 heterodimer)"],"contradicts_guidelines":true,"affected_patient_population":"All patients in whom HLA-DQ2/DQ8 testing is used to 'exclude' CD"}],"biases_documented":[{"bias_type":"Gradient of serological invisibility","description":"Extension of serological outcome bias (topic 3.3) to rare HLA types. As HLA genotype moves further from DQ2.5 along the epitope-presentation gradient, antibody production decreases predictably. At DQ2.2 and DQ8, some patients still produce enough antibody for detection. At DQ7.5 and DQ5, the immune response may be too weak or too different in epitope specificity for ANY current serological test to detect. These patients are invisible to both serology AND HLA testing, creating a complete diagnostic blind spot.","magnitude_estimate":"Unknown. Karell found 6.1% of diagnosed celiacs without complete DQ2/DQ8 despite serology-gated ascertainment. Flores-Marin found 8.7% enteropathy in DQ7+ patients. True magnitude of undetected rare-HLA CD cannot be estimated from existing data.","evidence_sources":["PMID:12651074 (Karell 2003 - 6.1% without DQ2/DQ8)","PMID:38825411 (Flores-Marin 2024 - DQ7 enteropathy)","PMID:18177450 (Megiorni 2008 - male excess in DQ2/DQ8-negative CD)"]},{"bias_type":"Circular NPV validation","description":"The '99% NPV' of HLA-DQ2/DQ8 testing is validated against diagnosed CD cases, who were identified by serology-first algorithms. Since serology preferentially detects DQ2/DQ8-positive cases (per serological outcome bias), the denominator for NPV calculation systematically excludes the cases that rare HLA types would be responsible for. The NPV appears high because the validation set is biased toward cases that HLA testing would correctly classify. True NPV against biopsy-confirmed gluten-responsive enteropathy would be lower.","magnitude_estimate":"Megiorni 2008: male-specific NPV is 90.5%, nearly 10% miss rate. Flores-Marin 2024: 8.7% enteropathy in DQ7+ patients the current system classifies as 'non-permissive'. Geographic variation (Karell: 9.6% non-DQ2/DQ8 in Southern Europe) suggests NPV varies by population.","evidence_sources":["PMID:18177450 (Megiorni 2008 - sex-specific NPV)","PMID:38825411 (Flores-Marin 2024 - enteropathy in 'excluded' HLA group)","PMID:12651074 (Karell 2003 - geographic variation in non-DQ2/DQ8 CD)"]},{"bias_type":"Geographic ascertainment bias","description":"Karell 2003 found that Southern European celiacs had significantly more non-DQ2/DQ8 cases (9.6%) than Northern Europeans (3.7%, p=0.007). This could reflect true genetic variation in CD susceptibility, but could also reflect differential diagnostic practices — Southern European clinicians may biopsy more readily regardless of serology, detecting a wider HLA spectrum. If Northern European practice is more strictly serology-gated, then the 3.7% figure is a more severe underestimate than the 9.6% figure.","magnitude_estimate":"2.6-fold difference between Southern and Northern Europe (9.6% vs 3.7%)","evidence_sources":["PMID:12651074 (Karell 2003 - European Genetics Cluster)"]},{"bias_type":"DGP test circular validation against serology-positive patients","description":"Schwertz 2004 (PMID:15472035), the foundational DGP validation study, tested the PLQPEQPFP peptide against 52 CD patients who were ALL already EMA-positive (serologisk pre-selected) and 76 EMA-negative controls. No HLA genotype data was reported. No seronegative CD patients were included. No DQ2.2-only or DQ8-only patients were specifically tested. This means the DGP test was validated exclusively against the subset of CD patients already detectable by another serological test — circular validation that cannot reveal genotype-specific sensitivity gaps. Identified by peer review (Opus 4.5, topic 3.12).","magnitude_estimate":"Unknown — the entire DGP sensitivity literature inherits this foundational bias since subsequent studies also used serology-gated cohorts","evidence_sources":["PMID:15472035 (Schwertz 2004 - original DGP validation)","Peer review observation (Opus 4.5, topic 3.12)"]}],"unproven_assumptions_identified":[{"assumption":"Only HLA-DQ2 (DQ2.5, DQ2.2) and DQ8 can present gluten peptides to T cells, making them the only 'permissive' alleles for celiac disease","evidence_against":"Karell 2003: 4/1008 celiacs lacked all DQ2/DQ8 components. Flores-Marin 2024: DQ7.5 carriers without DQ2/DQ8 have 8.7% enteropathy rate (p<0.02 vs controls) and 86% GFD response. In-vitro studies show IL-2 release upon gluten exposure in DQ7.5 carriers. DQ7.5 shares DQA1*05 alpha chain with DQ2.5, providing structural basis for partial gluten peptide presentation.","evidence_for":"DQ2.5 and DQ8 have the most well-characterized gluten peptide binding. Structural studies show unique preference for negative charges in binding pockets P4, P6, P7 that is specific to DQ2/DQ8. The vast majority (>93%) of diagnosed celiacs carry DQ2/DQ8.","clinical_impact":"Patients with DQ7.5, DQ5, and other rare HLA types who present with GI symptoms are told 'CD is excluded' based on HLA testing. If these molecules CAN present some gluten peptides, these patients are denied diagnosis and treatment. Flores-Marin data suggests this is already happening at a clinically meaningful rate."},{"assumption":"The 99% NPV of HLA-DQ2/DQ8 testing applies equally across all populations, both sexes, and all clinical presentations","evidence_against":"Megiorni 2008: NPV is only 90.5% in males (vs 99.1% in females). 15% of male celiacs lack DQ2/DQ8. Karell 2003: NPV varies geographically (9.6% non-DQ2/DQ8 in Southern Europe vs 3.7% in Northern Europe). No guideline reports sex-specific or population-specific NPV.","evidence_for":"Overall population-level NPV calculations are consistently >95% across most studies in Northern European populations.","clinical_impact":"Male patients and Southern European patients are disproportionately harmed by the blanket 99% NPV claim. A male patient with DQ7.5 and GI symptoms has a substantially higher pre-test probability of CD than the 99% NPV figure implies."},{"assumption":"The 0.4-6.1% of celiacs without DQ2/DQ8 represents the true fraction of non-DQ2/DQ8 CD","evidence_against":"These patients were identified through serology-gated diagnostics that are mechanistically biased against detecting non-DQ2/DQ8 cases. The 0.4-6.1% represents only those non-DQ2/DQ8 patients who produced enough antibody (against DQ2.5-calibrated test antigens) to trigger diagnostic workup despite having non-DQ2/DQ8 genotypes — likely the extreme tail of the distribution. Flores-Marin 2024's finding of 8.7% enteropathy in DQ7+ patients when biopsied regardless of serology suggests substantial undetected disease.","evidence_for":"Multiple independent studies consistently find >90% of diagnosed celiacs carry DQ2/DQ8, suggesting a strong biological requirement.","clinical_impact":"If the true fraction of non-DQ2/DQ8 gluten-responsive enteropathy is substantially higher than 0.4-6.1%, then HLA testing as a rule-out tool excludes a clinically significant number of patients from diagnosis."},{"assumption":"Trans-encoded HLA-DQ heterodimers have been comprehensively evaluated for gluten peptide presentation capacity","evidence_against":"Standard HLA testing reports cis-encoded DQ2.5, DQ2.2, DQ8. Trans-encoded combinations (e.g., DQA1*05 from one parent + DQB1*03:01 from other = DQ7.5 in trans) are not systematically identified or evaluated. DQ7.5 in trans would be reported as 'DQ2/DQ8 negative' but has identical molecular structure to cis-encoded DQ7.5 and the same potential for gluten peptide presentation. The number of possible trans-encoded DQ heterodimers is large and mostly unexplored.","evidence_for":"Trans-encoded DQ2.5 is well-recognized. Some trans-combinations are theoretically well-understood from crystallographic data.","clinical_impact":"Patients with trans-encoded DQ7.5 or other gluten-presenting heterodimers would test 'DQ2/DQ8 negative' and be told CD is excluded, despite having a molecule capable of driving gluten-reactive immunity."}],"overlooked_populations":[{"population":"DQ7.5 (DQA1*05/DQB1*03:01) carriers with gluten-responsive enteropathy","estimated_size":"DQ7 is present in approximately 19% of populations assessed for CD (Flores-Marin cohort). Of DQ7+ patients, 79% were DQ7.5. 8.7% had enteropathy. Rough estimate: ~1.3% of individuals referred for CD evaluation who carry DQ7.5 without DQ2/DQ8 may have gluten-responsive enteropathy. Population-wide prevalence unknown.","why_missed":"Classified as 'non-permissive' by HLA testing. Serology likely negative because (a) limited T-cell epitope presentation → reduced antibody production, (b) any antibodies produced target DQ7.5-specific gliadin epitopes not measured by DGP/tTG tests. Excluded from CD evaluation by both serological AND genetic rule-out criteria.","proposed_solution":"Clinicians should not use HLA-DQ2/DQ8 negativity to definitively exclude CD in symptomatic DQ7.5 carriers. Consider biopsy with mucosal TG2-IgA deposit analysis. Flores-Marin 2024 provides clinical precedent."},{"population":"DQ5 (DQA1*01/DQB1*05) carriers with celiac disease","estimated_size":"3/4 completely DQ2/DQ8-negative celiacs in Karell 2003 carried DQ5. 20/61 non-DQ2/DQ8 celiacs also carried DQ5. DQ5 population frequency varies but is common (~15-25% in European populations). True CD susceptibility in DQ5 carriers is unknown.","why_missed":"Completely outside the recognized HLA-CD framework. No studies have tested whether DQ5 can present any gluten peptides. No serological test targets DQ5-driven antibody responses. Both serology and HLA testing classify these patients as 'no CD risk.'","proposed_solution":"Structural and in-vitro studies testing whether DQ5 can present deamidated gluten peptides. Follow up Karell 2003's DQ5 observation with dedicated clinical study of symptomatic DQ5 carriers."},{"population":"Male celiac patients with non-DQ2/DQ8 HLA genotypes","estimated_size":"Megiorni 2008: 15% of male celiacs are DQ2/DQ8-negative. In DQ2/DQ8-negative CD, sex ratio reverses to F:M = 0.7 (male excess). This suggests male CD patients are enriched for rare-HLA pathways by ~2.5-fold compared to females.","why_missed":"Triple barrier: (1) rare HLA type → classified as 'non-permissive', (2) serological outcome bias → low/absent antibodies, (3) male presentation patterns may differ from female patterns used in clinical recognition. Guidelines report only overall NPV (~99%), not the male-specific 90.5%.","proposed_solution":"Report sex-specific NPV in all HLA testing guidelines. Lower threshold for biopsy in symptomatic males with any DQ allele. Replicate Megiorni 2008 in independent populations."},{"population":"Trans-encoded DQ7.5 carriers (DQA1*05 from one parent + DQB1*03:01 from other parent)","estimated_size":"Unknown. Depends on population-specific haplotype frequencies. Trans-encoded DQ7.5 would be functionally identical to cis-encoded DQ7.5 but not identified by standard HLA typing approaches that only report full DQ2.5/DQ2.2/DQ8.","why_missed":"Standard HLA reporting focuses on recognized CD-associated heterodimers (DQ2.5, DQ2.2, DQ8). Trans-encoded combinations involving non-DQ2/DQ8 beta-chains paired with DQA1*05 are not flagged. These patients are reported as 'DQ2/DQ8 negative' despite having a molecule with potential gluten-presenting capacity.","proposed_solution":"HLA typing reports should include full DQA1/DQB1 allele information, not just DQ2/DQ8 status. Report DQ7.5 (cis or trans) as a 'possibly permissive' finding rather than 'non-permissive.'"},{"population":"Southern European and non-European populations with higher frequency of non-DQ2/DQ8 CD","estimated_size":"Karell 2003: 9.6% of Southern European celiacs lack DQ2/DQ8 vs 3.7% Northern European. Indian population (Senapati 2016) may have different HLA-CD associations. Non-European populations are severely understudied.","why_missed":"CD diagnostic guidelines and HLA testing NPV values are based predominantly on Northern European populations. The broader HLA diversity in Southern European, Middle Eastern, South Asian, and East Asian populations may include additional permissive alleles not yet characterized.","proposed_solution":"Population-specific HLA-CD studies with biopsy-independent case ascertainment. Avoid applying Northern European NPV values to non-Northern European populations."}],"diagnostic_step_sensitivity":{"step_name":"HLA-DQ2/DQ8 testing as rule-out for celiac disease","reported_sensitivity":"99% (often stated as 'virtually all celiacs carry DQ2 or DQ8')","adjusted_sensitivity":"90.5% in males (Megiorni 2008). ~90% in Southern European populations (Karell 2003: 9.6% without DQ2/DQ8). Unknown true sensitivity against biopsy-confirmed gluten-responsive enteropathy including seronegative and rare-HLA cases.","false_negative_rate":"Reported: ~1%. Male-specific: ~9.5%. Southern European: ~9.6%. True rate including undiagnosed rare-HLA cases: unknown but likely higher.","key_limitations":["NPV calculated against serology-identified cases — circular reasoning (serological outcome bias)","Male-specific NPV (90.5%) not reported in guidelines despite 2008 publication","Geographic variation (3.7% vs 9.6% non-DQ2/DQ8) not accounted for","DQ7.5 not tested as permissive allele despite 2024 evidence of enteropathy","Trans-encoded heterodimers not systematically evaluated","Non-European populations understudied","The denominator problem: we cannot know how many rare-HLA CD patients exist because our case-finding methods are biased against finding them"]},"contradictory_studies":[{"citation":"Flores-Marin DL et al. 2024. HLA-DQ7 haplotype among individuals with suspected celiac disease. Dig Liver Dis.","pmid":"38825411","finding":"8.7% enteropathy rate in DQ7+/DQ2-/DQ8- patients vs 1% in DQ7-/DQ2-/DQ8- (p<0.02). Eight patients had seronegative enteropathy unexplained by other causes. 86% responded to GFD. In-vitro evidence of gluten-induced IL-2 release in DQ7.5 carriers.","contradicts":"Guidelines stating HLA-DQ2/DQ8 negativity excludes celiac disease. DQ7.5 is classified as 'non-permissive' by all current diagnostic algorithms."},{"citation":"Karell K et al. 2003. HLA types in celiac disease patients not carrying the DQ2 heterodimer. Hum Immunol.","pmid":"12651074","finding":"6.1% of 1008 European celiacs lacked complete DQ2/DQ8 heterodimers. 4 patients lacked all DQ2/DQ8 components entirely, with 3/4 carrying DQ5 (DQA1*01-DQB1*05). Southern Europeans had 2.6x more non-DQ2/DQ8 celiacs than Northern Europeans.","contradicts":"The claim that 'almost all celiacs carry DQ2 or DQ8' and the '99% NPV' used to rule out CD. The 6.1% figure is itself an underestimate due to serology-gated ascertainment."},{"citation":"Megiorni F et al. 2008. HLA-DQ and susceptibility to celiac disease: evidence for gender differences and parent-of-origin effects. Am J Gastroenterol.","pmid":"18177450","finding":"15% of male celiacs are DQ2/DQ8-negative. NPV of HLA testing is 90.5% for males. Sex ratio reverses in DQ2/DQ8-negative CD (F:M = 0.7). Paternal DQ2 inheritance strongly associated with female CD predominance.","contradicts":"Guidelines applying a uniform ~99% NPV without sex stratification. Male patients may have a completely different HLA-CD risk landscape."},{"citation":"Hadley D et al. 2015. HLA-DPB1*04:01 protects genetically susceptible children from celiac disease autoimmunity in the TEDDY study. Am J Gastroenterol.","pmid":"26010309","finding":"HLA-DPB1*04:01 is protective against CD autoimmunity (OR 0.71). This demonstrates non-DQ HLA molecules modulate CD risk, meaning the HLA contribution to CD is broader than the DQ2/DQ8 binary.","contradicts":"The simplified model that CD susceptibility is determined solely by HLA-DQ2 and DQ8"}],"research_gaps":[{"gap":"No systematic in-vitro testing of whether DQ7.5, DQ5, DQ9, or other rare DQ molecules can present deamidated gluten peptides to T cells","importance":"high","proposed_study_design":"Peptide binding assays using recombinant DQ7.5, DQ5, DQ9 molecules with the full panel of known deamidated gluten T-cell epitopes. If binding occurs, follow with T-cell proliferation assays using intestinal biopsies from symptomatic carriers of these alleles."},{"gap":"No biopsy-based study of CD prevalence in symptomatic DQ7.5 carriers independent of serology","importance":"high","proposed_study_design":"Prospective study: biopsy all symptomatic DQ7.5 carriers presenting to GI clinics with CD-compatible symptoms, regardless of serology. Include mucosal TG2-IgA deposit immunofluorescence. Compare Marsh grades and deposit rates with serology status."},{"gap":"Replication of Megiorni 2008 sex-specific HLA findings — never replicated in 17+ years","importance":"high","proposed_study_design":"Retrospective analysis of existing celiac cohorts (>1000 patients) with HLA genotyping, stratified by sex. Test whether male excess in DQ2/DQ8-negative CD and the 90.5% male NPV replicate. If confirmed, guidelines must be updated."},{"gap":"Comprehensive characterization of gluten peptide presentation by trans-encoded DQ heterodimers","importance":"medium","proposed_study_design":"Identify patients with DQA1*05 paired in trans with non-DQB1*02 beta chains (DQB1*03:01, DQB1*05, etc). Test whether these trans-DQ molecules present gluten peptides in binding assays. Correlate with clinical symptoms and biopsy findings."},{"gap":"Population-specific HLA-CD associations outside Northern Europe","importance":"high","proposed_study_design":"CD prevalence studies with biopsy-based ascertainment (not serology-first) in Southern European, Middle Eastern, South Asian, and East Asian populations. Full HLA typing beyond DQ2/DQ8 binary. This would simultaneously address both geographic NPV variation and rare-HLA CD prevalence."},{"gap":"Whether DQ7.5-driven antibody responses target epitopes detectable by any current commercial serological assay","importance":"high","proposed_study_design":"Sera from biopsy-confirmed DQ7.5 enteropathy patients (e.g., from Flores-Marin cohort): test against panel of DGP peptides (PLQPEQPFP and variants), tTG2, and custom DQ7.5-specific deamidated gliadin peptides. If commercial tests are negative but custom peptides are positive, this proves antigen specificity bias extends to DQ7.5."},{"gap":"Whether HLA-DP molecules can present any gluten peptides directly","importance":"low","proposed_study_design":"In-vitro peptide binding assays using recombinant DP molecules (especially DPB1*04:01 which shows CD-modifying effect) with deamidated gluten peptides. If DP-restricted gluten presentation occurs, this would open an entirely new dimension of CD immunology."}],"differential_diagnoses_relevant":[{"condition":"Non-celiac gluten sensitivity (NCGS) in DQ7.5 carriers","overlap_with_cd":"Extremely high overlap. A DQ7.5 carrier with GI symptoms, negative serology, negative 'HLA DQ2/DQ8', and symptom improvement on GFD would be classified as NCGS by current criteria. Flores-Marin 2024 found enteropathy in DQ7.5 carriers with GFD response — this is CD by all functional criteria, but current classification forces it into NCGS.","distinguishing_features":"Mucosal TG2-IgA deposits (Salmi 2006) would be present in CD but absent in true NCGS. Elevated IEL counts and Marsh grading ≥1 favor CD. However, biopsy is needed, and current algorithms discourage biopsy in HLA-DQ2/DQ8-negative patients."},{"condition":"Seronegative villous atrophy of unknown cause","overlap_with_cd":"Seronegative villous atrophy is a recognized entity with a broad differential (drug-induced, autoimmune enteropathy, tropical sprue, infections). In DQ7.5 or other rare-HLA carriers, gluten-responsive enteropathy should be on this differential but currently is not, because HLA testing 'excludes' CD.","distinguishing_features":"GFD trial with documented mucosal recovery. Mucosal TG2-IgA deposits. Presence of DQA1*05-containing allele (DQ7.5 or trans-DQ)."},{"condition":"Olmesartan-induced enteropathy or other drug-induced enteropathy","overlap_with_cd":"Can cause villous atrophy indistinguishable from CD on biopsy. Important to exclude in DQ2/DQ8-negative patients. Flores-Marin 2024 specifically excluded 1 case of angiotensin receptor blocker-induced enteropathy from their DQ7+ group.","distinguishing_features":"Drug withdrawal leads to mucosal recovery without GFD. TG2-IgA deposits absent."}],"recommendations":[{"recommendation":"Guidelines should remove the phrase 'CD can be excluded' when HLA-DQ2/DQ8 testing is negative. Replace with 'typical celiac disease is very unlikely, but gluten-responsive enteropathy via rare HLA pathways cannot be fully excluded, particularly in males and Southern European populations.' The 99% NPV should be qualified with sex-specific values (90.5% for males, Megiorni 2008).","target":"guidelines, clinicians","evidence_basis":"Megiorni 2008 (sex-specific NPV), Karell 2003 (6.1% without DQ2/DQ8), Flores-Marin 2024 (enteropathy in DQ7+ patients)"},{"recommendation":"HLA-DQ7.5 (DQA1*05/DQB1*03:01) should be reported as 'possibly permissive' rather than 'non-permissive' on HLA typing reports. Symptomatic DQ7.5 carriers should not have CD excluded on the basis of HLA testing alone.","target":"laboratories, guidelines, clinicians","evidence_basis":"Flores-Marin 2024 (8.7% enteropathy, p<0.02); in-vitro IL-2 release data; structural basis via shared DQA1*05 alpha chain with DQ2.5"},{"recommendation":"HLA typing reports should include full DQA1 and DQB1 allele identification, not just DQ2/DQ8 binary status. This would enable identification of DQ7.5 (cis and trans), DQ5, and other potentially permissive combinations. Current binary reporting discards information needed for clinical decision-making in edge cases.","target":"laboratories, diagnostic manufacturers","evidence_basis":"Karell 2003 (half-DQ2, DQ5 observations); Flores-Marin 2024 (DQ7.5); molecular basis for trans-encoded heterodimer concerns"},{"recommendation":"In symptomatic patients with non-DQ2/DQ8 HLA genotypes who have unexplained villous atrophy or elevated IELs, a GFD trial with biopsy confirmation of mucosal recovery should be offered as a diagnostic pathway, even if serology is negative and HLA testing 'excludes' CD.","target":"clinicians","evidence_basis":"Flores-Marin 2024 (86% GFD response in DQ7+ patients with enteropathy); Karell 2003 (documented CD in DQ5 carriers); the fundamental limitation that serology and HLA testing both have known blind spots"},{"recommendation":"Megiorni 2008's sex-specific HLA findings must be replicated. If confirmed, all clinical guidelines should report sex-specific NPV for HLA-DQ2/DQ8 testing. The current 90.5% NPV for males means approximately 1 in 10 male CD patients will be missed by HLA testing.","target":"researchers, guidelines","evidence_basis":"Megiorni 2008 (unreplicated for 17+ years despite significant clinical implications)"},{"recommendation":"Future research into the celiac iceberg should distinguish between 'DQ2/DQ8-mediated celiac disease' and 'gluten-responsive enteropathy' as potentially overlapping but not identical categories. The current definition of CD as 'requiring DQ2/DQ8' may be a circular consequence of serology-gated diagnostics rather than a biological truth.","target":"researchers, nosology committees","evidence_basis":"Integrated evidence from Karell 2003, Flores-Marin 2024, Hadley 2015 (DP involvement), and the mechanistic framework of serological outcome bias. The disease definition may need to evolve to accommodate the full spectrum of HLA-mediated gluten-responsive enteropathy."}],"meta_analysis_summary":{"studies_reviewed":8,"total_patients":null,"pooled_estimates":{"karell_2003_non_DQ2_DQ8_fraction":"61/1008 = 6.1% (half-DQ2: 57/61; fully non-DQ2/DQ8: 4/61)","karell_2003_geographic_variation":"Southern Europe 9.6% vs Northern Europe 3.7% (p=0.007)","megiorni_2008_male_DQ2_DQ8_negative":"15% of male celiacs vs 6% of female celiacs","megiorni_2008_male_NPV":"90.5% vs 99.1% female","megiorni_2008_sex_ratio_DQ2_DQ8_negative":"F:M = 0.7 (reversed from overall F:M = 1.8)","flores_marin_2024_DQ7_enteropathy":"8.7% vs 1% in DQ7-negative (p<0.02)","flores_marin_2024_GFD_response":"86% clinical improvement","hadley_2015_DPB1_0401_protection":"OR 0.71 (95% CI 0.53-0.96)"},"heterogeneity_notes":"These studies span 20+ years but have never been synthesized in the context of serological outcome bias. Each study individually observes a piece of the gradient of diagnostic invisibility — Karell sees the rare-HLA celiacs who slip through, Megiorni sees the sex-specific pattern, Flores-Marin sees the DQ7.5 enteropathy, Hadley sees the DP involvement — but no publication has connected them into the unified framework of HLA-dependent antibody production → HLA-dependent test sensitivity → HLA-dependent diagnostic invisibility → HLA-dependent disease definition circularity."},"invisibility_gradient":{"description":"Predicted hierarchy of diagnostic visibility based on HLA-DQ epitope presentation capacity and serological outcome bias","hierarchy":[{"rank":1,"genotype":"DQ2.5 homozygous","epitopes_presentable":"8/8 immunodominant, maximal DQ molecule density","predicted_antibody_level":"Highest","serology_sensitivity":"Highest (~98%+)","diagnostic_visibility":"Always detected"},{"rank":2,"genotype":"DQ2.5 heterozygous","epitopes_presentable":"8/8, half DQ2.5 molecule density","predicted_antibody_level":"High","serology_sensitivity":"Very high (~95%+)","diagnostic_visibility":"Almost always detected"},{"rank":3,"genotype":"DQ2.5/DQ2.2 compound","epitopes_presentable":"8/8 + 3/8, high DQB1*02 dose","predicted_antibody_level":"High","serology_sensitivity":"High","diagnostic_visibility":"Usually detected"},{"rank":4,"genotype":"DQ8 alone","epitopes_presentable":"Distinct set, restricted repertoire","predicted_antibody_level":"Moderate","serology_sensitivity":"Moderate — DGP antigen specificity concern","diagnostic_visibility":"Usually detected but some false negatives"},{"rank":5,"genotype":"DQ2.2 alone (homozygous)","epitopes_presentable":"3/8, unstable binding","predicted_antibody_level":"Low","serology_sensitivity":"Low — predicted high false negative rate","diagnostic_visibility":"Frequently missed"},{"rank":6,"genotype":"DQ2.2 alone (heterozygous)","epitopes_presentable":"3/8, half DQ2.2 density","predicted_antibody_level":"Very low","serology_sensitivity":"Very low — classified 'non-permissive' by Choung 2020","diagnostic_visibility":"Rarely detected; classified as non-permissive"},{"rank":7,"genotype":"Half-DQ2 (DQB1*02-only or DQA1*05-only)","epitopes_presentable":"Partial, depends on other allele in trans","predicted_antibody_level":"Very low to absent","serology_sensitivity":"Very low","diagnostic_visibility":"Detected only if accidentally biopsied; 57/61 non-DQ2/DQ8 celiacs in Karell"},{"rank":8,"genotype":"DQ7.5 (DQA1*05/DQB1*03:01)","epitopes_presentable":"Unknown number, in-vitro evidence confirms >0","predicted_antibody_level":"Minimal — different epitope specificity from all tests","serology_sensitivity":"Near zero for current tests (wrong antigens AND low quantity)","diagnostic_visibility":"Essentially invisible: excluded by both HLA AND serology testing. 8.7% enteropathy found only when biopsied regardless (Flores-Marin 2024)"},{"rank":9,"genotype":"DQ5 (DQA1*01/DQB1*05)","epitopes_presentable":"Unknown — no binding studies performed","predicted_antibody_level":"Unknown — potentially minimal","serology_sensitivity":"Unknown — likely near zero","diagnostic_visibility":"Completely invisible: only found in 3/4 fully non-DQ2/DQ8 celiacs in Karell 2003 (chance biopsy findings)"},{"rank":10,"genotype":"Other DQ molecules (DQ4, DQ6, DQ9) or DP-mediated","epitopes_presentable":"Unknown — never tested","predicted_antibody_level":"Unknown","serology_sensitivity":"Unknown","diagnostic_visibility":"Completely unknown — may present as 'unexplained seronegative villous atrophy' or 'NCGS'"}]}}
