{"research_topic_id":"3.6","research_topic_title":"Three Converging Mechanisms Explaining Complete Celiac Seronegativity (IgA-tTG2 <1 AND DGP-IgG <1)","date_completed":"2026-02-08","executive_summary":"Complete seronegativity in biopsy-confirmed celiac disease (all serology <1 U/mL) is best explained by convergent multiplicative failure of three independent mechanisms: (A) reduced antibody production from DQ8-restricted epitope repertoire (3-6 vs 14-17 for DQ2.5) compounded by IgG1 deficiency impairing sequential IgM→IgG1→IgA class switching; (B) potential assay blindness where DGP test peptide (PLQPEQPFP) has zero sequence homology with the immunodominant DQ8-α-I epitope (EGSFQPSQE); and (C) efficient mucosal antibody sequestration by tissue TG2, confirmed by Salmi 2006 showing 100% mucosal deposits in seronegative patients. Each mechanism independently reduces detectability by ~50-70%; their multiplicative convergence drives titers from low-positive to undetectable. The pIgR paradox (villous atrophy should increase, not decrease serum IgA) argues against pure compartmentalization, favoring reduced production as the dominant mechanism with tissue trapping providing the final margin below detection threshold.","key_findings":[{"finding_id":"3.6-F1","finding":"DQ8 restricts only 3-6 well-characterized gluten T-cell epitopes versus 14-17 for DQ2.5, a 3-5x disparity in antigenic repertoire. DQ8 epitopes derive from protease-sensitive gliadin regions with limited bioavailability, require two-site deamidation (P1 and P9) versus single for DQ2.5, and elicit polyspecific T-cell responses distributed across minor determinants rather than focused immunodominant responses. DQ2.5 forms more stable peptide-MHC complexes (Fallang 2009). DQ2 homozygosity confers OR 96.9 for tTG-IgA positivity. This quantitative T-cell help deficit translates to an estimated 50-70% reduction in baseline antibody production for DQ8-only patients.","evidence_strength":"strong","quantitative_estimate":"50-70% reduction in baseline serological signal attributable to DQ8 vs DQ2.5","confidence_interval":null,"key_citations":["DOI:10.1007/s00251-012-0599-z","DOI:10.1038/ni1521","PMID:17629515"],"contradicts_guidelines":true,"affected_patient_population":"All DQ8-only celiac patients (~5-10% of diagnosed CD)"},{"finding_id":"3.6-F2","finding":"IgG1 dominates the anti-tTG IgG response in celiac disease (Comerford 2015), with IgG1 anti-tTG positivity in 56.6% of symptomatic celiacs vs 18.2% silent CD (Agardh 2005). Anti-gliadin IgG is IgG1/IgG3-dominant (Uhde 2020). In a patient with IgG1 at 37% of reference midpoint, the dominant subclass of ALL IgG-based celiac backup tests (tTG-IgG, DGP-IgG) is severely depleted, rendering IgG backup testing unreliable. This represents a mechanism entirely independent of HLA genotype.","evidence_strength":"strong","quantitative_estimate":"IgG1 at 37% of normal midpoint → estimated 60-65% reduction in anti-DGP IgG and anti-tTG IgG signal","confidence_interval":null,"key_citations":["DOI:10.1016/j.humimm.2015.08.003","DOI:10.1053/j.gastro.2020.05.097","PMID:15683458"],"contradicts_guidelines":true,"affected_patient_population":"Celiac patients with IgG1 subclass deficiency (prevalence in CD unknown, general population ~2-4%)"},{"finding_id":"3.6-F3","finding":"Siniscalco et al. (Immunity, 2025) demonstrated gut mucosal IgA is generated through sequential class switching IgM→IgG1→IgA, with definitive molecular proof from Sγ1 switch region remnants in IgA plasma cell Sμ-Sα junctions. IgG1 deficiency would bottleneck this pathway, preferentially impairing T-cell-dependent, affinity-matured mucosal IgA — precisely the type needed for anti-tTG2 autoantibody production. Analogous to established IgM→IgG1→IgE pathway where IgG1 deficiency prevents high-affinity IgE generation (He 2013). The reference patient's low fecal secretory IgA (<280 vs 510-2040 ref) with normal serum IgA (1.6 g/L) is consistent with selectively impaired antigen-driven mucosal IgA via this pathway.","evidence_strength":"emerging","quantitative_estimate":"Estimated 30-50% reduction in antigen-specific mucosal IgA from impaired sequential switching","confidence_interval":null,"key_citations":["DOI:10.1016/j.immuni.2025.10.004","DOI:10.1084/jem.20121760"],"contradicts_guidelines":false,"affected_patient_population":"Patients with IgG1 subclass deficiency, regardless of HLA genotype"},{"finding_id":"3.6-F4","finding":"The DGP test peptide (PLQPEQPFP, Schwertz 2004) has ZERO sequence homology with the immunodominant DQ8-α-I epitope (EGSFQPSQE). The DQ8-γ-I epitope (EQPQQPFPE) shares only a partial PFP triplet overlap with the test peptide but is a minor epitope. Zhou 2022 confirmed QPEQPFP as the dominant B-cell epitope but studied predominantly DQ2.5 cohorts. DQ2.2-specific unique epitopes exist (Bodd 2012: PFSEQEQPV). No equivalent systematic epitope discovery has been performed for DQ8-only patients' B-cell antibody specificities — representing the largest gap in celiac serology research. NOTE: Zhou 2022 claimed HLA-independent recognition; while their DQ8 subgroup was small, the burden of proof for epitope mismatch remains on this hypothesis. Downgraded from moderate to weak per peer review (Grok 3.12).","evidence_strength":"weak","quantitative_estimate":null,"confidence_interval":null,"key_citations":["PMID:15472035","DOI:10.1016/j.celrep.2022.111517","DOI:10.1053/j.gastro.2012.02.060"],"contradicts_guidelines":true,"affected_patient_population":"DQ8-only celiac patients whose B cells may target different deamidated gliadin epitopes than the test measures"},{"finding_id":"3.6-F5","finding":"Salmi 2006 (n=177) demonstrated 100% of IgA-competent, serum EMA-negative celiac patients had gluten-dependent mucosal TG2-IgA deposits. Korponay-Szabó 2004 showed deposits appear BEFORE seroconversion, establishing compartmentalized production as the default first step. Serum detection requires a separate pathway: gut B-cell activation → precursor migration to bone marrow → monomeric IgA secretion. Iversen 2017 found NO correlation between gut plasma cell numbers and serum antibody levels, confirming these are independent processes. Tissue TG2 acts as antibody sink (Stamnaes 2016: TG2 binds fibronectin + collagen VI, creating abundant immobilized antigen).","evidence_strength":"strong","quantitative_estimate":"100% mucosal deposit sensitivity in seronegative adult CD","confidence_interval":null,"key_citations":["PMID:16299031","PMID:15082580","DOI:10.1016/j.celrep.2017.08.036","DOI:10.1111/febs.13907"],"contradicts_guidelines":false,"affected_patient_population":"All seronegative celiac patients with normal total IgA"},{"finding_id":"3.6-F6","finding":"The pIgR paradox resolves the debate between Model A (reduced production) and Model C (compartmentalization): In pIgR-knockout mice (Shimada 1999), reduced pIgR causes INCREASED serum IgA because dimeric IgA backs up into circulation. Therefore, Marsh 3A villous atrophy reducing pIgR expression should increase, not decrease, serum IgA detection. This argues AGAINST pure compartmentalization as explanation for seronegativity and FAVORS genuinely reduced production (Model A) as the dominant mechanism. Compartmentalization provides the final margin below detection threshold only because production is already very low.","evidence_strength":"moderate","quantitative_estimate":null,"confidence_interval":null,"key_citations":["PMID:10553061","DOI:10.1038/mi.2011.37"],"contradicts_guidelines":false,"affected_patient_population":"Theoretical framework applicable to all seronegative CD patients with villous atrophy"},{"finding_id":"3.6-F7","finding":"The convergent multiplicative model: For the reference patient (DQ8, IgG1 deficient, Marsh 3A), if a typical DQ2.5 Marsh 3A patient produces ~50 U/mL tTG-IgA, DQ8 alone reduces to ~15-25 U/mL; IgG1-impaired sequential switching further reduces to ~8-15 U/mL; tissue TG2 sequestration consumes substantial fraction before bone marrow seeding; final serum level plausibly <1 U/mL. For DGP-IgG: IgG1 deficiency reduces dominant subclass by ~60-65% AND DGP test peptide has zero homology with immunodominant DQ8 epitope. This model distinguishes 'completely undetectable' (<1) from 'low positive' (1-3x ULN) as mechanistically different populations requiring different explanations.","evidence_strength":"emerging","quantitative_estimate":"Multiplicative reduction: 0.3-0.5 (DQ8) × 0.5-0.7 (IgG1 switching) × tissue sequestration margin = <2% of DQ2.5 baseline, below detection threshold","confidence_interval":null,"key_citations":["Novel synthesis — no single study models all three pathways"],"contradicts_guidelines":true,"affected_patient_population":"Patients with DQ8 + IgG1 deficiency + Marsh 3A (reference patient profile); broader relevance to any patient with ≥2 concurrent serological reduction mechanisms"},{"finding_id":"3.6-F8","finding":"Hietikko 2018 quantified TG2-specific plasma cells across celiac disease stages: 79% of pre-atrophy patients (median 2.3% of mucosal plasma cells) and 100% of active CD (median 4.3%). Correlation between plasma cell frequency and serum titers was rS=0.69, while correlation with deposit intensity was only rS=0.43. This moderate correlation means the relationship between mucosal production and serum detection is not deterministic — substantial interindividual variation exists in spillover efficiency, consistent with multiple modifying factors (HLA genotype, Ig subclass status, tissue TG2 binding capacity) creating a wide range of serum outcomes from similar mucosal production levels.","evidence_strength":"strong","quantitative_estimate":"rS=0.69 correlation between mucosal plasma cells and serum titers; rS=0.43 with deposit intensity","confidence_interval":null,"key_citations":["PMID:30522434"],"contradicts_guidelines":false,"affected_patient_population":"All celiac patients — demonstrates serum serology is an imperfect proxy for mucosal immunological activity"}],"biases_documented":[{"bias_type":"DQ2.5-centric epitope calibration of DGP assays","description":"Commercial DGP tests use peptides (PLQPEQPFP) derived from DQ2.5-immunodominant gluten epitopes. B-cell epitope mapping (Zhou 2022) was performed predominantly in DQ2.5 cohorts. DQ8-only patients may produce antibodies against different deamidated gliadin sequences (DQ8-α-I: EGSFQPSQE, zero homology with test peptide) that commercial assays do not detect. No systematic DQ8-specific B-cell epitope discovery has been performed.","magnitude_estimate":"Unknown — could explain a substantial fraction of DQ8-specific false negatives. The immunodominant DQ8-α-I epitope has 0% sequence identity with the DGP test peptide.","evidence_sources":["Schwertz 2004 PMID:15472035","Zhou 2022 DOI:10.1016/j.celrep.2022.111517","Henderson 2007 PMID:17629515","Bodd 2012 DOI:10.1053/j.gastro.2012.02.060"]},{"bias_type":"IgG subclass composition assumption","description":"Commercial anti-tTG IgG and anti-DGP IgG assays measure total IgG reactivity without reporting subclass composition. Since IgG1 dominates anti-tTG IgG (Comerford 2015) and anti-gliadin IgG (Uhde 2020), patients with selective IgG1 deficiency will produce false-negative IgG results even when other IgG subclasses are normal. Guidelines recommend IgG-based testing as 'backup' for IgA-deficient patients without considering IgG subclass deficiency.","magnitude_estimate":"IgG1 deficiency prevalence 2-4% in general population; if similar or enriched in CD, represents a defined population where ALL IgG backup tests fail systematically","evidence_sources":["Comerford 2015 DOI:10.1016/j.humimm.2015.08.003","Uhde 2020 DOI:10.1053/j.gastro.2020.05.097","Agardh 2005 PMID:15683458"]},{"bias_type":"Binary seronegativity classification","description":"Clinical practice and research studies classify patients as 'seropositive' or 'seronegative' without distinguishing between 'completely undetectable' (<1 U/mL) and 'low positive below cutoff' (1-3x ULN). These likely represent mechanistically different populations: the former may have genuinely impaired antibody production (multiple concurrent failure mechanisms), while the latter may simply be near-threshold with a single reduction factor. Lumping them obscures the distinct pathophysiology and required interventions.","magnitude_estimate":"No study has stratified seronegative CD by absolute titer levels (<1 vs 1-cutoff) — the distinction is completely unstudied","evidence_sources":["Novel observation from convergent model analysis"]}],"unproven_assumptions_identified":[{"assumption":"DGP test peptides are equally sensitive across all HLA-DQ genotypes","evidence_against":"DQ8-α-I immunodominant epitope (EGSFQPSQE) has zero sequence homology with DGP test peptide (PLQPEQPFP). DQ2.2 has unique epitopes (Bodd 2012: PFSEQEQPV). Different HLA molecules present different gluten peptides, driving different B-cell epitope specificities. Zhou 2022 B-cell epitope mapping was predominantly in DQ2.5 cohorts.","evidence_for":"Zhou 2022 claimed recognition was 'irrespective of HLA-DQ allotype' but DQ8-only patients were a tiny fraction. Simon-Vecsei 2012 showed anti-tTG2 converges on a single conformational epitope (Glu153/Glu154, Arg19) that should be HLA-independent — but this applies to tTG2 not DGP assays.","clinical_impact":"If DGP-IgG has reduced sensitivity for DQ8 patients, the IgG 'backup' test for IgA-deficient patients becomes doubly unreliable in DQ8 carriers"},{"assumption":"IgG-based celiac tests are adequate backup when IgA tests fail","evidence_against":"IgG1 dominates celiac IgG responses (Comerford 2015, Uhde 2020). IgG1 subclass deficiency (prevalence 2-4%) renders the entire IgG backup strategy unreliable. Sequential switching (Siniscalco 2025) means IgG1 deficiency also impairs downstream IgA production — creating concurrent failure of BOTH IgA and IgG pathways.","evidence_for":"In typical patients with normal IgG subclasses, DGP-IgG performs reasonably well as backup","clinical_impact":"Patients with IgG1 deficiency fall through ALL serological safety nets — IgA tests fail due to impaired sequential switching, IgG tests fail due to subclass deficiency"},{"assumption":"Seronegative celiac disease can be explained by a single mechanism","evidence_against":"Values <1 (completely undetectable) cannot be explained by any single 50-70% reduction mechanism — they require multiplicative convergence of 2-3+ independent factors. The reference patient has at least 3 concurrent mechanisms (DQ8, IgG1 deficiency, mucosal compartmentalization).","evidence_for":"Some SNCD patients may have simpler explanations (total IgA deficiency, immunosuppressive medication, recent GFD initiation)","clinical_impact":"Guideline algorithms assume seronegativity has a single testable cause (usually IgA deficiency) — the multiplicative model implies some patients have no single identifiable cause but multiple partial causes"},{"assumption":"Mucosal TG2-IgA deposits are equivalent across all HLA genotypes","evidence_against":"No study has quantified deposit intensity specifically in DQ8-only vs DQ2.5 patients. If DQ8 generates fewer T-cell epitopes → less T-B help → fewer TG2-specific plasma cells → lower deposit intensity, then even this 'gold standard' for SNCD may have reduced sensitivity in DQ8 patients.","evidence_for":"Salmi 2006 reported 100% sensitivity in all seronegative adults, but HLA genotype distribution was not reported","clinical_impact":"If mucosal deposits are also weaker in DQ8 patients, even this last diagnostic fallback may fail for the most invisible patient subgroup"}],"overlooked_populations":[{"population":"DQ8-only celiac patients with concurrent IgG1 subclass deficiency","estimated_size":"Unknown — DQ8-only is ~5-10% of CD, IgG1 deficiency ~2-4% general population. If independent, ~0.1-0.4% of CD patients. If co-enriched, possibly higher.","why_missed":"DQ8 reduces baseline antibody production; IgG1 deficiency impairs both IgG backup tests AND sequential switching to IgA; tissue sequestration consumes remainder. All three arms of serological testing fail simultaneously. No guideline considers IgG subclass testing in CD workup.","proposed_solution":"IgG subclass testing should be performed in any seronegative patient with suspected CD, especially DQ8 carriers. If IgG1 is low, acknowledge that ALL serological tests (IgA and IgG-based) are unreliable and proceed directly to biopsy-based diagnosis with mucosal TG2-IgA deposit testing."},{"population":"Celiac patients with 'completely undetectable' serology (<1 U/mL) vs 'low positive below cutoff'","estimated_size":"Unknown — no study distinguishes these subgroups within seronegative CD","why_missed":"Binary seropositive/seronegative classification obscures the distinction. Patients with values <1 likely have fundamentally different mechanisms (multiplicative production failure) than patients with values just below cutoff (single partial reduction).","proposed_solution":"Studies should report absolute serological values, not just positive/negative. Seronegative CD cohorts should be stratified by titer level to identify mechanistically distinct subgroups."},{"population":"Celiac patients whose anti-DGP antibodies target DQ8-specific gliadin epitopes not captured by commercial tests","estimated_size":"Unknown — potentially all DQ8-only CD patients with preserved antibody production who test DGP-negative due to epitope mismatch","why_missed":"DGP test peptide (PLQPEQPFP) derived from DQ2.5-immunodominant epitopes. No commercial test uses DQ8-α-I-derived peptides.","proposed_solution":"Develop and validate DQ8-specific DGP test peptides (e.g., based on EGSFQPSQE and related sequences). Test seronegative DQ8 patients with expanded peptide panel. If positive, this would prove Model B and necessitate HLA-stratified serological testing."}],"diagnostic_step_sensitivity":{"step_name":"Combined celiac serology (IgA-tTG2 + DGP-IgG) in DQ8-only patient with IgG1 deficiency","reported_sensitivity":"93-98% (guidelines, unstratified by HLA or Ig subclass)","adjusted_sensitivity":"Estimated <30% for patients with DQ8 + IgG1 deficiency + Marsh 3A, based on multiplicative model: ~50% (DQ8 T-cell help deficit) × ~50% (IgG1 sequential switching impairment for IgA; direct IgG1 reduction for DGP-IgG) × tissue sequestration margin","false_negative_rate":"Estimated >70% for this specific patient subgroup","key_limitations":["No direct measurement of serological sensitivity stratified by HLA-DQ subtype exists","No study has measured anti-DGP IgG subclass distribution","DGP peptide may have zero sensitivity for DQ8-α-I-driven antibodies","IgG1 deficiency simultaneously impairs IgA production (via sequential switching) AND IgG detection (via subclass depletion)","Multiplicative model is novel synthesis — not yet empirically validated as integrated framework","Tissue TG2 sequestration magnitude not quantified in vivo"]},"contradictory_studies":[{"citation":"Zhou et al. 2022 — Claimed anti-DGP B-cell epitope recognition is HLA-independent","pmid":"36288703","finding":"QPEQPFP identified as dominant B-cell epitope 'irrespective of HLA-DQ allotype'","contradicts":"Our Model B hypothesis that DQ8 drives different antibody specificities. However, DQ8-only patients were a tiny fraction of the study population, and magnitude of response by genotype was not separately analyzed — the claim of HLA-independence was not rigorously tested for DQ8."},{"citation":"Simon-Vecsei et al. 2012 — Anti-tTG2 antibodies converge on single conformational epitope","pmid":"22198767","finding":"Celiac anti-tTG2 antibodies target a conserved conformational epitope (Glu153/Glu154, Arg19) that is disease-specific and structural","contradicts":"Hypothesis that DQ8 patients produce qualitatively different anti-tTG2 antibodies. If the tTG2 epitope is structural and HLA-independent, the IgA-tTG2 test should work equally well across genotypes — making Model B more applicable to DGP than tTG2 assays."},{"citation":"Iversen et al. 2019 — T-B cell collaboration drives autoantibody epitope bias","pmid":null,"finding":"Efficient T-B collaboration selects for B cells targeting N-terminal tTG2 epitopes through hapten-carrier mechanism, and the selected epitopes depend on which gluten peptides the T cells recognize","contradicts":"Simon-Vecsei's single-epitope convergence — Iversen shows four distinct conformational epitope groups whose relative dominance may vary by HLA context, leaving room for DQ8-specific differences in anti-tTG2 epitope hierarchy"},{"citation":"Shimada et al. 1999 — pIgR knockout increases serum IgA","pmid":"10553061","finding":"pIgR-deficient mice show dramatically increased serum IgA and decreased fecal IgA","contradicts":"Model C's compartmentalization hypothesis — if Marsh 3A reduces pIgR expression, serum IgA should INCREASE, not decrease. This paradox favors Model A (reduced production) over Model C (compartmentalization) as the primary mechanism."}],"research_gaps":[{"gap":"No DQ8-only celiac cohort has been specifically studied for antibody characteristics (mean titers, IgG subclass distribution, DGP peptide cross-reactivity, anti-tTG2 epitope hierarchy)","importance":"high","proposed_study_design":"Cross-sectional study comparing DQ8-only (n≥50) vs DQ2.5 (n≥100) celiac patients: measure (a) mean antibody titers for all standard tests, (b) anti-DGP IgG subclass distribution, (c) reactivity with DQ8-derived peptides (EGSFQPSQE-based DGP), (d) anti-tTG2 epitope mapping by competition ELISA"},{"gap":"Anti-DGP IgG subclass distribution has never been measured in any celiac cohort","importance":"high","proposed_study_design":"Measure IgG1, IgG2, IgG3, IgG4 anti-DGP antibodies by subclass-specific ELISA in diagnosed celiac patients (n≥200) stratified by HLA genotype. If IgG1-dominant, this explains why IgG1-deficient patients test negative on DGP-IgG."},{"gap":"No study has tested seronegative CD patients with DQ8-specific deamidated gliadin peptides","importance":"high","proposed_study_design":"Generate synthetic peptides from DQ8-α-I (EGSFQPSQE) and DQ8-γ-I (EQPQQPFPE) epitopes, deamidate appropriately, and test seronegative DQ8 celiac patients by ELISA. Positive results would prove epitope mismatch as a cause of seronegativity."},{"gap":"IgG1 subclass deficiency prevalence in celiac disease populations is unknown","importance":"high","proposed_study_design":"Measure IgG subclasses in large celiac cohort (n≥500) stratified by serology status (seropositive, low-positive, seronegative) and HLA genotype. Test whether IgG1 deficiency is enriched in seronegative CD."},{"gap":"Mucosal TG2-IgA deposit intensity has never been quantified specifically in DQ8-only celiac patients","importance":"high","proposed_study_design":"Quantitative immunofluorescence of TG2-IgA deposits in DQ8-only vs DQ2.5 celiac biopsies with concurrent serum serology. If deposits are weaker in DQ8, this confirms reduced production (Model A); if equal, it supports compartmentalization (Model C)."},{"gap":"Siniscalco 2025 sequential class-switching pathway has not been examined in celiac disease-specific B cells","importance":"high","proposed_study_design":"Single-cell BCR sequencing of intestinal anti-tTG2 IgA plasma cells: look for Sγ1 switch region remnants in Sμ-Sα junctions, confirming IgG1 intermediate. Compare frequency of sequential vs direct switching in celiac vs non-celiac IgA plasma cells."},{"gap":"No study distinguishes 'completely undetectable' (<1 U/mL) from 'low positive below cutoff' seronegative populations","importance":"medium","proposed_study_design":"Retrospective analysis of seronegative CD cohorts reporting absolute titer values. Stratify by <1, 1-cutoff, and compare: HLA genotype distribution, IgG subclass levels, Marsh grade, mucosal deposit intensity, clinical phenotype."},{"gap":"Tissue TG2 antibody-binding capacity has never been quantitatively modeled in vivo","importance":"medium","proposed_study_design":"Quantitative immunohistochemistry of total tissue TG2 protein vs TG2-bound IgA in celiac biopsies, calculating saturation fraction. If tissue TG2 is far in excess of bound IgA, the antigen sink hypothesis is plausible; if nearly saturated, it is not."}],"differential_diagnoses_relevant":[{"condition":"CVID (Common Variable Immunodeficiency) with enteropathy","overlap_with_cd":"Villous atrophy, increased IELs, IgG subclass deficiency. CVID enteropathy can mimic Marsh 3A. Both can present with low immunoglobulins and seronegative enteropathy.","distinguishing_features":"CVID typically has low total IgG (<5 g/L) and/or low IgA (<0.07 g/L), impaired vaccine responses, recurrent infections. Reference patient has normal total IgG (11.2) and normal IgA (1.6), with only isolated IgG1 deficiency — not typical CVID. However, overlap exists and CVID should be excluded."},{"condition":"Selective IgG1 deficiency as primary immunodeficiency (not secondary to CD)","overlap_with_cd":"Can cause enteropathy independently of celiac disease through impaired mucosal immunity. Could present with villous atrophy and negative serology.","distinguishing_features":"If IgG1 deficiency is the primary problem, GFD would not improve histology. GFD response is the key distinguishing feature. However, both conditions could coexist, with IgG1 deficiency exacerbating celiac seronegativity."},{"condition":"Autoimmune enteropathy","overlap_with_cd":"Villous atrophy, can be seronegative for celiac markers. May have anti-enterocyte or anti-goblet cell antibodies.","distinguishing_features":"Does not respond to GFD. Anti-enterocyte antibodies if present. May have more diffuse GI involvement beyond duodenum."}],"recommendations":[{"recommendation":"IgG subclass testing (IgG1, IgG2, IgG3, IgG4) should be added to celiac workup in any patient with negative IgA-tTG2 AND negative DGP-IgG, before concluding serology is 'normal negative'","target":"guidelines","evidence_basis":"IgG1 dominates anti-tTG IgG (Comerford 2015) and anti-gliadin IgG (Uhde 2020). IgG1 deficiency simultaneously impairs IgG-based backup tests AND mucosal IgA production via sequential class switching (Siniscalco 2025). Without IgG subclass data, clinicians cannot determine if negative IgG results are biologically meaningful."},{"recommendation":"Develop and validate HLA-stratified DGP test panels including DQ8-derived peptides (based on DQ8-α-I and DQ8-γ-I epitopes)","target":"researchers","evidence_basis":"Current DGP peptide (PLQPEQPFP) has zero sequence homology with immunodominant DQ8-α-I epitope (EGSFQPSQE). DQ2.2-specific epitopes exist (Bodd 2012). HLA-specific serological testing is mechanistically justified but has never been developed."},{"recommendation":"Clinical guidelines should distinguish 'completely undetectable' serology (<1 U/mL all tests) from 'low positive below cutoff' as potentially different clinical entities requiring different diagnostic approaches","target":"guidelines","evidence_basis":"Multiplicative model predicts these populations have different mechanisms: complete undetectability suggests concurrent production failure (multiple mechanisms), while near-threshold values suggest single partial reduction. Different mechanisms require different diagnostic interventions."},{"recommendation":"Mucosal TG2-IgA immunofluorescence on frozen biopsies should be recommended as standard diagnostic step for any patient with suspected seronegative CD, not reserved as a research tool","target":"guidelines","evidence_basis":"100% sensitivity in adult SNCD (Salmi 2006). When serology fails due to multiplicative mechanisms, mucosal deposits are the only remaining antibody-based diagnostic. The pIgR paradox confirms some antibody must still be produced locally even when serum is undetectable."},{"recommendation":"Future celiac antibody studies MUST report results stratified by HLA-DQ subtype (DQ2.5, DQ2.2, DQ8, other) and measure IgG subclass levels","target":"researchers","evidence_basis":"Without HLA stratification, DQ8-specific sensitivity cannot be calculated. Without IgG subclass data, a defined immunodeficient population is invisible. Current unstratified reporting perpetuates the assumption of uniform test performance."},{"recommendation":"For the reference patient specifically: intestinal TG2-IgA immunofluorescence on frozen duodenal biopsies is the highest-yield next diagnostic test, predicted to be positive by the convergent model","target":"clinicians","evidence_basis":"The pIgR paradox and Hietikko 2018 data confirm that mucosal antibody production occurs even when serum is undetectable. The convergent model predicts deposits should be present (production is reduced but not zero), potentially with lower intensity than DQ2.5 patients."}],"meta_analysis_summary":{"studies_reviewed":28,"total_patients":null,"pooled_estimates":{"DQ8_T_cell_epitope_reduction":"3-6 vs 14-17 DQ2.5 epitopes (3-5x disparity)","IgG1_dominance_in_anti_tTG_IgG":"56.6% IgG1+ in symptomatic CD (Agardh 2005)","mucosal_deposit_sensitivity_in_SNCD":"100% in adults (Salmi 2006)","estimated_multiplicative_reduction_DQ8_plus_IgG1def":"<2% of DQ2.5 baseline, below detection threshold","Hietikko_plasma_cell_serum_correlation":"rS=0.69"},"heterogeneity_notes":"This is an integrative synthesis rather than a traditional meta-analysis. The three models draw from different research domains (structural immunology, B-cell biology, mucosal immunology) that have never been connected in published literature. Key quantitative estimates (50-70% reduction per mechanism) are extrapolated from indirect evidence rather than directly measured in DQ8-only cohorts. The pIgR paradox provides internal consistency check favoring Model A over Model C. The most critical limitation is that no single study has simultaneously examined HLA genotype, IgG subclass levels, and mucosal deposit characteristics in the same seronegative CD cohort."}}
