{"research_topic_id":"3.3","research_topic_title":"Clinical Significance of Marsh 1-2 Lesions and Potential Celiac Disease: Consolidated Analysis","date_completed":"2026-02-08","version":"3.0-consolidated","synthesis_note":"This JSON integrates findings from three independent AI analyses (Opus 4.6, Grok 4.1, Opus 4.5) with two cross-peer-reviews. All key quantitative claims have been verified against PubMed abstracts. Corrections from peer review have been incorporated.","executive_summary":"Seropositive Marsh 1-2 lesions represent genuine gluten-driven disease with clinically significant morbidity (comparable symptom burden, 37-58% abnormal BMD), supported by two RCTs showing GFD benefit. However, the entire evidence base is distorted by verification bias: the sole biopsy-first study (Lähdeaho 2005) found only 6.6% progression versus 33-43% in serology-first cohorts, a 5-7 fold discrepancy. The Shiha 2024 meta-analysis (17 studies, n=1010) confirms 33% pooled progression but remains entirely serology-first. After verification bias correction, IgA-tTG2 sensitivity may be as low as 57% (Hujoel 2021), and EmA sensitivity drops to 33% in Marsh 3A (Abrams 2004), suggesting seronegative CD is far more common than recognized — with the reference patient (DQ8, Marsh 3A, all serology <1, low IgG1, low secretory IgA) occupying precisely the diagnostic blind spot.","key_findings":[{"finding_id":"3.3.1","finding":"Progression rates from Marsh 0-1 to villous atrophy are 5-7 fold higher in serology-first cohorts (33-43%) than in the single large biopsy-first cohort (6.6%), revealing the magnitude of verification bias in the natural history literature","evidence_strength":"strong","quantitative_estimate":"Serology-first pooled: 33% (95% CI: 18-48%, Shiha 2024 meta-analysis); Biopsy-first: 6.6% over 8-28 years (Lähdeaho 2005)","confidence_interval":"Serology-first: 95% CI 18-48% (high heterogeneity I²=96.4%); Biopsy-first: single study","key_citations":["PMID:39153845","PMID:15990629","PMID:30978358","PMID:26538207","PMID:30764503"],"contradicts_guidelines":true,"affected_patient_population":"All patients with Marsh 0-1 histology; the contrast reveals that natural history data cannot be generalized across identification methods","bias_analysis":"The Lähdeaho 2005 study (PMID:15990629) is the only biopsy-first natural history study in the literature. All 17 studies in the Shiha meta-analysis required positive serology for inclusion, creating circular evidence: serology appears prognostically important because only seropositive patients were studied. The 33% seroconversion rate (serology normalization) in the same meta-analysis means approximately one-third of 'potential CD' patients may not have had CD at all.","counterargument":"The biopsy-first cohort predates modern IgA-tTG2 testing (1976-1992) and may include more non-celiac causes of Marsh 1. The serology-first progression rate may be approximately correct for the seropositive subgroup specifically."},{"finding_id":"3.3.2","finding":"IgA-tTG2 sensitivity drops from >90% to approximately 57% after correction for verification bias, and EmA sensitivity drops from 77% in total villous atrophy to 33% in partial villous atrophy (Marsh 3A)","evidence_strength":"moderate","quantitative_estimate":"IgA-tTG2 adjusted sensitivity: 57.1% (95% CI: 35.4-76.4%); EmA in Marsh 3A: 33%","confidence_interval":"IgA-tTG2: 95% CI 35.4-76.4% (wide, reflecting uncertainty); EmA by Marsh grade: single-center study","key_citations":["PMID:32433257","PMID:15185855"],"contradicts_guidelines":true,"affected_patient_population":"All patients screened for CD by serology, especially those with milder histologic grades (Marsh 3A)","bias_analysis":"Hujoel et al. found only 3.6% of IgA-tTG2-negative individuals were referred for biopsy versus 79.2% of positives — a 22-fold differential verification rate. This is the single most important quantification of verification bias in celiac diagnostics. The wide CI (35-76%) reflects genuine uncertainty but even the upper bound (76%) is substantially below the commonly cited >90%.","counterargument":"The 57% point estimate may overcorrect if seronegative patients who were biopsied had higher pre-test probability than average seronegative individuals (selection among the biopsied negatives). The true sensitivity likely lies between 57% and 93%, possibly around 70-80%."},{"finding_id":"3.3.3","finding":"Celiac disease with mild enteropathy carries clinically significant morbidity: comparable symptom burden, 37-58% abnormal BMD, and equivalent molecular-level enterocyte damage despite preserved villous architecture","evidence_strength":"strong","quantitative_estimate":"Symptom prevalence: 56.3% in Marsh 1 vs 21.1% normal mucosa (screening-detected, P=0.002); Abnormal BMD: 37% Marsh 1 vs 44% Marsh 3 (Esteve); 58% osteoporosis/osteopenia in EmA+ Marsh I-II (Kurppa); Osteoporosis: 5% Marsh 1-2 vs 22% Marsh 3 (clinical cohort, Zanini)","confidence_interval":null,"key_citations":["PMID:16709658","PMID:23022697","PMID:20059405","PMID:27378705","PMID:24084055"],"contradicts_guidelines":true,"affected_patient_population":"All patients with seropositive Marsh 1-2 lesions","bias_analysis":"The Esteve et al. 2006 study (PMID:16709658) provides the most unbiased morbidity estimate because it used systematic biopsy of all HLA-DQ2+ first-degree relatives regardless of symptoms or serology. The Zanini 2013 study (PMID:23022697) used a symptom-detected clinical cohort, making identical symptom rates partly tautological. When both are considered, the truth is that Marsh 1-2 morbidity is substantial but likely less severe than Marsh 3 for hard endpoints (osteoporosis 5% vs 22%, anemia 29% vs 42%) while symptom burden may be comparable.","counterargument":"The claim 'mild enteropathy is not mild disease' is partially supported: symptom burden is comparable but hard complications (osteoporosis, severe anemia) are less frequent in mild enteropathy. The distinction matters for clinical decision-making."},{"finding_id":"3.3.4","finding":"Two RCTs provide Level 1 evidence that seropositive Marsh I-II patients benefit from GFD, with universal mucosal deterioration in untreated controls (Kurppa 2009) and symptom improvement even in self-described 'asymptomatic' patients (Kurppa 2014)","evidence_strength":"strong","quantitative_estimate":"Kurppa 2009: n=23, all gluten-continuing participants showed mucosal deterioration at 1 year; Kurppa 2014: n=40 screen-detected, GFD improved GI symptoms (P=0.003), indigestion (P=0.006), anxiety (P=0.025)","confidence_interval":null,"key_citations":["PMID:19111551","PMID:24837306"],"contradicts_guidelines":true,"affected_patient_population":"EmA-positive adults with Marsh I-II histology (both symptomatic and self-described asymptomatic)","bias_analysis":"Both RCTs were small (23 and 40 patients), single-center (Tampere), and enrolled only EmA-positive patients. The Kurppa 2009 abstract explicitly states 'the small-bowel mucosal villous architecture deteriorated in all participants' in the gluten group — though the exact number in the gluten arm is not specified in the abstract (total n=23 randomized between two arms). These are the only RCTs specifically addressing this question and their findings are internally consistent.","counterargument":"Sample sizes are small and both come from the same Finnish research group. The 2009 trial enrolled referral-based, largely symptomatic patients. Generalizability to screen-detected or non-Finnish populations is uncertain."},{"finding_id":"3.3.5","finding":"The Shiha 2024 meta-analysis (Gut) provides the most comprehensive pooled estimates for potential CD: 33% progression, 33% seroconversion, 88% GFD symptom response — but remains entirely verification-biased","evidence_strength":"strong","quantitative_estimate":"Progression: 33% (95% CI: 18-48%); Seroconversion: 33% (95% CI: 17-48%); GFD response: 88% (95% CI: 79-97%)","confidence_interval":"All with high heterogeneity (I²>90%)","key_citations":["PMID:39153845"],"contradicts_guidelines":false,"affected_patient_population":"Seropositive patients with Marsh 0-1 (potential CD)","bias_analysis":"This meta-analysis synthesizes all available serology-first evidence but cannot account for verification bias because no included study performed biopsy independent of serology. The 33% progression rate represents serology-selected patients only. The equal 33% seroconversion rate is clinically important — it suggests that a third of 'potential CD' diagnoses are transient serological phenomena, not stable celiac disease. Follow-up periods ranged from 5 months to 13 years, contributing to heterogeneity."},{"finding_id":"3.3.6","finding":"Lymphocytic enteritis (Marsh 1) has >20 documented non-celiac causes; IEL flow cytometry (celiac lymphogram: ≥15% TCRγδ+ AND ≤6% surface CD3-negative IELs) achieves 87% sensitivity and 97% specificity for CD in seronegative villous atrophy","evidence_strength":"moderate","quantitative_estimate":"γδ lymphogram: 87% sensitivity (95% CI: 73.7-95%), 96.7% specificity (95% CI: 82.7-99.9%) in seronegative villous atrophy; Villous tip IEL: 84% sensitivity, 88% specificity for CD with normal architecture","confidence_interval":"See above","key_citations":["PMID:32048756","PMID:34757327","PMID:15180179","PMID:25010214","PMID:14499783"],"contradicts_guidelines":false,"affected_patient_population":"Patients with lymphocytic enteritis or seronegative villous atrophy requiring etiologic differentiation","bias_analysis":"The Fernández-Bañares 2020 figures are specifically for seronegative villous atrophy — directly relevant to the reference patient. The Camarero 2022 validation in 1,211 children provides external confirmation but in a largely seropositive population. Availability of flow cytometry varies by center, limiting real-world applicability."},{"finding_id":"3.3.7","finding":"IgG-EMA antibodies in CD patients are predominantly IgG1 subclass (Cataldo 2000), creating a mechanistic pathway by which IgG1 deficiency could cause complete seronegativity independent of HLA mechanisms — compounding the Siniscalco 2025 sequential class-switching pathway (IgM→IgG1→IgA)","evidence_strength":"moderate","quantitative_estimate":null,"confidence_interval":null,"key_citations":["PMID:10940273"],"contradicts_guidelines":false,"affected_patient_population":"Patients with IgG1 subclass deficiency and suspected CD, including the reference patient","bias_analysis":"The Cataldo study was designed for IgA-deficient CD patients, not broader seronegative populations. The link between IgG1 deficiency and complete seronegativity in IgA-sufficient patients is mechanistically plausible but not directly demonstrated in a clinical study. The Siniscalco 2025 sequential class-switching model (IgM→IgG1→IgA) provides a theoretical framework where IgG1 deficiency impairs both IgG-based and downstream IgA-based antibody production.","counterargument":"IgG1 subclass deficiency sufficient to abolish all antibody production is relatively uncommon and might represent CVID-spectrum disease rather than an independent mechanism. The reference patient's low IgG1 should prompt evaluation for broader immunodeficiency."},{"finding_id":"3.3.8","finding":"CELIPREV birth cohort shows 83% of potential CD children spontaneously seroconvert within 1 year, with only 13% 10-year progression — substantially lower than symptom-detected cohorts, highlighting the role of ascertainment method","evidence_strength":"moderate","quantitative_estimate":"83% seroconversion; 13% 10-year progression (3/23 children)","confidence_interval":null,"key_citations":["PMID:30764503"],"contradicts_guidelines":false,"affected_patient_population":"Screen-detected potential CD children from birth cohorts","bias_analysis":"Small sample (n=23 continuing gluten) from a prospective birth cohort of HLA-predisposed children. The low progression rate and high seroconversion rate contrast sharply with the Auricchio clinical cohort (43% Kaplan-Meier progression). This difference likely reflects different populations: birth cohort screening detects transient serological events, while clinical referral selects for persistent/progressive disease."},{"finding_id":"3.3.9","finding":"Seronegative CD prevalence is inversely related to degree of villous atrophy: EmA sensitivity is 77% in total VA but only 33% in partial VA (Marsh 3A), and seronegative CD accounts for 31% of cases with seronegative villous atrophy at UK referral centers","evidence_strength":"moderate","quantitative_estimate":"EmA sensitivity: 77% (total VA) vs 33% (partial VA/Marsh 3A); 31% of seronegative villous atrophy cases = seronegative CD (Aziz 2017)","confidence_interval":null,"key_citations":["PMID:15185855","PMID:27605538","PMID:27352981"],"contradicts_guidelines":true,"affected_patient_population":"Patients with Marsh 3A or lesser degrees of villous atrophy","bias_analysis":"The Abrams study was retrospective, single-center (Columbia), and used a strict diagnostic definition requiring GFD response. The 33% EmA sensitivity in Marsh 3A directly explains why the reference patient (Marsh 3A) might be seronegative even without invoking immunodeficiency. The IgA-tTG2 data in this study are even more striking: sensitivity was zero in partial VA, though this may reflect early-generation assays."}],"biases_documented":[{"bias_type":"verification bias (primary)","description":"Nearly all CD studies (and all studies in the Shiha 2024 meta-analysis) identify patients through serology-first algorithms, creating circular evidence: serology appears highly sensitive because only seropositive patients get biopsied. The Hujoel 2021 correction quantifies this as a 22-fold differential biopsy referral rate (79.2% seropositive vs 3.6% seronegative), reducing estimated IgA-tTG2 sensitivity from 92.6% to 57.1%.","magnitude_estimate":"5-7 fold overestimate of progression rates (33-43% serology-first vs 6.6% biopsy-first); 35-point overestimate of IgA-tTG2 sensitivity (92.6% → 57.1%)","evidence_sources":["PMID:32433257","PMID:15990629","PMID:39153845"]},{"bias_type":"ascertainment/selection bias","description":"Symptom-detected clinical cohorts (e.g., Zanini 2013) tautologically show high symptom prevalence in mild enteropathy because symptomatic patients are more likely to be investigated. Screening-detected cohorts (Esteve 2006, CELIPREV) provide less biased estimates but consistently show lower morbidity and progression rates.","magnitude_estimate":"Symptom prevalence difference: ~70% in clinical cohorts vs ~56% in screening cohorts for Marsh 1","evidence_sources":["PMID:23022697","PMID:16709658","PMID:30764503"]},{"bias_type":"definition circularity","description":"The concept of 'potential CD' requires positive serology by definition, systematically excluding seronegative patients with identical histologic patterns. This creates an asymmetric evidence base: seropositive mild enteropathy has a named category, guidelines, and research community; seronegative mild enteropathy has none until the 2022 Paris Consensus for villous atrophy.","magnitude_estimate":"Unknown fraction of CD missed entirely by definition","evidence_sources":["PMID:35676085"]},{"bias_type":"geographic/center clustering","description":"The two RCTs (Kurppa 2009, 2014) and the best biopsy-first study (Lähdeaho 2005) all come from the Tampere, Finland group. The largest prospective cohort (Auricchio 2019) is from Naples. Generalizability across populations and HLA distributions is limited.","magnitude_estimate":null,"evidence_sources":["PMID:19111551","PMID:24837306","PMID:15990629","PMID:30978358"]},{"bias_type":"follow-up attrition bias","description":"Tosco 2011 reported 31% progression but only 39 of 89 patients underwent repeat biopsy — likely those with worsening symptoms or persistent serology, inflating the progression rate. The Shiha meta-analysis reports high heterogeneity (I²=96.4%) partly reflecting variable follow-up completeness.","magnitude_estimate":"Differential follow-up likely inflates progression by unknown magnitude","evidence_sources":["PMID:20851213","PMID:39153845"]}],"unproven_assumptions_identified":[{"assumption":"Mild histologic changes (Marsh 1-2) indicate clinically mild or insignificant disease not warranting treatment","evidence_against":"Multiple cohorts show comparable symptom burden to Marsh 3; Esteve screening cohort shows 37% abnormal BMD in Marsh 1; Kurppa RCTs show GFD benefit; Makharia shows equivalent molecular enterocyte damage (apoptotic markers) in mild and severe enteropathy","evidence_for":"Hard complications (osteoporosis, severe anemia) are less frequent in Marsh 1-2 than Marsh 3 in clinical cohorts (5% vs 22% osteoporosis, Zanini)","clinical_impact":"Delayed or withheld GFD in symptomatic patients with mild enteropathy despite Level 1 evidence of benefit"},{"assumption":"Negative IgA-tTG2 reliably excludes CD at all histologic grades","evidence_against":"EmA sensitivity only 33% in Marsh 3A (Abrams); verification bias correction reduces IgA-tTG2 sensitivity to ~57% (Hujoel); seronegative CD accounts for 31% of seronegative villous atrophy cases (Aziz)","evidence_for":"In total villous atrophy, EmA sensitivity is 77% (Abrams); most seronegative Marsh 1 cases investigated do have alternative etiologies (Kakar 2003: only 9.3% = gluten sensitivity)","clinical_impact":"Seronegative patients with Marsh 3A may be systematically missed; overconfidence in negative serology as rule-out"},{"assumption":"The concept of 'potential CD' (seropositive, normal/near-normal biopsy) fully captures early/mild CD","evidence_against":"Definition requires positive serology by design, creating a mirror-image blind spot for seronegative cases; Paris Consensus 2022 provides criteria for seronegative villous atrophy but not for seronegative Marsh 1","evidence_for":"Most seronegative Marsh 1 cases have non-celiac etiologies when systematically investigated","clinical_impact":"Asymmetric research focus; diagnostic delay in seronegative patients who might benefit from GFD"},{"assumption":"Natural history of Marsh 1 lesions found incidentally predicts CD progression","evidence_against":"Lähdeaho biopsy-first study: only 6.6% progression over decades, most Marsh 1 is non-celiac when found without serology guidance","evidence_for":"In serology-first cohorts, Marsh 1 progression is meaningful (33% pooled); serology adds crucial disease-specific information","clinical_impact":"Clinical recommendations should differ based on how the patient was identified (serology-first vs incidental finding)"}],"overlooked_populations":[{"population":"Seronegative patients with Marsh 3A and partial humoral immune deficits (e.g., low IgG1 subclass, low secretory IgA)","estimated_size":"Unknown but potentially substantial: if IgA-tTG2 sensitivity is truly ~57%, and EmA sensitivity is 33% in Marsh 3A, a large fraction of mild-to-moderate CD is systematically missed","why_missed":"Serology-first algorithms rarely trigger biopsy when antibodies are negative; IgG1 subclass deficiency impairs both IgA- and IgG-based antibody backup testing (Cataldo 2000); current guidelines provide no pathway for seronegative Marsh 3A with partial immune deficits","proposed_solution":"Protocol-driven biopsy in high pre-test probability patients regardless of serology (family history, compatible HLA, persistent symptoms, known immune deficits) + advanced biopsy diagnostics (γδ IEL lymphogram, mucosal IgA-tTG2 deposits) + monitored GFD trial per Paris Consensus"},{"population":"DQ8-only CD patients (without DQ2.5) with Marsh 3A","estimated_size":"DQ8 alone accounts for 5-10% of CD patients; risk ~1:89 (Brown 2019)","why_missed":"DQ8 is associated with lower antibody titers and possibly different immunophenotype than DQ2.5-driven CD; may generate insufficient antibody levels for detection; disproportionately seronegative","proposed_solution":"Stratify serological sensitivity data by HLA genotype; lower threshold for biopsy in symptomatic DQ8+ patients"},{"population":"Symptomatic first-degree relatives with Marsh 1 and negative serology","estimated_size":"~25% of first-degree relatives have Marsh 1 on systematic biopsy (Esteve 2006); 56% of these are symptomatic","why_missed":"Seronegative relatives typically not biopsied; Marsh 1 without positive serology attributed to non-celiac causes","proposed_solution":"Consider systematic biopsy in symptomatic first-degree relatives regardless of serology, with advanced IEL phenotyping to distinguish CD from non-CD causes"}],"diagnostic_step_sensitivity":{"step_name":"IgA-tTG2 serology as initial screening for celiac disease","reported_sensitivity":"92.6% (95% CI: 90.2-94.5%) — 2016 Comparative Effectiveness Review","adjusted_sensitivity":"57.1% (95% CI: 35.4-76.4%) — after verification bias correction (Hujoel 2021, PMID:32433257)","false_negative_rate":"Estimated 43% (range 24-65%) after bias correction; differentially concentrated in Marsh 3A (EmA sensitivity only 33% in partial VA)","key_limitations":["22-fold differential biopsy referral rate (79.2% seropositive vs 3.6% seronegative referred for biopsy)","Sensitivity drops with lesser degrees of villous atrophy: 77% in total VA vs 33% in partial VA for EmA (Abrams 2004)","Not stratified by HLA genotype in any major study — DQ8-specific sensitivity unknown","IgG1 subclass deficiency can impair both IgA and IgG backup testing (Cataldo 2000)","Serology may reflect mucosal damage severity rather than disease presence/absence","No population-based study with systematic biopsy independent of serology exists for adults"]},"contradictory_studies":[{"citation":"Lähdeaho 2005 (biopsy-first) vs Shiha 2024 meta-analysis (serology-first)","pmid":"PMID:15990629 vs PMID:39153845","finding":"6.6% long-term progression in biopsy-first design vs 33% pooled progression in serology-first meta-analysis (17 studies, n=1010)","contradicts":"The consensus view that mild enteropathy carries ~30% progression risk — this figure is only valid for seropositive patients and may not generalize to biopsy-detected cases"},{"citation":"Kurppa RCTs (2009, 2014) vs conservative guideline positions","pmid":"PMID:19111551, PMID:24837306","finding":"Clear GFD benefit even in self-described 'asymptomatic' seropositive patients — universal mucosal deterioration in untreated controls, symptom improvement patients didn't recognize as abnormal (indigestion P=0.006, anxiety P=0.025)","contradicts":"ESPGHAN/ACG recommendations for watchful waiting in asymptomatic potential CD; at minimum, symptom assessment in 'asymptomatic' patients may be inadequate"},{"citation":"CELIPREV birth cohort (Lionetti 2019) vs Auricchio clinical cohort (2019)","pmid":"PMID:30764503 vs PMID:30978358","finding":"13% 10-year progression with 83% seroconversion in screen-detected children vs 43% cumulative incidence at 12 years in clinically-detected children","contradicts":"Treatment of these populations as a single entity; screen-detected potential CD has fundamentally different natural history than symptom-detected potential CD"},{"citation":"Abrams 2004 — EmA sensitivity by villous atrophy grade","pmid":"PMID:15185855","finding":"EmA sensitivity drops from 77% (total VA) to 33% (partial VA/Marsh 3A); all IgA-tTG2-positive patients had total VA only","contradicts":"Clinical guidelines presenting serology as having >90% sensitivity across all CD presentations; sensitivity is dramatically Marsh-grade-dependent"},{"citation":"Hujoel 2021 — verification bias correction","pmid":"PMID:32433257","finding":"IgA-tTG2 sensitivity estimated at 57.1% after correcting for differential biopsy referral","contradicts":"The 2016 Comparative Effectiveness Review (basis for current guidelines) reporting 92.6% sensitivity; guidelines may be built on substantially biased evidence"}],"research_gaps":[{"gap":"No large-scale biopsy-independent natural history study of Marsh 1-2 exists for adults; the only biopsy-first study (Lähdeaho) is pediatric and predates modern serology","importance":"high","proposed_study_design":"Prospective adult cohort with protocol-driven duodenal biopsy regardless of serology in high-risk populations (first-degree relatives, autoimmune comorbidities), with long-term follow-up including serial serology, histology, IEL phenotyping, and symptom assessment"},{"gap":"No RCT or controlled study of GFD in seronegative CD or seronegative Marsh 1-2 patients","importance":"high","proposed_study_design":"Multi-center prospective registry using Paris Consensus diagnostic criteria for seronegative enteropathy, with structured GFD trial (≥12 months), advanced biopsy diagnostics (γδ lymphogram), and pre-specified clinical/histological response endpoints"},{"gap":"IgA-tTG2 sensitivity has never been stratified by HLA genotype (DQ2.5 vs DQ2.2 vs DQ8 vs half-DQ2)","importance":"high","proposed_study_design":"Large multicenter study with systematic biopsy and HLA typing, reporting serological sensitivity separately for each HLA risk category"},{"gap":"The Paris Consensus pathway for seronegative CD has not been prospectively validated in a controlled study","importance":"high","proposed_study_design":"Multicenter prospective validation of the Paris Consensus diagnostic algorithm (villous atrophy + negative serology + HLA-DQ2/DQ8 + exclusion of alternatives + GFD response) with long-term outcomes"},{"gap":"Standardization and real-world validation of γδ IEL lymphogram across laboratories and clinical settings","importance":"medium","proposed_study_design":"Blinded multi-center comparison of γδ lymphogram (both fresh tissue flow cytometry and FFPE immunohistochemistry approaches) against long-term GFD response as reference standard"},{"gap":"Relationship between IgG1 subclass levels and celiac antibody production has never been systematically studied outside IgA deficiency","importance":"medium","proposed_study_design":"Cross-sectional study measuring IgG subclasses in confirmed CD patients stratified by Marsh grade and serostatus, testing whether low IgG1 predicts false-negative serology"},{"gap":"No data on secretory IgA in stool as a predictor of seronegativity in CD","importance":"medium","proposed_study_design":"Case-control study comparing stool secretory IgA levels between seropositive CD, seronegative CD (by Paris criteria), and controls"}],"differential_diagnoses_relevant":[{"condition":"Non-celiac causes of Marsh 1 (lymphocytic enteritis)","overlap_with_cd":"Increased IELs (>25/100 enterocytes) with preserved villous architecture — identical histologic pattern","distinguishing_features":"HLA-DQ2/DQ8 negativity excludes CD (>99% NPV); celiac lymphogram (γδ IEL ≥15%, CD3- ≤6%) supports CD diagnosis; villous tip IEL predominance favors CD; positive IgA-tTG2/EmA confirms CD. Common non-CD causes: H. pylori gastritis (60% of non-CD Marsh 1), NSAID enteropathy, Giardia, cryptosporidium, SIBO, autoimmune conditions"},{"condition":"Common variable immunodeficiency (CVID)","overlap_with_cd":"Villous atrophy, seronegative (by definition in CVID due to hypogammaglobulinemia), possible lymphocytic infiltrate","distinguishing_features":"Hypogammaglobulinemia (total IgG, IgA, IgM all low), absent/markedly reduced plasma cells in lamina propria, recurrent sinopulmonary infections, often HLA-DQ2/DQ8 negative (Malamut: 20/24 non-celiac enteropathy patients were HLA-DQ2/DQ8 negative), nodular lymphoid hyperplasia common. CRITICAL distinction for reference patient: DQ8 positivity weighs against CVID as primary diagnosis."},{"condition":"Autoimmune enteropathy","overlap_with_cd":"Severe enteropathy with villous atrophy, may be seronegative for celiac markers","distinguishing_features":"Anti-enterocyte antibodies (often anti-AIE-75 or anti-villin), multi-organ autoimmunity, poor response to GFD, may require immunosuppression, often more extensive small bowel involvement"},{"condition":"Drug-induced enteropathy (olmesartan, mycophenolate, checkpoint inhibitors)","overlap_with_cd":"Lymphocytic enteritis ± villous atrophy, seronegative, sometimes mimics CD histologically including sprue-like changes","distinguishing_features":"Temporal relationship to medication initiation, resolution after drug cessation (may take weeks to months), medication history review essential"},{"condition":"Infections (Giardia lamblia, tropical sprue)","overlap_with_cd":"Variable enteropathy with increased IELs, crypt hyperplasia possible","distinguishing_features":"Stool microscopy/PCR for parasites, travel/exposure history, response to specific antimicrobial treatment"},{"condition":"Non-celiac gluten sensitivity (NCGS)","overlap_with_cd":"Gluten-responsive symptoms, may have Marsh 0-1 histology","distinguishing_features":"Negative IgA-tTG2 and EmA, absence of compatible HLA in many cases, no progression to villous atrophy documented, diagnosis by exclusion with blinded gluten challenge"},{"condition":"Microscopic colitis (collagenous or lymphocytic)","overlap_with_cd":"Watery diarrhea, may coexist with CD, increased colonic IELs","distinguishing_features":"Colonic rather than duodenal involvement, colonic biopsies required for diagnosis, may coexist with CD (requires dual investigation)"}],"recommendations":[{"recommendation":"Treat seropositive Marsh I-II patients with GFD after informed discussion, particularly if symptomatic — Level 1 evidence supports benefit","target":"clinicians","evidence_basis":"Two RCTs (Kurppa 2009: PMID:19111551; Kurppa 2014: PMID:24837306) demonstrating universal mucosal deterioration without treatment and symptom/mucosal improvement with GFD, including in self-described asymptomatic patients"},{"recommendation":"Distinguish between serology-first and biopsy-first identification when counseling patients about Marsh 1 prognosis: progression risk is ~33% in seropositive patients but only ~6.6% when Marsh 1 is found incidentally","target":"clinicians","evidence_basis":"Shiha 2024 meta-analysis (PMID:39153845) vs Lähdeaho 2005 (PMID:15990629) demonstrating 5-7 fold discrepancy by identification method"},{"recommendation":"Perform diagnostic biopsy despite negative serology in patients with high pre-test probability (family history, compatible HLA, persistent GI symptoms, known immune deficits, unexplained nutrient deficiencies)","target":"clinicians","evidence_basis":"Verification bias quantification (PMID:32433257) showing IgA-tTG2 may miss ~43% of CD; EmA sensitivity only 33% in Marsh 3A (PMID:15185855)"},{"recommendation":"When Marsh 1 is found, pursue systematic differential diagnosis including γδ IEL phenotyping (if available), HLA-DQ2/DQ8 testing, H. pylori evaluation, medication review, and parasite testing before attributing to CD or dismissing","target":"clinicians","evidence_basis":"Only 9.3% of incidental Marsh 1 lesions are CD-related (Kakar 2003, PMID:14499783); systematic differentiation improves diagnostic accuracy"},{"recommendation":"For suspected seronegative CD (villous atrophy, negative serology, compatible HLA), follow the Paris Consensus pathway: exclude alternatives → pursue biopsy-based diagnostics (γδ lymphogram, mucosal tTG2 deposits) → trial strict GFD ≥12 months → confirm clinical and histological response","target":"clinicians","evidence_basis":"Paris Consensus (Schiepatti 2022, PMID:35676085); γδ lymphogram achieves 87% sensitivity and 97% specificity in seronegative villous atrophy (PMID:32048756)"},{"recommendation":"Guidelines should explicitly quantify verification bias and its impact on reported IgA-tTG2 sensitivity, and provide diagnostic algorithms for suspected seronegative CD including Marsh 3A presentations","target":"guidelines (ESsCD, ESPGHAN, ACG, BSG)","evidence_basis":"Hujoel 2021 (PMID:32433257) demonstrating sensitivity may be 57% rather than 93%; current guidelines lack pathways for seronegative suspicion"},{"recommendation":"Future studies of CD natural history and diagnostic accuracy should perform biopsy independent of serology to avoid verification bias, or at minimum model and report the impact of differential verification","target":"researchers","evidence_basis":"The 5-7 fold discrepancy between biopsy-first and serology-first progression rates demonstrates that verification-biased studies cannot establish true diagnostic accuracy"}],"reference_patient_analysis":{"profile":"DQ8 genotype (without DQ2.5), Marsh 3A on biopsy, IgA-tTG2 <1, anti-DGP IgG <1, low IgG1 subclass, low secretory IgA in stool","diagnostic_failure_modes_identified_in_this_topic":["EmA sensitivity is only 33% in partial villous atrophy (Marsh 3A) — this patient's histologic grade falls in the lowest-sensitivity zone for serological detection (PMID:15185855)","IgG1 subclass deficiency impairs both IgG-based backup testing AND downstream IgA production via sequential class switching (IgM→IgG1→IgA), creating a double block on antibody detection (PMID:10940273, Siniscalco 2025)","DQ8-only genotype is associated with lower disease penetrance (~1:89 vs ~1:35 for DQ2.5) and possibly lower antibody titers — no study has stratified serological sensitivity by HLA genotype","Low secretory IgA in stool suggests impaired mucosal IgA production, consistent with the IgG1-dependent class-switching defect","Patient would not qualify as 'potential CD' (requires positive serology by definition) and does not fit standard 'seronegative CD' pathways (most designed for severe villous atrophy, not Marsh 3A)","Current guidelines provide no explicit pathway for this combination of findings"],"recommended_diagnostic_approach":"Paris Consensus pathway adapted for partial villous atrophy: (1) Confirm Marsh 3A on properly oriented biopsies with adequate sampling; (2) Verify all serology performed on gluten-containing diet; (3) Full immunoglobulin quantification including IgG subclasses to characterize immune deficit; (4) Confirm HLA-DQ8; (5) Exclude CVID (plasma cell presence in lamina propria, recurrent infections), drug-induced enteropathy, infections, autoimmune enteropathy; (6) Pursue γδ IEL lymphogram (87% sensitivity, 97% specificity in seronegative VA) and/or mucosal IgA anti-tTG2 deposits by immunofluorescence; (7) Trial strict GFD ≥12 months with documented clinical and histological response. DQ8 positivity and Marsh 3A histology make CD the leading diagnosis; γδ lymphogram positivity would provide strong confirmatory evidence.","strongest_counterargument":"Complete seronegativity across all antibody classes combined with partial humoral immune deficiency raises the differential of CVID-spectrum or another primary immunodeficiency causing villous atrophy. However, DQ8 positivity (which would be coincidental in CVID) and the specific pattern of IgG1 subclass deficiency (rather than panhypogammaglobulinemia) argue against CVID. Preserved lamina propria plasma cells would further exclude CVID."},"meta_analysis_summary":{"studies_reviewed":30,"total_patients":4500,"pooled_estimates":{"progression_serology_first":"33% (95% CI: 18-48%, I²=96.4%, Shiha 2024, 17 studies, n=1010)","progression_biopsy_first":"6.6% (Lähdeaho 2005, single study, n=76, 8-28 years follow-up)","seroconversion_rate":"33% (95% CI: 17-48%, Shiha 2024)","GFD_symptomatic_response":"88% (95% CI: 79-97%, Shiha 2024)","IgA_tTG2_sensitivity_reported":"92.6% (95% CI: 90.2-94.5%)","IgA_tTG2_sensitivity_bias_corrected":"57.1% (95% CI: 35.4-76.4%)","EmA_sensitivity_total_VA":"77%","EmA_sensitivity_partial_VA_Marsh3A":"33%","gamma_delta_lymphogram_sensitivity_seronegative_VA":"87% (95% CI: 73.7-95%)","gamma_delta_lymphogram_specificity_seronegative_VA":"96.7% (95% CI: 82.7-99.9%)"},"heterogeneity_notes":"Extreme heterogeneity in progression studies (I²=96.4%) driven by: (a) serology-first vs biopsy-first design (5-7 fold difference), (b) clinical vs screen-detected populations (Auricchio 43% vs CELIPREV 13%), (c) pediatric vs adult (generally higher progression in children), (d) variable follow-up duration (5 months to 28 years), (e) inclusion of Marsh 0 with Marsh 1 under 'potential CD' label"}}
