{"research_topic_id":"3.4","research_topic_title":"IgA Deficiency in Celiac Disease—Critical Evaluation of IgG Backup Testing, Measurement Assumptions, and Combined Immunodeficiency","date_completed":"2026-02-08","version":"3.0 — Bias-corrected, peer-reviewed","executive_summary":"Selective IgA deficiency (SIgAD, <0.07 g/L) occurs in 2–3% of celiac disease patients. In complete SIgAD, IgA-tTG2 is undetectable by logical necessity, requiring IgG-based backup testing. However, all IgG test sensitivity estimates (75–98.7%) derive from small, verification-biased cohorts of known CD patients; true sensitivity in unselected populations is unknown and could be substantially lower. A foundational but unvalidated assumption underlies current algorithms: that serum IgA measurement predicts mucosal IgA-tTG2 production capacity — yet O'Mahony et al. (1991) demonstrated dissociation between systemic and mucosal humoral immune responses in CD, and no study has directly correlated serum IgA with secretory IgA or IgA-tTG2 generation. For patients with combined IgA and IgG1 subclass deficiency, the entire serological safety net may collapse, since CD-associated IgG anti-tTG2 is predominantly IgG1 (Comerford 2015); the proposed 'triple-hit' model linking DQ8 genotype, IgG1 deficiency, and disrupted sequential IgM→IgG1→IgA class switching (Siniscalco 2025) is mechanistically plausible but requires empirical validation.","key_findings":[{"finding_id":"3.4.1","finding":"Prevalence of selective IgA deficiency in celiac disease is approximately 2–3%, representing a 10–15-fold increase over the general European population rate (~0.14–0.25%)","evidence_strength":"strong","quantitative_estimate":"2–3% in CD vs 0.14–0.25% general population","confidence_interval":null,"key_citations":["PMID:9577342","PMID:22476042","PMID:26412412","PMID:34347764"],"contradicts_guidelines":false,"affected_patient_population":"All CD patients","bias_assessment":"Well-established from multiple cohorts. Cataldo 1998 (n=2098) is a retrospective review of consecutively diagnosed CD patients from an era (pre-tTG2) when biopsy was required per ESPGHAN criteria, reducing but not eliminating verification bias — patients still needed to be selected for biopsy by some clinical criterion. Serology-first cohorts may underestimate SIgAD prevalence since IgA-deficient patients with false-negative IgA serology who were never biopsied are excluded.","patient_identification":"Cataldo 1998: retrospective review of hospital records of consecutively diagnosed CD patients in Italy. Study predates widespread tTG2 use; diagnosis required biopsy per ESPGHAN 1990 criteria. Not strictly 'biopsy-first' — patients were referred for biopsy through various clinical pathways, not systematically regardless of serology."},{"finding_id":"3.4.2","finding":"In complete SIgAD (<0.07 g/L), IgA-tTG2 will be undetectable because patients cannot produce IgA class antibodies. This is a logical necessity, not a 'false negative' — the test correctly reports absence of the analyte","evidence_strength":"logical necessity","quantitative_estimate":"0% IgA-tTG2 positivity expected","confidence_interval":null,"key_citations":[],"contradicts_guidelines":false,"affected_patient_population":"Complete SIgAD patients","bias_assessment":"Not an empirical claim; follows from the definition of SIgAD"},{"finding_id":"3.4.3","finding":"IgG-tTG2 sensitivity estimates in SIgAD range from 75–98.7% across studies, but ALL estimates derive from verification-biased cohorts of pre-identified CD patients. True sensitivity in unselected IgA-deficient symptomatic patients is UNKNOWN","evidence_strength":"weak (all estimates verification-biased)","quantitative_estimate":"Reported: 75–98.7%; True: Unknown","confidence_interval":"Villalta 2010 (n=34): IgG-tTG2 91.2% (95% CI 76.3–97.7%); manufacturer cutoffs 82.4% (66.1–92.0%). CIs are very wide due to small samples.","key_citations":["PMID:14570724","PMID:17490629","PMID:20022984"],"contradicts_guidelines":false,"affected_patient_population":"SIgAD with suspected CD","bias_assessment":"CRITICAL: Korponay-Szabó 2003 (n=78, PMID:14570724) tested 78 IgA-deficient patients with KNOWN biopsy-confirmed CD — a known-disease cohort. Villalta 2007 (n=20, PMID:17490629) used CD patients identified by ESPGHAN biopsy criteria. Villalta 2010 (n=34, PMID:20022984) similarly used pre-identified CD patients. In all cases, patients with negative IgG serology who were never biopsied are invisible to these studies. The commonly cited sensitivity range cannot be treated as a reliable estimate of real-world performance.","patient_identification":"All studies: biopsy-confirmed CD patients with known SIgAD. No study biopsied all SIgAD patients regardless of serology."},{"finding_id":"3.4.4","finding":"IgG-DGP sensitivity in SIgAD is reported as 80–93%, but from the same verification-biased designs and inadequate sample sizes. No valid comparison exists establishing IgG-DGP as superior or inferior to IgG-tTG2","evidence_strength":"weak (verification bias, small samples)","quantitative_estimate":"Reported: 80–93%; True: Unknown","confidence_interval":"Villalta 2010: IgG-DGP 88.2% (95% CI 72.8–95.9%)","key_citations":["PMID:17490629","PMID:20022984"],"contradicts_guidelines":false,"affected_patient_population":"SIgAD with suspected CD","bias_assessment":"Villalta 2007 head-to-head (n=20) showed IgG-tTG2 (best kit) 95% vs IgG-DGP 80%, but confidence intervals overlap completely at this sample size. The widely repeated claim that IgG-DGP is the 'preferred' backup test is based more on expert opinion and guideline recommendations than robust head-to-head evidence."},{"finding_id":"3.4.5","finding":"One Marsh 3A patient in Villalta 2007 was NEGATIVE on ALL IgG methods tested (IgG-tTG2, IgG-DGP, IgG-AGA) — demonstrating that complete IgG seronegativity occurs even in biopsy-confirmed SIgAD CD","evidence_strength":"moderate (single case but important)","quantitative_estimate":"1/20 (5%) completely seronegative in small sample","confidence_interval":null,"key_citations":["PMID:17490629"],"contradicts_guidelines":false,"affected_patient_population":"IgA-deficient CD patients with Marsh 3A","bias_assessment":"This patient was included because they had biopsy-confirmed CD. The finding directly demonstrates the IgG backup pathway can fail completely. No investigation was performed into WHY this patient was IgG-seronegative (IgG subclass? Mild histology? Assay limitation?)."},{"finding_id":"3.4.6","finding":"NO EVIDENCE EXISTS that partial IgA deficiency (0.07–0.7 g/L) causes false-negative IgA-tTG2 results. The Pallav 2016 finding of 100% sensitivity in 15 partial-deficient CD patients CANNOT be interpreted as evidence that partial deficiency is safe, because the cohort was identified BY positive IgA-tTG2 — patients with negative IgA-tTG2 would not have been biopsied and are absent from the sample","evidence_strength":"no valid evidence either direction","quantitative_estimate":null,"confidence_interval":null,"key_citations":["PMID:26412412"],"contradicts_guidelines":true,"affected_patient_population":"Partial IgA deficiency patients","bias_assessment":"Pallav 2016 reviewed 1000 consecutive patients tested with IgA-tTG2. The 15 partial-IgA-deficient CD patients were all IgA-tTG2 positive — but this is a necessary consequence of the study design (serology-first → biopsy), not evidence of adequate sensitivity. Whether partial IgA deficiency causes false negatives remains unanswerable from existing data."},{"finding_id":"3.4.7","finding":"The assumption that serum IgA measurement validates IgA-tTG2 test results has NEVER been empirically validated. Serum IgA (monomeric, IgA1-dominant, bone marrow-derived) and secretory IgA (dimeric, IgA2-enriched in gut, mucosally-produced) are biologically distinct. O'Mahony et al. (1991) demonstrated dissociation between systemic and mucosal humoral immune responses in CD","evidence_strength":"unvalidated assumption with contradicting evidence","quantitative_estimate":null,"confidence_interval":null,"key_citations":["PMID:1991635","PMID:1728531","PMID:2773754"],"contradicts_guidelines":true,"affected_patient_population":"All patients undergoing CD serology","bias_assessment":"O'Mahony 1991 (PMID:1991635) found that on GFD, serum IgA anti-gliadin fell to control levels while mucosal secretory anti-gliadin antibodies persisted — directly demonstrating dissociation between serum and mucosal humoral responses. Lavö 1992 (PMID:1728531) found positive correlation between serum and jejunal IgA-gliadin antibodies in active CD (p<0.01) but noted complete absence of jejunal secretory IgA in all 4 SIgAD patients. Blanco 1989 (PMID:2773754) showed serum IgA anti-gliadin is predominantly IgA1, suggesting systemic (not mucosal) origin. The correlation may hold in active disease with intact IgA but breaks down on GFD and in atypical IgA states. No study has validated that serum total IgA level specifically predicts IgA-tTG2 production capacity."},{"finding_id":"3.4.8","finding":"The <0.07 g/L threshold for selective IgA deficiency is a statistical definition (2 SD below mean), not a clinically validated cutoff for CD serology performance. No study has determined what serum IgA level actually predicts IgA-tTG2 test validity","evidence_strength":"arbitrary threshold","quantitative_estimate":"<0.07 g/L (statistical, not functional)","confidence_interval":null,"key_citations":[],"contradicts_guidelines":false,"affected_patient_population":"Patients near the IgA deficiency threshold","bias_assessment":"Consensus-based, not empirically optimized for CD serology interpretation. Patients just above threshold may or may not have adequate IgA-tTG2 production capacity."},{"finding_id":"3.4.9","finding":"CD-associated IgG anti-tTG2 antibodies are dominated by IgG1 subclass, distinguishing them from anti-tTG responses in other autoimmune conditions. IgG1 deficiency could therefore impair IgG-tTG2 and likely IgG-DGP detection, but this has NEVER been directly studied in CD patients","evidence_strength":"emerging/theoretical","quantitative_estimate":null,"confidence_interval":null,"key_citations":["PMID:26184652"],"contradicts_guidelines":false,"affected_patient_population":"Patients with IgG subclass deficiency","bias_assessment":"Comerford 2015 (PMID:26184652) established IgG1 dominance of anti-tTG2 in CD vs IgG2-IgG4 in other autoimmune conditions. Biologically plausible that IgG1 deficiency impairs detection, but NO published case reports or studies document IgG1 deficiency causing false-negative IgG-tTG2. This remains a hypothesis requiring empirical validation."},{"finding_id":"3.4.10","finding":"When IgG-tTG2 or IgG-DGP tests are negative in confirmed SIgAD + CD patients (the reported 5–25% 'false negatives'), NO investigation has been performed to determine WHY — potential mechanisms (IgG subclass deficiency, mild Marsh grade, assay limitations) remain unexplored","evidence_strength":"research gap","quantitative_estimate":"Reported false negative rate variable; mechanisms unexplored","confidence_interval":null,"key_citations":["PMID:17490629"],"contradicts_guidelines":false,"affected_patient_population":"IgG-seronegative SIgAD + CD patients"},{"finding_id":"3.4.11","finding":"Compliance with total IgA measurement when ordering CD serology is poor: 49% in McGowan 2008 (Canada), 66% physician compliance in ESPGHAN 2025 survey (28 countries). 46% of identified IgA-deficient patients in McGowan received no appropriate follow-up","evidence_strength":"strong","quantitative_estimate":"49–66% compliance depending on study and metric","confidence_interval":null,"key_citations":["PMID:18487281","PMID:40621676"],"contradicts_guidelines":true,"affected_patient_population":"All patients undergoing CD serology","bias_assessment":"The compliance gap is well-documented. However, the underlying rationale for the guideline (serum IgA validates IgA-tTG2) is itself based on an unproven assumption (finding 3.4.7)."},{"finding_id":"3.4.12","finding":"Automated reflex testing cascades (Mayo, ARUP, Labcorp) effectively address the compliance gap and are more cost-effective than full panels. Novel approaches using IgA-tTG2 assay background signal as proxy for total IgA show promise","evidence_strength":"strong","quantitative_estimate":"Cascades 268% less expensive than full panels (Bazyler & Breuel 2018); Mac Lochlainn 2017 proxy method: 100% sensitivity for SIgAD","confidence_interval":null,"key_citations":["PMID:28466499"],"contradicts_guidelines":false,"affected_patient_population":"All patients undergoing CD serology"},{"finding_id":"3.4.13","finding":"IEL flow cytometry (celiac lymphogram) offers antibody-independent diagnostic confirmation with pooled sensitivity ~93–98.5% and specificity ~97–98%, independent of immunoglobulin status or gluten ingestion","evidence_strength":"strong","quantitative_estimate":"93–98.5% sensitivity, 97–98% specificity","confidence_interval":null,"key_citations":["Fernández-Bañares meta-analysis 2019","Penny et al."],"contradicts_guidelines":false,"affected_patient_population":"Seronegative or immunodeficient suspected CD"},{"finding_id":"3.4.14","finding":"Whole-blood IL-2 release assay (Moscatelli, Gastroenterology 2025) achieves 90% sensitivity/95% specificity in HLA-DQ2.5+ patients but only 56% sensitivity in DQ8+ patients, reflecting weaker T-cell responses. Works on GFD, independent of immunoglobulins","evidence_strength":"moderate","quantitative_estimate":"DQ2.5: 90% sensitivity, 95% specificity; DQ8: 56% sensitivity","confidence_interval":null,"key_citations":["PMID:40499737"],"contradicts_guidelines":false,"affected_patient_population":"All CD patients; reduced utility in DQ8"},{"finding_id":"3.4.15","finding":"Serum IgM-tTG2 has very poor sensitivity (~1.5%) as a serum test, but mucosal IgM-tTG2 deposits are detectable in 86% of IgA-deficient CD children (Maglio 2010). This suggests the antibody IS produced but concentrated in mucosa rather than reaching serum, not that IgM anti-tTG2 is absent","evidence_strength":"moderate","quantitative_estimate":"Serum: ~1.5% sensitivity; Mucosal deposits: ~86% sensitivity in IgA-deficient CD children","confidence_interval":null,"key_citations":["PMID:14570724","PMC2857942"],"contradicts_guidelines":false,"affected_patient_population":"IgA-deficient CD patients"}],"biases_documented":[{"bias_type":"verification bias (universal in IgG test performance studies)","description":"ALL sensitivity estimates for IgG-tTG2 and IgG-DGP in IgA deficiency derive from cohorts where patients had biopsy-confirmed CD before testing. Patients with negative IgG serology who were never biopsied are excluded from sensitivity calculations. This systematically inflates reported sensitivity.","magnitude_estimate":"Unknown but potentially substantial. True sensitivity could be significantly lower than reported 75–98.7%. The magnitude cannot be estimated because the denominator (all SIgAD patients with CD) is unknown.","evidence_sources":["PMID:14570724","PMID:17490629","PMID:20022984"]},{"bias_type":"small sample bias","description":"Key IgG performance studies have n=20–78 IgA-deficient CD patients. Confidence intervals are very wide (e.g., Villalta 2010 IgG-tTG2: 76.3–97.7%), making point estimates unreliable for clinical decision-making.","magnitude_estimate":"For n=20 with 80% observed sensitivity, 95% CI is approximately 56–94%","evidence_sources":["PMID:17490629","PMID:20022984"]},{"bias_type":"invalid cross-population comparison","description":"Claims that IgG-tTG2 has 'lower sensitivity than IgA-tTG2' compare different populations (IgA-deficient vs IgA-sufficient). IgA-tTG2 cannot be evaluated in IgA-deficient patients because they cannot produce IgA. The comparison is logically invalid and should not appear in guidelines or literature.","magnitude_estimate":"Comparison is logically impossible","evidence_sources":["Multiple guideline documents making this comparison"]},{"bias_type":"unvalidated proxy measurement","description":"Serum IgA is used as a proxy for mucosal IgA-tTG2 production capacity. O'Mahony 1991 demonstrated dissociation between systemic and mucosal humoral immune responses in CD. Blanco 1989 showed serum IgA anti-gliadin is predominantly IgA1 (systemic subclass). No study has validated that serum total IgA predicts mucosal IgA-tTG2 antibody generation.","magnitude_estimate":"Unknown — correlation may be strong in complete SIgAD (both compartments absent) but unreliable in partial deficiency or states with discordant serum/mucosal IgA","evidence_sources":["PMID:1991635","PMID:2773754"]},{"bias_type":"ascertainment bias in SIgAD prevalence","description":"The 2–3% SIgAD prevalence in CD likely underestimates the true rate, because serology-first identification excludes IgA-deficient patients who receive false-negative IgA-tTG2 and are never biopsied. Additionally, only 49–66% of CD serology orders include total IgA measurement.","magnitude_estimate":"Unknown; direction is toward underestimation","evidence_sources":["PMID:18487281","PMID:40621676"]}],"unproven_assumptions_identified":[{"assumption":"Serum IgA level predicts mucosal IgA-tTG2 antibody production capacity","evidence_against":"O'Mahony 1991: systemic and mucosal humoral responses dissociate in CD (serum antibodies normalize on GFD while mucosal antibodies persist). Blanco 1989: serum IgA anti-gliadin is predominantly IgA1 (systemic subclass), not IgA2 (mucosal subclass). Serum IgA (monomeric, IgA1-dominant, bone marrow origin) and secretory IgA (dimeric, IgA2-enriched, mucosal origin) are biologically distinct molecules from different tissue sources.","evidence_for":"In complete SIgAD, both serum and secretory IgA are absent due to systemic B-cell defect. Lavö 1992 found positive correlation between serum and jejunal IgA-gliadin in active CD (p<0.01), suggesting correlation exists during active inflammation. Logical but not validated for partial deficiency or functional mucosal IgA impairment.","clinical_impact":"The entire rationale for measuring 'total IgA' to validate IgA-tTG2 rests on this assumption. If serum IgA does not reliably predict mucosal IgA-tTG2 production, the reflex testing cascade has a fundamental gap — it may correctly identify complete SIgAD but miss patients with adequate serum IgA yet impaired mucosal IgA production."},{"assumption":"IgG-based testing provides adequate sensitivity in SIgAD when IgA testing cannot be used","evidence_against":"Sensitivity estimates are verification-biased and from small samples. Guidelines themselves acknowledge negative IgG results do not exclude CD. Villalta 2007 found 1/20 (5%) completely IgG-seronegative in SIgAD+CD. ESPGHAN mandates biopsy even with positive IgG serology in SIgAD, implicitly acknowledging inadequate confidence.","evidence_for":"IgG tests do detect antibodies in most known CD cases in available studies. The system likely works for the majority. ESPGHAN/ACG recommend IgG testing with biopsy backup.","clinical_impact":"Clinicians may falsely reassure SIgAD patients with negative IgG serology. The backup pathway is better than nothing but its adequacy is unproven."},{"assumption":"Partial IgA deficiency (0.07–0.7 g/L) does not cause false-negative IgA-tTG2","evidence_against":"No unbiased study exists to address this question. Pallav 2016 found 100% IgA-tTG2 positivity in 15 partial-deficient CD patients, but the cohort was identified BY positive IgA-tTG2 — patients with negative results and partial IgA deficiency were never biopsied and are absent from the denominator. The claim cannot be evaluated from existing data.","evidence_for":"Pallav 2016 finding (verification-biased). No mechanistic rationale has been established for why reduced-but-present IgA would impair antibody detection.","clinical_impact":"Cannot determine from current evidence whether partial IgA deficiency is clinically safe. The question is unanswerable without biopsy-all studies."},{"assumption":"The <0.07 g/L threshold optimally distinguishes patients who need IgG backup testing from those who do not","evidence_against":"Threshold is statistical (2 SD below population mean), not derived from CD serology performance data. No ROC analysis or functional study has optimized this cutoff for IgA-tTG2 interpretation.","evidence_for":"Consensus-based; has face validity for complete deficiency. Widely adopted.","clinical_impact":"Patients just above threshold may or may not have adequate IgA-tTG2 production. No continuous relationship between serum IgA level and IgA-tTG2 sensitivity has been established."},{"assumption":"IgG1 deficiency causes false-negative IgG-tTG2/IgG-DGP in celiac disease (triple-hit model)","evidence_against":"No published case reports or studies document this. Siniscalco 2025 sequential switching pathway was established in mouse models and human organoids — the degree to which this pathway operates in adult human gut in vivo is not fully established. The index patient's IgG1 level is described as 'low' but not precisely quantified.","evidence_for":"Comerford 2015 established IgG1 dominance of anti-tTG2 in CD. Siniscalco 2025 provides plausible mechanism. Biologically coherent hypothesis. Standard IgG-tTG2/DGP assays use total IgG detection that would not compensate for subclass-specific deficiency.","clinical_impact":"If validated, would explain a specific mechanism for complete seronegativity and argue for IgG subclass testing in seronegative patients. Model requires empirical validation in CD patients with documented IgG1 deficiency."}],"overlooked_populations":[{"population":"SIgAD patients with negative IgG serology who never received biopsy","estimated_size":"Unknown — systematically excluded from all existing studies by verification bias","why_missed":"Verification bias: clinical pathways require positive serology for biopsy referral in most settings","proposed_solution":"Biopsy-all study design in SIgAD patients with GI symptoms regardless of IgG serology results"},{"population":"Patients with combined IgA deficiency and IgG1 subclass deficiency, where both primary and backup serological pathways fail","estimated_size":"Unknown; likely rare but not ultra-rare given shared autoimmune genetics","why_missed":"IgG subclasses not routinely measured; standard algorithms assume IgG backup sufficiency; no guideline addresses this scenario","proposed_solution":"Measure IgG subclasses in seronegative patients with clinical suspicion; proceed directly to HLA-DQ typing + biopsy if HLA-positive"},{"population":"Patients with discordant serum IgA and mucosal secretory IgA (adequate serum IgA but impaired mucosal IgA production)","estimated_size":"Unknown — never studied. Potentially relevant to patients with Siniscalco-type IgG1-dependent mucosal IgA impairment","why_missed":"Secretory IgA is not measured in standard clinical panels; serum IgA assumed to be adequate proxy","proposed_solution":"Research studies correlating serum IgA, fecal secretory IgA, and IgA-tTG2 titers across the spectrum of IgA levels and immunodeficiency states"},{"population":"DQ8-associated CD with SIgAD and milder histology","estimated_size":"5–10% of CD is DQ8; SIgAD prevalence in DQ8 CD unknown (no studies stratified by HLA genotype)","why_missed":"Lower baseline antibody production with DQ8 + milder histology (Marsh 3A) independently reduce serological sensitivity","proposed_solution":"Lower threshold for biopsy in DQ8 patients with symptoms; include HLA genotype in IgG test performance analyses"}],"diagnostic_step_sensitivity":{"step_name":"IgG-based serology (IgG-tTG2, IgG-DGP) in selective IgA deficiency","reported_sensitivity":"75–98.7% (IgG-tTG2, depending on assay); 80–93% (IgG-DGP)","adjusted_sensitivity":"UNKNOWN — all estimates are verification-biased and from small samples. True sensitivity cannot be calculated from existing data.","false_negative_rate":"Reported: 2–25% depending on study and assay. True rate: unknown and potentially higher. Mechanism of false negatives has never been investigated.","key_limitations":["ALL studies used verification-biased cohort selection (tested known CD patients)","No study biopsied all SIgAD patients regardless of IgG serology results","Sample sizes inadequate: n=20–78 with very wide confidence intervals","Mechanisms of IgG false negatives never investigated (IgG subclass? Marsh grade? Assay? HLA genotype?)","IgG subclass distribution of CD antibodies (predominantly IgG1) may affect detection in IgG1-deficient patients","Commercial assays use total IgG detection — performance in IgG subclass deficiency untested","One Marsh 3A patient in Villalta 2007 was negative on ALL IgG methods, confirming complete failure is possible"]},"what_studies_do_NOT_show":[{"claimed_finding":"IgA-tTG2 has reduced sensitivity in partial IgA deficiency","why_not_supported":"No unbiased study exists. Pallav 2016 found 100% sensitivity but cohort was selected by positive IgA-tTG2. Cannot be interpreted."},{"claimed_finding":"IgG-tTG2 sensitivity is approximately 85–99% in SIgAD","why_not_supported":"All estimates derive from known-disease cohorts. Patients missed by serology are absent from the denominator. True sensitivity is unknown."},{"claimed_finding":"IgG-DGP is superior to IgG-tTG2 (or vice versa) in SIgAD","why_not_supported":"Head-to-head comparison (Villalta 2007) had only n=20 with verification bias. Confidence intervals overlap completely."},{"claimed_finding":"Measuring serum total IgA validates IgA-tTG2 results","why_not_supported":"No study has validated that serum IgA correlates with mucosal IgA-tTG2 production capacity. O'Mahony 1991 showed dissociation between systemic and mucosal humoral responses in CD."},{"claimed_finding":"IgG backup testing is adequate to exclude CD in SIgAD","why_not_supported":"Guidelines themselves state negative IgG serology does not exclude CD. No unbiased sensitivity data exists."},{"claimed_finding":"The IgG backup pathway 'misses 5–15% of cases' (specific miss rate estimate)","why_not_supported":"This estimate is derived from biased sensitivity data (100% minus biased sensitivity). The true miss rate is unknown — it could be 3%, 15%, or 30%. Providing a pseudo-precise range implies knowledge we do not have."}],"contradictory_studies":[{"citation":"Korponay-Szabó 2003 vs Villalta 2007","pmid":"14570724 vs 17490629","finding":"IgG-tTG2 sensitivity reported as 98.7% (n=78) vs 75–95% (n=20)","contradicts":"Each other — wide variation in reported performance. Both verification-biased. True sensitivity unknown."},{"citation":"Villalta 2007 — Marsh 3A all-negative case","pmid":"17490629","finding":"One Marsh 3A patient negative on ALL IgG methods (IgG-tTG2, IgG-DGP, IgG-AGA)","contradicts":"Claims that IgG-based testing is 'adequate' backup. Demonstrates complete failure mode exists."},{"citation":"O'Mahony et al. 1991","pmid":"1991635","finding":"Systemic and mucosal humoral immune responses dissociate in CD — serum antibodies normalize on GFD while mucosal antibodies persist","contradicts":"Assumption that serum IgA measurement validates mucosal IgA-tTG2 production. Challenges the rationale for total IgA measurement as validation of IgA-tTG2."}],"research_gaps":[{"gap":"Correlation between serum IgA and mucosal secretory IgA / IgA-tTG2 production capacity","importance":"critical","proposed_study_design":"Measure serum total IgA, serum IgA-tTG2, fecal secretory IgA, and mucosal IgA-tTG2 deposits simultaneously in CD patients across the full range of serum IgA levels. Determine whether serum IgA reliably predicts mucosal antibody production."},{"gap":"True sensitivity of IgG-tTG2 and IgG-DGP in unselected SIgAD patients","importance":"high","proposed_study_design":"Prospective biopsy-all study in SIgAD patients with GI symptoms, regardless of IgG serology results. Calculate unbiased sensitivity against histological reference standard."},{"gap":"Mechanism of IgG-seronegative CD in SIgAD patients","importance":"high","proposed_study_design":"In SIgAD patients with biopsy-confirmed CD and negative IgG serology, measure IgG subclasses, characterize Marsh grade, HLA genotype, and clinical phenotype. Determine whether IgG1 deficiency explains false negatives."},{"gap":"Clinical validation of IgG1 deficiency → false-negative IgG-tTG2/DGP hypothesis","importance":"high","proposed_study_design":"Case-control study measuring IgG subclasses in seronegative biopsy-confirmed CD patients vs seropositive CD patients. Also: mucosal B-cell sequencing in IgG1-deficient CD patients to test Siniscalco sequential switching disruption."},{"gap":"Prevalence of SIgAD stratified by HLA genotype (DQ2.5 vs DQ2.2 vs DQ8) in CD","importance":"medium","proposed_study_design":"Retrospective analysis of existing large biopsy-confirmed cohorts with stored HLA data"},{"gap":"Optimal serum IgA threshold for triggering IgG backup testing","importance":"medium","proposed_study_design":"ROC analysis of serum IgA level vs IgA-tTG2 positivity in CD patients across the spectrum of IgA levels, using biopsy as reference standard"},{"gap":"IgA-tTG2 performance in partial IgA deficiency (0.07–0.7 g/L)","importance":"medium","proposed_study_design":"Biopsy-all study in patients with partial IgA deficiency and GI symptoms, regardless of IgA-tTG2 result"},{"gap":"Validation of Siniscalco sequential IgM→IgG1→IgA switching in adult human gut CD","importance":"medium","proposed_study_design":"Siniscalco 2025 used mouse models and human organoids. Adult in vivo validation needed via mucosal B-cell repertoire analysis in CD patients with and without IgG1 deficiency."}],"differential_diagnoses_relevant":[{"condition":"CVID enteropathy","overlap_with_cd":"Villous atrophy, malabsorption, complete seronegativity, may carry HLA-DQ2/DQ8","distinguishing_features":"Absent mucosal plasma cells on biopsy (present in CD); follicular lymphoid hyperplasia; poor response to GFD (only 17% in Malamut 2009); good response to steroids; cannot produce antibodies of any class (serology unreliable for all classes)"},{"condition":"Selective IgA deficiency without CD","overlap_with_cd":"Increased GI symptoms, autoimmune associations, shared HLA haplotype (8.1 ancestral haplotype)","distinguishing_features":"Normal duodenal histology on biopsy; IgG-tTG2/DGP negative; absence of elevated IELs"},{"condition":"Autoimmune enteropathy","overlap_with_cd":"Villous atrophy, malabsorption","distinguishing_features":"Anti-enterocyte antibodies; goblet cell depletion; poor response to GFD; may respond to immunosuppression"},{"condition":"Olmesartan-induced enteropathy","overlap_with_cd":"Villous atrophy, may be seronegative, diarrhea","distinguishing_features":"Medication history; resolves on drug withdrawal; may mimic Marsh 3"}],"recommendations":[{"recommendation":"In complete SIgAD (<0.07 g/L), IgG-based testing is logically necessary since IgA antibodies cannot be produced. However, clinicians must understand that true sensitivity of IgG tests is UNKNOWN due to universal verification bias, and negative IgG results do NOT exclude CD.","target":"clinicians","evidence_basis":"Logical necessity for IgG testing; all sensitivity estimates verification-biased"},{"recommendation":"In SIgAD with clinical suspicion of CD, proceed to duodenal biopsy regardless of IgG serology results. This is already recommended by ESPGHAN and ACG but inconsistently implemented.","target":"clinicians, guidelines","evidence_basis":"Guidelines acknowledge IgG tests have uncertain sensitivity; biopsy is the only definitive test"},{"recommendation":"Implement automated laboratory reflex cascades for total IgA measurement and IgG backup testing universally. Reference laboratory models (Mayo, ARUP) are proven and cost-effective.","target":"laboratories, health systems","evidence_basis":"Documented 49–66% compliance gap; reflex cascades 268% less expensive than full panels"},{"recommendation":"Do NOT make claims about partial IgA deficiency causing or not causing false-negative IgA-tTG2 — no unbiased evidence exists to address this question. Standard IgA-tTG2 testing is likely adequate in partial deficiency but this is unproven.","target":"clinicians, guidelines, researchers","evidence_basis":"Pallav 2016 is verification-biased; no biopsy-all studies exist in partial IgA deficiency"},{"recommendation":"Recognize that measuring serum total IgA to validate IgA-tTG2 results is based on an unproven assumption. Serum IgA and mucosal secretory IgA are biologically distinct, and dissociation between systemic and mucosal immune responses has been demonstrated in CD.","target":"guidelines, researchers","evidence_basis":"O'Mahony 1991 (PMID:1991635); no validation studies exist"},{"recommendation":"Measure IgG subclasses in seronegative biopsy-confirmed CD, especially when IgG backup tests are also negative. If IgG1 is low, this provides a mechanistic explanation for IgG test failure.","target":"clinicians","evidence_basis":"Anti-tTG2 IgG is predominantly IgG1 (Comerford 2015); IgG1 deficiency could explain false negatives. No current guideline addresses this."},{"recommendation":"For patients with combined immunoglobulin deficiencies (SIgAD + IgG subclass deficiency), serological testing cannot be relied upon. Proceed directly to HLA-DQ typing followed by biopsy if HLA-positive, with IEL flow cytometry on fresh biopsy for antibody-independent confirmation.","target":"clinicians, guidelines","evidence_basis":"Both IgA and IgG serological pathways compromised; T-cell/IEL diagnostics are the only antibody-independent option"},{"recommendation":"Research priority: Conduct biopsy-all studies in SIgAD patients with GI symptoms to determine true IgG test sensitivity, and separately validate the serum IgA / mucosal IgA-tTG2 correlation.","target":"researchers","evidence_basis":"Current evidence base is entirely verification-biased; foundational assumptions are unvalidated"}],"application_to_index_patient":{"patient_profile":"DQ8 positive, Marsh 3A, IgA-tTG2 <1, IgG-DGP <1, low IgG1 subclass, low fecal secretory IgA","relevance_of_findings":["Patient has LOW IgG1, and CD-associated IgG antibodies are predominantly IgG1 (Comerford 2015) — this could explain negative IgG-DGP despite active CD","Patient has LOW FECAL SECRETORY IgA — this directly measures mucosal IgA production and is more relevant than serum IgA for predicting IgA-tTG2 capacity. The O'Mahony 1991 dissociation between serum and mucosal compartments is directly relevant.","The combination of low IgG1 + low secretory IgA suggests BOTH IgA-based AND IgG-based serological pathways are compromised","DQ8 genotype + Marsh 3A independently reduce antibody titers, further lowering serological sensitivity","Current diagnostic algorithms do not account for this combined deficiency pattern; no guideline addresses it","The triple-hit model (DQ8 + IgG1 deficiency + disrupted sequential class switching) is mechanistically plausible but remains a HYPOTHESIS requiring empirical validation. The Siniscalco 2025 evidence comes from mouse models and human organoids, not from adult CD patients with IgG1 deficiency."],"diagnostic_failure_modes_identified":["IgA-tTG2 failure: Low mucosal IgA production (evidenced by low fecal sIgA) limits IgA antibody generation. This may occur through impaired sequential IgM→IgG1→IgA switching (Siniscalco 2025) or through other mechanisms.","IgG-DGP/IgG-tTG2 failure: Low IgG1 subclass limits IgG1-class antibody detection, since anti-tTG2 and likely anti-DGP antibodies are predominantly IgG1","Combined failure: Patient may be unable to generate detectable antibodies via EITHER the IgA or IgG pathway","Algorithm failure: Standard reflex testing assumes serum IgA predicts IgA-tTG2 validity — this patient's low SECRETORY IgA (not measured in standard panels) is the actual limiting factor. If patient has normal serum IgA, the algorithm would not trigger IgG backup testing at all."],"recommended_diagnostic_approach":"HLA-DQ typing (done: DQ8+) → Biopsy with ≥6 specimens (done: Marsh 3A) → IEL flow cytometry on fresh biopsy → Mucosal deposit immunofluorescence (IgA, IgG, IgM anti-tTG2) → IgG subclass quantification (done: low IgG1) → Paris Consensus criteria for seronegative CD → Empirical GFD trial with histological follow-up at 12–24 months"},"null_hypothesis_consideration":{"conventional_view":"Measuring serum IgA alongside IgA-tTG2 adequately identifies patients needing IgG backup testing, and IgG tests provide acceptable sensitivity to detect CD in SIgAD.","could_conventional_view_be_correct":"Partially. For COMPLETE SIgAD, IgG testing is logically necessary and probably detects most cases. The 2–3% SIgAD prevalence is well-established. Automated reflex cascades solve the compliance problem where implemented. The system likely works 'well enough' for the majority of IgA-deficient CD patients.","strongest_counterargument_to_bias_hypothesis":"Multiple studies do find high IgG-tTG2 sensitivity (75–98.7%), and even if verification-biased, the direction of bias is known and the lower-bound estimates (75%) still suggest most cases are detected. ESPGHAN's mandatory biopsy requirement in SIgAD provides a safety net against IgG false negatives.","remaining_concerns":"The safety net depends on clinicians actually performing biopsy despite negative IgG serology — which is unlikely in practice without strong clinical suspicion. For patients with combined immunoglobulin deficiencies, mild histology, or lower-risk HLA genotypes, the current algorithm likely fails. The magnitude of this problem cannot be determined from existing evidence. The foundational assumption that serum IgA validates IgA-tTG2 has empirical support only for complete SIgAD and has never been validated across the IgA spectrum."},"meta_analysis_summary":{"studies_reviewed":25,"total_patients":null,"pooled_estimates":{"note":"Pooled estimates not calculated because all individual estimates are verification-biased, rendering pooling meaningless. Approximately 200–400 IgA-deficient CD patients across key studies, mostly in cohorts of n<80."},"heterogeneity_notes":"Extreme heterogeneity in reported IgG-tTG2 sensitivity (75–98.7%) likely reflects assay differences, era, small samples, and variable degrees of verification bias. No formal meta-analysis is appropriate given fundamental study design limitations common to all included studies."}}
