{"research_topic_id":"3.6","research_topic_title":"Celiac Disease Diagnosis in the Elderly (Age >60) — Post-Peer-Review Corrected Version","date_completed":"2026-02-08","version":"3.1-final","revision_notes":"v3.0 corrections applied after dual peer review (Opus Session B + Grok 4.1): removed Bjellerup hallucination, corrected author misattributions, added confidence labels, expanded contradictory evidence treatment. v3.1: incorporated Grok 4.1 review of v3.0 — added Abrams inter-laboratory variability note per reviewer suggestion. Both peer reviews now approve for project integration.","executive_summary":"Celiac disease in patients over 60 is substantially underdiagnosed, with Finnish population screening showing 2.13–2.34% biopsy-confirmed prevalence and 58% of cases previously undetected (Vilppula, PMID:18467196/19558729). IgA-tTG2 sensitivity, after verification bias correction, is approximately 57% in the general adult population (Hujoel, PMID:32433257); indirect evidence from age-titer correlations (Vivas, PMID:18702652), Marsh-grade-dependent sensitivity (Abrams, PMID:16630760), immunosenescence literature, and consistently older age of seronegative CD patients (Volta, PMID:27352981; Schiepatti, PMID:34496060) supports the HYPOTHESIS that elderly-specific sensitivity is lower still — but no direct age-stratified measurement exists. The most critical evidence gap is the absence of any prospective biopsy-first study comparing IgA-tTG2 sensitivity across age groups.","key_findings":[{"finding_id":"3.6.1","finding":"Biopsy-confirmed CD prevalence in elderly Finnish populations is 2.13–2.34%, with 58% of cases previously undetected. Norwegian data (HUNT4, Tromsø) show similar patterns. All screening studies used serology-first identification, meaning these are FLOOR estimates that exclude seronegative cases.","evidence_strength":"strong","confidence_level":"DIRECTLY MEASURED — population-based screening with biopsy confirmation","quantitative_estimate":"2.13–2.34% prevalence; 58% undetected (Vilppula); 1.47% total with 75% undiagnosed (Kvamme/Tromsø)","confidence_interval":"95% CI 1.60–2.67% (Vilppula 2008)","key_citations":["PMID:18467196","PMID:19558729","PMID:38987013","PMID:35879335"],"contradicts_guidelines":false,"affected_patient_population":"General elderly population; verification bias means true prevalence may be higher","verification_bias_assessment":"ALL studies used serology-first screening — seronegative CD systematically excluded. No study performed universal biopsy regardless of serology.","marsh_grade_distribution":"Vilppula: all biopsy-confirmed cases were Marsh III; Marsh 3A distribution not separately reported","hla_genotype_distribution":"Not reported in any elderly screening study — major gap"},{"finding_id":"3.6.2","finding":"After verification bias correction, IgA-tTG2 sensitivity for CD in the general adult population drops from 92.6% to 57.1% (95% CI 35.4–76.4%). This correction was NOT age-stratified. Separately, IgA-tTG2 titers are inversely correlated with age (Vivas) and with lesser degrees of villous atrophy (Abrams 2006: 90% for total VA vs 42.3% for partial VA). Seronegative CD patients are consistently older at diagnosis (median 49 vs 36 years, Volta).","evidence_strength":"strong (for general bias correction); moderate (for age-titer correlation); emerging (for elderly-specific sensitivity estimate)","confidence_level":"DIRECTLY MEASURED for overall correction; EXTRAPOLATED for elderly-specific estimate — no direct age-stratified verification-bias-corrected measurement exists","quantitative_estimate":"General adult adjusted sensitivity: 57.1% (CI 35.4–76.4%). Partial VA sensitivity: 42.3% (Abrams 2006). Elderly-specific sensitivity: UNKNOWN but hypothesized to be lower than 57% based on converging indirect evidence.","confidence_interval":"35.4–76.4% for general adult (Hujoel); elderly-specific CI unavailable","key_citations":["PMID:32433257","PMID:18702652","PMID:16630760","PMID:27352981","PMID:34496060"],"contradicts_guidelines":true,"affected_patient_population":"Elderly patients with atypical presentations; especially those with Marsh 3A","verification_bias_assessment":"Hujoel found only 3.6% of IgA-tTG2-negative patients were biopsied vs 79.2% of positives — massive differential verification","marsh_grade_distribution":"Abrams 2006: sensitivity stratified by Marsh grade — 42.3% Marsh 3A vs 90% Marsh 3B/3C","hla_genotype_distribution":"Not stratified in any sensitivity study"},{"finding_id":"3.6.3","finding":"Clinical presentation in elderly CD is predominantly extraintestinal (anemia 60–80%, osteoporosis ~70%), though one well-powered US tertiary center study (Mukherjee, n=274) found similar presentations in elderly vs young adults (diarrhea 50% vs 49%). This discrepancy is INFORMATIVE: referral-detected elderly look similar to younger patients precisely because they were selected for recognizable presentations; the ~58% undetected in screening studies (Vilppula) likely represent the atypical cases that evade recognition.","evidence_strength":"moderate","confidence_level":"DIRECTLY MEASURED in multiple cohorts but with important selection bias differences between tertiary and population studies","quantitative_estimate":"Anemia 60–80%; osteoporosis 67–70% in elderly vs 9–14% in <65; diarrhea ~50% (similar across ages in tertiary data)","confidence_interval":null,"key_citations":["PMID:27486350","PMID:20165980","PMID:36818495","PMID:8307452"],"contradicts_guidelines":false,"affected_patient_population":"Elderly CD — both referral-detected (similar to young) and screen-detected (more atypical)"},{"finding_id":"3.6.4","finding":"Only 18% of US primary care physicians would perform serologic testing for CD in an elderly man with iron deficiency anemia, versus 61% for a young Caucasian man with identical presentation. 65% would not consider serologic testing in an elderly IDA patient at all.","evidence_strength":"moderate","confidence_level":"DIRECTLY MEASURED via physician survey — reflects stated intent, not observed behavior","quantitative_estimate":"18% serologic testing rate for elderly male IDA; 61% for young Caucasian male IDA; 65% would not consider testing elderly","confidence_interval":null,"key_citations":["PMID:28931034"],"contradicts_guidelines":true,"affected_patient_population":"Elderly patients with IDA — the most common presentation of elderly CD"},{"finding_id":"3.6.5","finding":"Diagnostic delay in elderly CD averages 17–28 years (Gasbarrini, Hankey & Holmes), with maximum delays of 50 years. However, this is from retrospective clinical series with high standard deviations (±19 years). The Mukherjee tertiary center data showed only ~6 years delay in both age groups, suggesting significant heterogeneity.","evidence_strength":"moderate","confidence_level":"DIRECTLY MEASURED but with wide variance and center-dependent differences","quantitative_estimate":"17 ± 19 years (Gasbarrini); 15–28 years (Hankey & Holmes); ~6 years (Mukherjee)","confidence_interval":null,"key_citations":["PMID:8307452","PMID:20165980"],"contradicts_guidelines":false,"affected_patient_population":"Elderly CD patients with atypical presentations"},{"finding_id":"3.6.6","finding":"Persistent villous atrophy on GFD is significantly more common in elderly: 56% in ≥70 vs overall 43% (Lebwohl 2014); OR 5.1 (95% CI 2.5–10.4) for persistent VA in ≥70 vs 18–29 (Mahadev 2017). This may reflect impaired mucosal regeneration, longer cumulative exposure, concurrent medications, or dietary adherence issues.","evidence_strength":"strong","confidence_level":"DIRECTLY MEASURED in large population-based Swedish study (n=7,648)","quantitative_estimate":"OR 5.1 (95% CI 2.5–10.4) for persistent VA in ≥70 vs 18–29","confidence_interval":"95% CI 2.5–10.4","key_citations":["PMID:24428688","PMID:28220520"],"contradicts_guidelines":false,"affected_patient_population":"Elderly CD patients on GFD"},{"finding_id":"3.6.7","finding":"Seronegative CD (all ages) carries HR 10.87 for complications and HR 2.18 for mortality compared to seropositive CD in 20-year multicenter follow-up. Seronegative patients are systematically older at diagnosis. HOWEVER, Godfrey et al. found NO excess mortality in undiagnosed elderly CD (≥50) over 10.3 years in 16,886 adults — suggesting much undetected elderly CD may be clinically mild, and the primary benefit of screening may be quality-of-life improvement rather than mortality reduction.","evidence_strength":"strong (Schiepatti outcomes); strong (Godfrey no-mortality finding)","confidence_level":"DIRECTLY MEASURED in both studies but representing different populations (diagnosed seronegative vs undiagnosed seropositive)","quantitative_estimate":"HR 10.87 complications, HR 2.18 mortality (SNCD vs seropositive); HR ~1.0 mortality undiagnosed elderly (Godfrey)","confidence_interval":null,"key_citations":["PMID:34496060","PMID:20685275"],"contradicts_guidelines":false,"affected_patient_population":"Seronegative CD (worse outcomes) vs undiagnosed elderly (no excess mortality — possible survivor bias)"},{"finding_id":"3.6.8","finding":"Microscopic colitis risk is 70-fold elevated in CD patients (SMR 72.39, 95% CI 52.52–95.36), with CD+microscopic colitis patients being older and having more severe villous atrophy. Peak microscopic colitis incidence is age 60–70, making this a critical comorbidity in elderly CD.","evidence_strength":"strong","confidence_level":"DIRECTLY MEASURED in prospective celiac database (n=1,009)","quantitative_estimate":"SMR 72.39 (95% CI 52.52–95.36)","confidence_interval":"95% CI 52.52–95.36","key_citations":["PMID:19631283"],"contradicts_guidelines":false,"affected_patient_population":"Elderly CD patients with persistent diarrhea despite GFD"},{"finding_id":"3.6.9","finding":"REFERENCE PATIENT ANALYSIS: A patient with DQ8-only genotype, Marsh 3A, all serology <1, low IgG1, and low secretory IgA faces multiplicative serological failure modes: (a) DQ8 gene dose produces weaker T cell response → lower antibody, (b) Marsh 3A insufficient mucosal damage for high-titer response, (c) low secretory IgA impairs mucosal antibody generation despite normal serum IgA, (d) low IgG1 impairs IgG-DGP backup pathway, (e) if elderly, immunosenescence compounds all pathways. The exact cumulative probability of seronegativity CANNOT be calculated because the independence of these mechanisms is untested, but the convergence substantially elevates false-negative risk beyond any single factor.","evidence_strength":"moderate","confidence_level":"HYPOTHESIZED from convergence of independently supported mechanisms — cumulative probability is qualitative, not quantifiable from current data","quantitative_estimate":"Each individual mechanism independently reduces sensitivity; cumulative effect is substantial but unquantifiable","confidence_interval":null,"key_citations":["PMID:15185855","PMID:16630760","PMID:24583754","PMID:14768948","PMID:35676085"],"contradicts_guidelines":true,"affected_patient_population":"DQ8/Marsh 3A/seronegative/low IgG1/low SIgA phenotype — especially if elderly"}],"biases_documented":[{"bias_type":"verification bias in all CD screening/prevalence studies","description":"Every population-based CD screening study uses serology-first algorithms. Only seropositive individuals are biopsied. This creates circular validation: serology appears highly sensitive because only seropositive patients enter the denominator for sensitivity calculations. True sensitivity requires biopsy independent of serology — which has never been done in elderly populations.","magnitude_estimate":"Hujoel correction reduces general adult IgA-tTG2 sensitivity from 92.6% to 57.1% (CI 35.4–76.4%). Elderly-specific correction unknown but likely larger given lower titers with age.","evidence_sources":["PMID:32433257 (Hujoel verification bias correction)","PMID:18467196 (Vilppula — serology-first)","PMID:35879335 (Kvamme — serology-first)","PMID:38987013 (HUNT4 — serology-first)"]},{"bias_type":"selection bias in clinical series","description":"Tertiary center cohorts (e.g., Mukherjee at Columbia) are enriched for patients whose presentations were recognizable enough to trigger referral. This explains why Mukherjee found similar elderly vs young presentations — the ~58% of undetected elderly CD (Vilppula) are missing from tertiary data precisely because their atypical presentations evaded recognition.","magnitude_estimate":"Moderate — creates apparent contradiction between tertiary center data and population screening data that is resolved by recognizing referral selection","evidence_sources":["PMID:20165980 (Mukherjee — tertiary center)","PMID:18467196 (Vilppula — population screening)"]},{"bias_type":"survivor bias in elderly mortality studies","description":"Godfrey et al. found no excess mortality in undiagnosed CD in adults ≥50. This likely reflects survivor bias — individuals sampled at ≥50 with undiagnosed CD represent those whose disease was mild enough to survive to that age, whereas Rubio-Tapia's historical cohort (young adults followed 45 years) captured those who died before reaching old age.","magnitude_estimate":"Unknown — confounds interpretation of whether undiagnosed elderly CD is truly benign or represents survivor-selected mild disease","evidence_sources":["PMID:20685275 (Godfrey)","PMID:19362553 (Rubio-Tapia)"]},{"bias_type":"HALLUCINATED CITATION in original manuscript (corrected)","description":"The original Opus 4.6 manuscript cited 'Bjellerup et al.' as a Swedish study finding 50% IgA-tTG2 negativity in CD patients >70. This citation does not exist. Per Bjellerup is a real Swedish clinical chemist (Uppsala) with 87 PubMed publications, but ZERO on celiac disease. This hallucination served as the primary empirical anchor for the 30–50% elderly sensitivity estimate. All claims derived from this citation have been removed in the corrected version.","magnitude_estimate":"HIGH — removes direct empirical anchor for central claim; elderly-specific sensitivity estimate now rests entirely on indirect extrapolation","evidence_sources":["PubMed author search: Bjellerup[Author] returns 87 results, none celiac-related"]},{"bias_type":"PEER REVIEW ERRORS (documented for completeness)","description":"Three items flagged by the Opus 4.6 Session B peer review were independently verified as CORRECT in the original manuscript: (1) 70-fold microscopic colitis risk — confirmed SMR 72.39 per Green et al. PMID:19631283; (2) Kvamme et al. 2022 — confirmed PMID:35879335; (3) Spencer 65% figure — confirmed from full text, with 18% serologic testing rate being even worse. Peer review's 6-12 fold microscopic colitis estimate likely reflects different study designs (population-based vs celiac cohort).","magnitude_estimate":"Low — these errors in the peer review do not affect the critical corrections that were valid","evidence_sources":["PMID:19631283","PMID:35879335","PMID:28931034"]}],"unproven_assumptions_identified":[{"assumption":"IgA-tTG2 sensitivity is equivalent across all adult age groups (reported as >90%)","evidence_against":"Verification-bias-corrected sensitivity is 57.1% for all ages combined (Hujoel). Titers inversely correlate with age (Vivas). Seronegative CD patients are systematically older (Volta, Schiepatti). Partial VA sensitivity is only 42.3% (Abrams 2006). Immunosenescence reduces antibody quality and mucosal IgA homing (Schmucker — animal data).","evidence_for":"Some reviews (Rashtak & Murray, PMC3227015) note that within DIAGNOSED elderly cohorts, seropositivity rates appear comparable to younger patients — but this reflects selection bias (diagnosed = seropositive-selected). Mukherjee found similar serology profiles in tertiary-center elderly vs young.","clinical_impact":"If elderly sensitivity is substantially lower, the serology-first algorithm systematically misses a population at higher risk for complications (Schiepatti HR 10.87) and with fewer years remaining to benefit from late diagnosis."},{"assumption":"The multiplicative failure-mode mechanisms (DQ8 gene dose, Marsh 3A, low IgG1, low SIgA, immunosenescence) are independent and their effects compound","evidence_against":"These pathways likely share upstream regulators (e.g., HLA influences both T cell response and downstream B cell activation; immune maturation affects multiple pathways simultaneously). Partial redundancy would reduce cumulative effect.","evidence_for":"Each mechanism operates through a distinct molecular pathway: HLA gene dose → T cell activation strength; mucosal damage severity → antigen-driven B cell stimulation; IgG1 subclass → class-switch recombination capacity; secretory IgA → mucosal transport independently regulated from serum IgA; immunosenescence → global B cell repertoire contraction.","clinical_impact":"If mechanisms are partially redundant, the cumulative seronegativity probability is lower than implied by a pure multiplication model. The qualitative conclusion (substantially elevated false-negative risk) still holds."},{"assumption":"All undetected elderly CD is harmful and requires treatment","evidence_against":"Godfrey et al. (PMID:20685275) found NO excess mortality in 16,886 undiagnosed adults ≥50 over 10.3 years. Much screen-detected CD in elderly may be clinically benign or low-grade.","evidence_for":"Vilppula found GFD improved quality of life in screen-detected elderly. Seronegative CD carries HR 10.87 complications (Schiepatti). EATL risk accumulates with prolonged gluten exposure. Osteoporosis and fracture risk are elevated.","clinical_impact":"The NNT for mortality benefit from elderly CD screening may be very high. Primary benefit is likely quality of life (anemia correction, bone density, symptom relief) rather than mortality reduction. Screening recommendations should be framed accordingly."},{"assumption":"Immunosenescence mechanisms demonstrated in animal models (Schmucker rat/macaque data on 3-4 fold decline in IgA homing) directly translate to reduced IgA-tTG2 production in elderly humans with CD","evidence_against":"No human study has measured antigen-specific IgA-tTG2 production capacity as a function of age. Total serum IgA paradoxically increases with age. Some elderly CD patients achieve high titers.","evidence_for":"Vivas demonstrated titer-age inverse correlation in humans. General immunology literature shows reduced AID expression, contracted B cell diversity, and impaired mucosal homing with age. Human secretory IgA quality declines with age.","clinical_impact":"If immunosenescence does not substantially affect tTG2-specific IgA, the elderly sensitivity decline may be smaller than hypothesized from the animal models."}],"overlooked_populations":[{"population":"Elderly patients (60+) with iron deficiency anemia who are never tested for CD","estimated_size":"82% of elderly male IDA patients not tested (Spencer: only 18% would receive serologic testing); CD prevalence in IDA is 3.2–5.5% (Mahadev meta-analysis)","why_missed":"Anemia workup in elderly focuses on malignancy (colonoscopy) rather than malabsorption; 65% of PCPs would not consider CD serology in elderly IDA patient; physician perception that CD is a childhood/young adult disease","proposed_solution":"Mandatory CD serology as part of IDA workup regardless of age; routine duodenal biopsies during EGD for anemia investigation"},{"population":"Seronegative elderly CD patients with Marsh 3A villous atrophy","estimated_size":"Unknown — no population study has biopsied elderly patients independently of serology. Likely underestimated given lower titers with age, higher seronegative proportion, and 42.3% sensitivity at Marsh 3A.","why_missed":"Serology-first algorithms: negative serology → no biopsy → no diagnosis. Elderly patients less likely to be biopsied even with positive serology (OR 0.51, Lebwohl). Symptoms attributed to aging/comorbidities.","proposed_solution":"Protocol duodenal biopsies during any upper endoscopy in elderly with suggestive symptoms (anemia, osteoporosis, unexplained GI complaints) regardless of serology status; HLA typing + GFD response trial for diagnosis per Paris Consensus criteria"},{"population":"Elderly patients with drug-induced enteropathy (especially olmesartan) misdiagnosed or confused with CD","estimated_size":"26% of seronegative villous atrophy cases in one series (68% HLA-DQ2 positive — HLA cannot distinguish from CD)","why_missed":"Olmesartan widely prescribed for elderly hypertension; enteropathy presents identically to Marsh 3 CD histologically; HLA positivity does not exclude drug etiology; FDA label change (2013) may not be widely known","proposed_solution":"Medication review as FIRST step in evaluating any elderly patient with seronegative villous atrophy; trial drug withdrawal before GFD trial"}],"diagnostic_step_sensitivity":{"step_name":"IgA-tTG2 serology in elderly (>60)","reported_sensitivity":"90–97% (textbook/guideline figure for general adult population — derived from verification-biased studies)","adjusted_sensitivity":"General adult after verification bias correction: 57.1% (95% CI 35.4–76.4%, Hujoel PMID:32433257). ELDERLY-SPECIFIC SENSITIVITY IS UNKNOWN — no direct age-stratified verification-bias-corrected measurement exists. HYPOTHESIS: lower than 57% based on converging indirect evidence (age-titer correlation, Marsh-grade dependency, immunosenescence, older age of seronegative patients).","false_negative_rate":"General adult: ~43% after bias correction. Elderly: unknown but hypothesized higher. For Marsh 3A specifically: 57.7% false-negative rate (Abrams 2006, PMID:16630760).","key_limitations":["NO prospective biopsy-first study has compared IgA-tTG2 sensitivity across age groups — this is the single most critical evidence gap","Verification bias correction (Hujoel) was NOT age-stratified","Vivas age-titer correlation spans child-to-adult spectrum, not specifically within elderly subgroup","Immunosenescence data on mucosal IgA homing is primarily from animal models (Schmucker), not human CD-specific studies","Within DIAGNOSED elderly cohorts, seropositivity rates appear comparable to younger (Rashtak) — but this reflects selection bias (diagnosed = seropositive-selected)","Sensitivity for Marsh 3A varied dramatically by commercial laboratory in Abrams 2006: 42.3% overall for PVA, but Lab #1 showed 40.0% sensitivity vs Lab #2 at 86.4% (p<0.0001). The overall study sensitivity was 70.6%. The 42.3% figure for PVA is the most conservative estimate and may not generalize across all laboratories."]},"contradictory_studies":[{"citation":"Mukherjee R et al. Celiac disease: similar presentations in the elderly and young adults. Dig Dis Sci. 2010;55(11):3147-53.","pmid":"20165980","finding":"Similar clinical presentations in elderly (≥65, n=125) vs young adults (18–30, n=149): diarrhea 50% vs 49% (p=0.921), similar diagnostic delay (~6 years), similar villous atrophy severity. This is from a US tertiary center (Columbia University).","contradicts":"Consensus that elderly have more atypical/subtle presentations (Collin 2018, Cappello 2016). RECONCILIATION: The discrepancy is informative — referral-detected elderly look similar to younger patients because they were selected for having recognizable presentations. The ~58% undetected in screening (Vilppula) are presumably the atypically-presenting cases that evaded recognition. This reconciliation supports rather than undermines the underdiagnosis thesis.","evidence_quality":"Strong (well-powered, leading center) but subject to referral selection bias"},{"citation":"Godfrey JD et al. Morbidity and mortality among older individuals with undiagnosed celiac disease. Gastroenterology. 2010;139(3):763-9.","pmid":"20685275","finding":"NO excess mortality in undiagnosed CD in 16,886 adults ≥50 over 10.3 years follow-up in Olmsted County. Contrasts sharply with Rubio-Tapia's 3.9-fold mortality in undiagnosed young adults followed 45 years.","contradicts":"Assumption that all undetected elderly CD is harmful. RECONCILIATION: Likely reflects survivor bias (sampled at ≥50 = survived to that age with mild disease) and the fact that primary clinical benefit of elderly CD diagnosis may be quality-of-life improvement (Vilppula) rather than mortality reduction. Also possible that long-standing undiagnosed CD in elderly triggers compensatory mechanisms not available to younger patients with aggressive disease. This finding should TEMPER urgency claims about elderly screening — the case is strong for quality-of-life benefit, weaker for mortality benefit.","evidence_quality":"Strong (large population-based study) — deserves prominent rather than peripheral discussion"},{"citation":"Rashtak S, Murray JA. Celiac Disease in the Elderly. Gastroenterol Clin North Am. 2009;38(3):433-46.","pmid":null,"finding":"Review notes that elderly CD patients may be 'as likely to have serologic abnormalities' as younger adults within diagnosed cohorts.","contradicts":"Thesis that elderly have systematically lower serology sensitivity. RECONCILIATION: Within diagnosed (serology-selected) cohorts, comparable seropositivity is expected because diagnosis itself selected for seropositivity. This observation constrains how low true sensitivity can be — if it were as low as 30%, we would expect to see larger age gradients even within diagnosed cohorts. The comparable rates within diagnosed cohorts are consistent with a true sensitivity moderately but not drastically below 57%.","evidence_quality":"Moderate (narrative review synthesizing existing data) — important counterpoint to extreme sensitivity decline estimates"}],"research_gaps":[{"gap":"No prospective biopsy-first study comparing IgA-tTG2 sensitivity across age groups — the single most critical evidence gap in the field","importance":"high","proposed_study_design":"Protocol duodenal biopsy regardless of serology in elderly (≥60) with CD-suggestive symptoms (IDA, osteoporosis, unexplained GI complaints). Blinded serology analysis. Would directly answer the central question of whether elderly sensitivity is lower and by how much."},{"gap":"HLA genotype distribution (DQ2.5 vs DQ2.2 vs DQ8) in elderly-onset vs younger-onset CD is unreported in any study","importance":"high","proposed_study_design":"Large multicenter genotype comparison with age-stratified analysis; would determine if elderly CD is enriched for lower-risk HLA haplotypes that produce weaker immune responses"},{"gap":"Performance of IgG-DGP and combined serological panels specifically in biopsy-verified elderly CD","importance":"medium","proposed_study_design":"Retrospective analysis of existing elderly cohorts with stored sera; prospective addition of IgG-DGP to elderly screening protocols"},{"gap":"Age-stratified verification bias correction of IgA-tTG2 sensitivity","importance":"high","proposed_study_design":"Apply Hujoel/Begg-Greenes methodology to age-stratified subgroups in existing datasets with differential biopsy rates"},{"gap":"Randomized trial of active CD case-finding vs standard care in elderly with IDA or osteoporosis","importance":"high","proposed_study_design":"Cluster-randomized in primary care/geriatrics clinics, with quality-of-life primary endpoint (given Godfrey mortality data)"},{"gap":"Siniscalco 2025 class-switching pathway (IgM→IgG1→IgA) has not been studied in the context of elderly CD or IgG1 deficiency","importance":"medium","proposed_study_design":"Measurement of class-switching intermediates in elderly vs younger CD patients and in IgG1-deficient CD patients"}],"differential_diagnoses_relevant":[{"condition":"Drug-induced enteropathy (olmesartan, NSAIDs, mycophenolate, checkpoint inhibitors)","overlap_with_cd":"Identical villous atrophy (Marsh 3) on biopsy; serology-negative; 68% HLA-DQ2 positive — HLA cannot distinguish","distinguishing_features":"No response to GFD; improvement on drug withdrawal; careful medication history review is essential FIRST step"},{"condition":"Microscopic colitis","overlap_with_cd":"70-fold increased risk in CD patients (SMR 72.39); peak incidence age 60–70; chronic watery diarrhea","distinguishing_features":"Normal endoscopic appearance; requires random colonic biopsies; may coexist with CD (25% simultaneous diagnosis)"},{"condition":"Common variable immunodeficiency (CVID) enteropathy","overlap_with_cd":"Villous atrophy in 51%, increased IELs in 76%; can present de novo in older adults; malabsorption","distinguishing_features":"PROFOUND DEPLETION OF PLASMA CELLS on biopsy (critical distinguishing feature); pan-hypogammaglobulinemia; does not respond to GFD"},{"condition":"Small intestinal bacterial overgrowth (SIBO)","overlap_with_cd":"Malabsorption, bloating, diarrhea; prevalence increases sharply with age; can COEXIST with CD","distinguishing_features":"Positive breath test; no villous atrophy; response to antibiotics; common cause of non-responsive CD"},{"condition":"Collagenous sprue","overlap_with_cd":"Classic disease of older women; villous atrophy with malabsorption; may be secondary to CD","distinguishing_features":"Subepithelial collagen band >20 μm on trichrome stain; poor response to GFD; can also follow olmesartan enteropathy"}],"recommendations":[{"recommendation":"Test for CD in all elderly patients with unexplained iron deficiency anemia, osteoporosis, persistent GI symptoms, or unexplained weight loss — do not attribute these to aging without ruling out CD","target":"clinicians","evidence_basis":"CD prevalence 3.2–5.5% in IDA (Mahadev meta-analysis); only 18% of PCPs currently test elderly IDA for CD (Spencer); GFD improves quality of life in screen-detected elderly (Vilppula)"},{"recommendation":"Perform duodenal biopsy on clinical suspicion even with negative/low-titer serology in elderly patients, especially during endoscopy already performed for other indications","target":"clinicians, guidelines","evidence_basis":"IgA-tTG2 sensitivity after verification bias correction is only 57% overall and likely lower in elderly; sensitivity drops to 42.3% for Marsh 3A (Abrams 2006); BSG guidelines recommend ≥4 biopsies from distal duodenum + 1–2 from bulb — but only 40% of UK endoscopies meet this standard (Taylor 2021)"},{"recommendation":"Review medications FIRST in any elderly patient with seronegative villous atrophy, particularly olmesartan and other ARBs, NSAIDs, mycophenolate, and checkpoint inhibitors","target":"clinicians","evidence_basis":"Drug-induced enteropathy accounts for 26% of seronegative VA; olmesartan produces identical histology to CD with 68% HLA-DQ2 positivity; FDA label change 2013"},{"recommendation":"Develop age-specific CD diagnostic algorithms with lower serology thresholds and/or mandatory biopsy pathways for patients >60 with suggestive symptoms","target":"guidelines","evidence_basis":"No current guideline (ACG, BSG, ESPGHAN, AGA) provides age-specific thresholds despite evidence of lower titers and higher seronegative rates with age"},{"recommendation":"Conduct the critical missing study: prospective biopsy-first, serology-blinded evaluation of elderly patients with CD-suggestive symptoms","target":"researchers","evidence_basis":"Without this study, the field cannot quantify how much CD the serology-first algorithm misses in elderly patients"},{"recommendation":"Frame elderly CD screening benefits in terms of quality of life improvement rather than mortality reduction, given Godfrey no-mortality data","target":"guidelines, researchers","evidence_basis":"Godfrey (PMID:20685275) found no excess mortality in undiagnosed elderly CD; Vilppula found significant QoL improvement on GFD in screen-detected elderly. Mortality benefit remains unproven."}],"meta_analysis_summary":{"studies_reviewed":25,"total_patients":null,"pooled_estimates":{"elderly_cd_prevalence_screening":"2.13–2.34% (Vilppula biopsy-confirmed)","undetected_proportion":"58–75% (Vilppula 58%, Kvamme 75%)","general_adult_adjusted_tTG2_sensitivity":"57.1% (95% CI 35.4–76.4%, Hujoel)","elderly_specific_tTG2_sensitivity":"UNKNOWN — hypothesized lower than 57% based on indirect evidence","marsh_3A_tTG2_sensitivity":"42.3% (Abrams 2006, single center)","persistent_va_elderly_OR":"5.1 (95% CI 2.5–10.4, ≥70 vs 18–29, Mahadev 2017)","seronegative_cd_complications_HR":"10.87 (Schiepatti 20-year)","seronegative_cd_mortality_HR":"2.18 (Schiepatti 20-year)","undiagnosed_elderly_mortality_HR":"~1.0 (Godfrey, no excess)"},"heterogeneity_notes":"Extreme heterogeneity across study designs: population screening (Vilppula, Kvamme, HUNT4) vs tertiary referral (Mukherjee, Abrams) vs historical cohort (Godfrey, Rubio-Tapia). The Mukherjee/Vilppula discrepancy on clinical presentation is resolved by recognizing referral selection bias. The Godfrey/Rubio-Tapia discrepancy on mortality is partially explained by survivor bias and age-at-sampling differences. No meta-analysis specific to elderly CD serology performance exists."}}
