{"research_topic_id":"3.7","research_topic_title":"Racial and Ethnic Bias in Celiac Disease Diagnosis","date_completed":"2026-02-08","executive_summary":"The reported 4-8× CD prevalence gap between white and minority Americans is substantially an artifact of compounding diagnostic failures at every cascade step: lower clinical suspicion, lower testing rates (OR 0.52 for Black children), lower biopsy rates (OR 0.55 for Black adults), and dramatically lower IgA-tTG2 sensitivity in Black biopsy-confirmed patients (80% seronegative vs ~9% in whites). A critical methodological insight: because Black patients are less likely to be pre-filtered through serology before biopsy, their biopsy-confirmed cohort represents a LESS verification-biased sample — meaning the 80% seronegativity rate may partly reveal what true CD seronegativity looks like when biopsy is performed independent of serologic gating, with implications for ALL populations. The Hujoel verification-bias correction (57% general tTG2 sensitivity) and NHANES concordance data (72% in whites vs 32% in non-whites) provide independent confirmation that serology performs differently across populations. Global data — Saharawi 5.6%, North India 1.04%, Africa biopsy-confirmed prevalence equal to North America — definitively refute the 'European disease' narrative. No major clinical guideline addresses racial considerations in CD diagnostic algorithms.","key_findings":[{"finding_id":"3.7.1","finding":"NHANES serology-only prevalence: White 1.08%, Black 0.22%, Hispanic 0.23%; All of Us EHR-based: White 1.08%, Hispanic 0.36%, Black 0.16%. Both rely on serology-dependent case identification. The foundational Fasano 2003 prevalence study (PMID:12578508) excluded race from analysis 'due to low number of nonwhites' — US prevalence data is racially uninformative by design.","evidence_strength":"strong","quantitative_estimate":"White 1.08%; Black 0.16-0.22%; Hispanic 0.23-0.36%","confidence_interval":null,"key_citations":["PMID:25577269","doi:10.1101/2024.12.20.24319436","PMID:12578508"],"contradicts_guidelines":false,"affected_patient_population":"US Black and Hispanic populations"},{"finding_id":"3.7.2","finding":"True prevalence gap is likely 1.5-2.5× (not 4-8×). Global biopsy-confirmed data: Africa has prevalence equal to North America (0.5%) despite lowest seroprevalence of any continent. Saharawi population 5.6%, Northern India 1.04%, Argentina Amerindians 2.1%. The Singh et al. 2018 meta-analysis (96 studies, 275,818 individuals) showed the Africa seroprevalence-biopsy discordance, suggesting serologic tools systematically underdetect CD in African-descent populations.","evidence_strength":"moderate","quantitative_estimate":"Estimated true minority prevalence 0.4-0.8%; true gap ~1.5-2.5×","confidence_interval":null,"key_citations":["PMID:29551598","PMID:10466670","PMID:21182543","PMID:26207618"],"contradicts_guidelines":true,"affected_patient_population":"All non-European ancestry populations"},{"finding_id":"3.7.3","finding":"80% of Black patients with biopsy-confirmed CD had IgA-tTG2 below upper limit of normal vs ~9% of whites at UAB Celiac Disease Registry (852 patients, 42 Black). CRITICAL METHODOLOGICAL NOTE: Black patients are less pre-filtered through serology before biopsy (due to lower testing rates and more incidental endoscopic discovery), so this cohort represents a LESS verification-biased sample. The 80% seronegativity may partly reflect what true CD seronegativity looks like when biopsy is independent of serologic gating.","evidence_strength":"strong","quantitative_estimate":"80% seronegative in Black vs ~9% in White biopsy-confirmed patients","confidence_interval":null,"key_citations":["PMID:39132179","doi:10.1016/j.gastha.2023.08.014"],"contradicts_guidelines":true,"affected_patient_population":"Black Americans with villous atrophy; implications for all populations"},{"finding_id":"3.7.3a","finding":"The less-biased-sampling interpretation: White biopsy-confirmed cohorts show ~9% seronegativity because they are heavily pre-selected by positive serology (verification bias inflates apparent sensitivity). Hujoel general verification-bias correction yields ~43% seronegativity. Black cohorts, being less serologically pre-filtered, show ~80% seronegativity. The true population-level seronegativity rate when biopsy is independent of serology likely lies in the 40-60% range for all populations, with possible additional biological elevation in Black patients due to non-AH8.1 haplotype backgrounds. The ~9% in white cohorts is the artifact, not the 80% in Black cohorts.","evidence_strength":"moderate","quantitative_estimate":"Predicted true seronegativity: 35-45% in whites, 55-70% in Blacks when biopsy is independent of serology","confidence_interval":null,"key_citations":["PMID:32433257","PMID:39132179","PMID:39132190"],"contradicts_guidelines":true,"affected_patient_population":"All CD patients — the ~9% seronegativity in white cohorts is the artifact"},{"finding_id":"3.7.4","finding":"NHANES tTG2/EMA concordance was 72% in whites vs 32% in non-whites (p=0.010). Non-whites more likely to have weakly positive tTG2 with positive EMA (26.4% vs 3.6%, p=0.03). This is from population-based screening unaffected by differential biopsy pathways, confirming serology behaves differently across populations independent of selection effects. This is the strongest evidence of race-differential test performance because it is uncontaminated by biopsy selection bias.","evidence_strength":"strong","quantitative_estimate":"72% concordance White vs 32% non-White","confidence_interval":null,"key_citations":["PMID:25577269"],"contradicts_guidelines":true,"affected_patient_population":"Non-white US populations"},{"finding_id":"3.7.5","finding":"Black children have OR 0.52 (95% CI 0.48-0.55) for receiving CD screening vs white children across 223,449 high-risk pediatric patients in the Optum claims database (2007-2022). Only 6.7% of eligible Black children screened vs 12.2% of white children. Disparity persists across all high-risk conditions including type 1 diabetes, family history, and chronic diarrhea.","evidence_strength":"strong","quantitative_estimate":"OR 0.52 (95% CI 0.48-0.55) for Black vs White screening","confidence_interval":"95% CI 0.48-0.55","key_citations":["Miller et al. 2025, Dig Dis Sci, doi:10.1007/s10620-025-09459-0"],"contradicts_guidelines":false,"affected_patient_population":"Black children with CD risk factors"},{"finding_id":"3.7.6","finding":"Duodenal biopsies performed in 44% of whites vs 28% of Blacks (OR 0.55, 95% CI 0.48-0.64) during endoscopy for suggestive symptoms (diarrhea, anemia, iron deficiency, weight loss) with normal-appearing mucosa (n=13,091, CORI national endoscopy database 2004-2009). Hispanic patients also reduced (OR 0.69).","evidence_strength":"strong","quantitative_estimate":"44% biopsy rate White vs 28% Black; OR 0.55","confidence_interval":"95% CI 0.48-0.64","key_citations":["PMID:22732871","doi:10.1016/j.gie.2012.05.011"],"contradicts_guidelines":false,"affected_patient_population":"Black and Hispanic patients undergoing upper endoscopy"},{"finding_id":"3.7.7","finding":"Black race associated with 91% decreased odds of appropriate CD/IBD workup (OR 0.095, 95% CI 0.017-0.527, p=0.007) at University of Chicago among 83 patients with both IDA and chronic diarrhea who lacked prior CD/IBD diagnoses. Public insurance independently conferred 90% decreased odds. A national ACP survey (Spencer et al. 2017) found 61% of PCPs would order CD serology for a young white man with IDA vs 48% for an identical young Black man — a 13 percentage point gap reflecting embedded racial assumptions about CD susceptibility.","evidence_strength":"strong","quantitative_estimate":"OR 0.095 (95% CI 0.017-0.527) for appropriate workup in Black patients; 61% vs 48% PCP serologic testing by race","confidence_interval":"95% CI 0.017-0.527","key_citations":["PMID:32638203","doi:10.1007/s10620-020-06434-9","PMID:28931034"],"contradicts_guidelines":false,"affected_patient_population":"Black Americans presenting with CD-associated symptoms"},{"finding_id":"3.7.8","finding":"HLA-DQ2.5 is present in all ancestries at varying frequencies. Ethiopian children: combined moderate-to-high risk genotypes 27.4% vs Swedish 29.0% (p=0.35). Trans-encoded DQ2.5 was 3× more common in Ethiopians. Black Americans: ~35% carry one copy DQ2, ~6% carry DQ8; ~50% carry at least one CD-risk allele (vs ~60% whites). The ancestral haplotype 8.1 (A1-B8-C7-DR3-DQ2.5) is absent in non-European ancestries — non-European CD occurs on entirely different haplotype backgrounds, with unknown immunological consequences.","evidence_strength":"moderate","quantitative_estimate":"Combined HLA risk: Ethiopian 27.4% vs Swedish 29.0%; ~50% Black Americans carry CD-risk alleles","confidence_interval":null,"key_citations":["doi:10.1111/tan.14119","doi:10.1101/2024.12.20.24319436"],"contradicts_guidelines":false,"affected_patient_population":"Non-European ancestry populations"},{"finding_id":"3.7.9","finding":"HLA-DQ8 dominates in Hispanic/Latino populations (Indigenous American DQ8 phenotype frequency 77-90%); 94.5% of Toba Amerindian CD risk was DQ8. 16.5% of CD patients in All of Us lacked all known HLA-DQ risk haplotypes. Novel risk alleles (DQ6 in Japan, DQ9.3 in China) identified outside European populations. Standard HLA panels testing only DQ2.5/DQ2.2/DQ8 are inadequate for non-European populations.","evidence_strength":"moderate","quantitative_estimate":"16.5% of diverse CD patients lack known HLA risk haplotypes; DQ8 in 94.5% of Amerindian CD-risk carriers","confidence_interval":null,"key_citations":["doi:10.1101/2024.12.20.24319436","PMID:26207618"],"contradicts_guidelines":true,"affected_patient_population":"Non-European CD patients; HLA-DQ2/DQ8-negative patients"},{"finding_id":"3.7.10","finding":"Black CD patients present with significantly higher BMI (33.7 ± 10.8 kg/m², p=0.01), more constipation, anemia of chronic disease (OR 2.94), epilepsy (OR 2.13), SLE (OR 2.27). Less dermatitis herpetiformis (OR 0.36), less autoimmune thyroiditis, less family history. Atypical presentation reduces clinical suspicion.","evidence_strength":"moderate","quantitative_estimate":"BMI 33.7 in Black vs lower in White CD patients","confidence_interval":null,"key_citations":["PMID:39132179","doi:10.1016/j.gastha.2023.08.014"],"contradicts_guidelines":false,"affected_patient_population":"Minority CD patients presenting atypically"},{"finding_id":"3.7.11","finding":"IgA deficiency is 12× LESS common in African Americans (1/6,000) than Caucasians (1/500-600). African ancestry associated with HIGHER baseline serum IgA and total IgG (1,504 vs 988 mg/dL) and IgG1 (938 vs 592 mg/dL). The high seronegativity in Black CD patients CANNOT be explained by IgA deficiency — it likely reflects different antibody affinity, epitope recognition, or assay calibration problems. The paradox of higher baseline immunoglobulins with lower disease-specific antibody detection strengthens the assay calibration hypothesis.","evidence_strength":"strong","quantitative_estimate":"IgA deficiency: 1/6,000 Black vs 1/500-600 White; IgG: 1,504 vs 988 mg/dL","confidence_interval":null,"key_citations":["doi:10.1038/s41467-022-34456-6","PMID:32224206"],"contradicts_guidelines":false,"affected_patient_population":"Black CD patients — IgA deficiency is excluded as explanation"},{"finding_id":"3.7.12","finding":"Modeled diagnostic cascade shows 2-5× amplified missed-diagnosis rate in Black vs White patients. Per 1,000 with true CD: White ~510 diagnosed (51%); Black ~96-244 diagnosed (10-24%). Biases are multiplicative: lower clinical suspicion × lower testing rates × lower serology sensitivity × lower biopsy rates compound at each step to create a compounding diagnostic failure.","evidence_strength":"moderate","quantitative_estimate":"75-90% non-diagnosis probability in Black CD vs ~49% in White CD","confidence_interval":null,"key_citations":["Derived from PMID:22732871, PMID:32433257, PMID:39132179"],"contradicts_guidelines":true,"affected_patient_population":"Black Americans with celiac disease"},{"finding_id":"3.7.13","finding":"82% of African American children with type 1 diabetes carried HLA-DQ2 or DQ8, yet 94% were serology-negative for CD. High HLA carriage with near-universal seronegativity in a high-risk population suggests serologic tests are failing in this population rather than that CD is absent.","evidence_strength":"moderate","quantitative_estimate":"82% HLA-DQ2/DQ8+ but 94% serology-negative","confidence_interval":null,"key_citations":["PMID:18806716"],"contradicts_guidelines":true,"affected_patient_population":"African American children with type 1 diabetes"},{"finding_id":"3.7.14","finding":"63% of Black Americans had no awareness of celiac disease (vs 49% Hispanic, 47% white). Patients report being told they 'could not have celiac disease because of their race.' Low awareness compounds diagnostic disparities at the patient-initiated seeking-care level.","evidence_strength":"moderate","quantitative_estimate":"63% no awareness in Black vs 47% in White Americans","confidence_interval":null,"key_citations":["Beyond Celiac Harris Poll 2022"],"contradicts_guidelines":false,"affected_patient_population":"Black Americans"},{"finding_id":"3.7.15","finding":"CD prevalence in Northern India correlated with wheat intake (1.23% in wheat-heavy North vs 0.10% in rice-based South) despite similar HLA-DQ2/DQ8 frequencies (38% vs 36%). Environmental exposure, not genetics alone, drives CD expression — cross-population comparisons that assume genetically determined prevalence are unreliable.","evidence_strength":"strong","quantitative_estimate":"1.23% North vs 0.10% South India; HLA 38% vs 36%","confidence_interval":null,"key_citations":["PMID:26729543"],"contradicts_guidelines":false,"affected_patient_population":"All populations — wheat exposure is a modifiable risk factor"},{"finding_id":"3.7.16","finding":"The Swedish CD epidemic demonstrates environmental factors can overwhelm genetic determinism: 4-fold increase in CD incidence 1985-1987 in a genetically stable population after infant feeding practice changes. Screening of 12-year-olds born during the epidemic found 3% prevalence with two-thirds previously undiagnosed.","evidence_strength":"strong","quantitative_estimate":"4× incidence increase; 3% prevalence in epidemic birth cohort","confidence_interval":null,"key_citations":["PMID:10709885","PMID:19516192"],"contradicts_guidelines":false,"affected_patient_population":"All — demonstrates prevalence is environmentally modifiable"},{"finding_id":"3.7.17","finding":"No major tTG-IgA commercial assay manufacturer has published validation data from racially diverse cohorts. Cutoff values defining 'positive' were established in predominantly European-descent reference populations. The ESPGHAN no-biopsy pathway (tTG-IgA ≥10×ULN + positive EMA) would exclude virtually all minority CD patients who have systematically lower tTG2 levels.","evidence_strength":"strong","quantitative_estimate":null,"confidence_interval":null,"key_citations":["PMID:39132190","doi:10.1016/j.gastha.2023.12.002"],"contradicts_guidelines":true,"affected_patient_population":"All non-European ancestry CD patients"}],"biases_documented":[{"bias_type":"reverse verification bias (less-biased-sampling effect)","description":"Black biopsy-confirmed CD cohorts are LESS pre-filtered by serology than white cohorts because Black patients are less likely to receive serologic testing first. This means Black biopsy-confirmed patients represent a less verification-biased sample, and their 80% seronegativity rate may be closer to the true population rate of seronegative CD than the artificially low ~9% rate in verification-bias-enriched white cohorts. The Hujoel general correction (57% sensitivity / 43% seronegativity) falls between these two extremes, consistent with intermediate verification bias intensity.","magnitude_estimate":"True seronegativity when biopsy is independent of serology likely 40-60% across all populations, possibly higher in non-European ancestries","evidence_sources":["PMID:39132179","PMID:39132190","PMID:32433257"]},{"bias_type":"verification bias in white CD cohorts","description":"White CD cohorts are heavily pre-selected by positive serology: most white patients get tested → seropositives get biopsied → biopsy-confirmed group artificially enriched for seropositives. The ~9% seronegativity in white biopsy-confirmed patients is the artificially deflated artifact, not the baseline.","magnitude_estimate":"White cohort seronegativity deflated from estimated true 35-45% to observed ~9% by serologic pre-selection","evidence_sources":["PMID:32433257","PMID:39132190"]},{"bias_type":"clinician suspicion bias","description":"PCPs 13 percentage points less likely to order CD serology for Black vs identical White patient. Black race associated with 91% decreased odds of appropriate workup (OR 0.095). 63% of Black Americans had no awareness of CD (vs 47% White). Patients report being told they 'could not have celiac disease because of their race.'","magnitude_estimate":"OR 0.095 for appropriate workup in Black patients; 13pp gap in PCP testing decisions; 16pp awareness gap","evidence_sources":["PMID:32638203","PMID:28931034","Beyond Celiac Harris Poll 2022"]},{"bias_type":"biopsy access bias","description":"Duodenal biopsies during endoscopy performed in 44% of White vs 28% of Black patients with normal-appearing mucosa and suggestive symptoms. This directly reduces CD detection in Black patients but paradoxically means those who ARE biopsied may have stronger clinical indications, creating a less serologically pre-filtered sample.","magnitude_estimate":"OR 0.55 (95% CI 0.48-0.64) for biopsy in Black patients","evidence_sources":["PMID:22732871"]},{"bias_type":"selection bias in prevalence studies","description":"NHANES and All of Us use serology-dependent case identification. If IgA-tTG2 sensitivity varies by race (confirmed by NHANES concordance data: 72% White vs 32% non-White), these studies systematically undercount minority CD proportionally to the sensitivity gap.","magnitude_estimate":"Minority prevalence underestimated by factor of 2-4× in serology-only surveys","evidence_sources":["PMID:25577269","PMID:29551598"]},{"bias_type":"circular validation in guidelines","description":"Low observed prevalence in minorities (from biased studies) → reduced clinical suspicion → less testing and biopsy → fewer diagnoses → apparent confirmation of low prevalence. Hujoel 2024 editorial explicitly describes this vicious cycle for Black Americans.","magnitude_estimate":"Self-reinforcing; magnitude increases over time","evidence_sources":["PMID:39132190"]},{"bias_type":"assay calibration bias","description":"tTG-IgA cutoffs derived from European cohorts without diverse validation. No commercial manufacturer has published multi-racial validation data. Fixed cutoffs may not discriminate correctly in populations with different baseline immunoglobulin distributions (Black patients have higher total IgG, IgG1, and IgA levels).","magnitude_estimate":"Potentially responsible for substantial fraction of the 80% seronegativity in Black patients","evidence_sources":["PMID:39132179","PMID:25577269","PMID:32224206"]},{"bias_type":"racial exclusion in foundational studies","description":"Fasano 2003 landmark prevalence study excluded race from analysis 'due to low number of nonwhites.' Foundational US prevalence data is racially uninformative by design, yet used to establish clinical expectations.","magnitude_estimate":"Complete absence of race-stratified data in most-cited US prevalence study","evidence_sources":["PMID:12578508"]}],"unproven_assumptions_identified":[{"assumption":"IgA-tTG2 sensitivity is uniformly >95% across racial/ethnic groups","evidence_against":"80% seronegativity in Black biopsy-confirmed patients; 32% tTG2/EMA concordance in non-whites vs 72% in whites; general verification-bias-adjusted sensitivity only 57%; 94% seronegativity in African American children with T1D carrying HLA risk alleles","evidence_for":"No race-stratified biopsy-independent study directly measures sensitivity by race; the 80% figure is from a small sample (n=42 Black, ~10-15 biopsy-confirmed) and is partly explained by less serologic pre-filtering of the Black cohort","clinical_impact":"If true, serology-first algorithms miss 40-80% of minority CD patients depending on ancestry"},{"assumption":"The 80% seronegativity in Black CD patients reflects purely biological differences in tTG2 antibody response","evidence_against":"Selection effects partly explain the finding: Black patients are less pre-filtered through serology before biopsy, creating a less verification-biased sample that naturally shows higher seronegativity","evidence_for":"NHANES concordance data (population-based, no biopsy selection) independently shows different serologic behavior; IgA deficiency (obvious confounder) is 12× LESS common in Black Americans; 'negative but detectable' tTG2 pattern suggests antibody present but below threshold; IgG subclass differences confirmed across races","clinical_impact":"Even if partly selection artifact, the clinical consequence is identical: Black patients with true CD are being missed by serology-gated algorithms"},{"assumption":"The 4-8× prevalence gap between White and minority Americans reflects true biological disease frequency differences","evidence_against":"Global biopsy-confirmed prevalence similar across continents despite seroprevalence differences; Saharawi 5.6%, India 1.04%; HLA risk alleles present in all ancestries; combined moderate-high risk genotypes similar in Ethiopian vs Swedish children (27.4% vs 29.0%); ~50% of Black Americans carry CD-permissive HLA","evidence_for":"HLA-DQ2.5 frequency genuinely lower in African and East Asian populations; some real prevalence difference expected from genetic factors; the true gap may be 1.5-2.5×. East Asian populations (Japan, Korea) where DQ2 <1-5% and diets rice-based may have genuinely lower prevalence.","clinical_impact":"Overestimating the true prevalence gap perpetuates the myth that CD is a 'white disease' and reduces clinical suspicion in minorities"},{"assumption":"Standard HLA screening panels (DQ2.5, DQ2.2, DQ8) have adequate negative predictive value across all ancestries","evidence_against":"16.5% of CD patients in diverse All of Us cohort lacked all known HLA risk haplotypes; novel risk alleles DQ6 (Japan), DQ9.3 (China) identified; panels never validated in non-European populations","evidence_for":null,"clinical_impact":"HLA-negative CD may be more common in non-European populations, adding another layer of diagnostic failure"}],"overlooked_populations":[{"population":"Black Americans with seronegative celiac disease","estimated_size":"Unknown but potentially 100,000-350,000 undiagnosed; if true Black CD prevalence is 0.4-0.8% of ~47M Black Americans and 55-80% are seronegative","why_missed":"Serology-first algorithms combined with lower clinical suspicion, lower testing rates, and lower biopsy rates create triple-compounding diagnostic failure. The less-biased-sampling insight suggests these patients represent what unfiltered CD actually looks like.","proposed_solution":"Lower biopsy threshold in symptomatic Black patients regardless of serology; routine duodenal biopsy during all EGDs for GI indications; consider race-specific tTG2 thresholds or reflex to EMA/DGP-IgG"},{"population":"Hispanic/Latino Americans with DQ8-predominant CD","estimated_size":"Potentially 200,000-400,000 undiagnosed based on estimated 0.4-0.6% true prevalence in 65M US Hispanic population","why_missed":"HLA-DQ8 associated with different clinical phenotype and possibly different serologic behavior than DQ2.5-mediated CD; algorithms optimized for DQ2.5-driven serology; lower testing rates","proposed_solution":"Include DQ8 equally in risk stratification; targeted screening in high-risk Hispanic populations (type 1 diabetes, IDA, family history); evaluate DGP-IgG performance"},{"population":"All-race seronegative CD patients revealed by the less-biased-sampling interpretation","estimated_size":"If true seronegativity is 40-60% across all populations (as Black cohort data and Hujoel correction suggest), millions of seronegative CD patients of ALL races are being missed globally","why_missed":"Verification bias in predominantly white cohorts creates the illusion of ~95% tTG2 sensitivity; only less serologically filtered cohorts (Black patients, incidental biopsy findings) reveal the true seronegativity rate","proposed_solution":"Routine duodenal biopsy during all upper endoscopies regardless of CD suspicion or serology status; population-based screening with biopsy independent of serology"},{"population":"Non-European populations with novel HLA risk alleles (DQ6, DQ9.3, unknown)","estimated_size":"16.5% of CD patients in diverse cohorts lack standard risk alleles","why_missed":"HLA panels designed for European populations; novel risk alleles not included in commercial tests","proposed_solution":"Expanded HLA panels validated across ancestries; do not use HLA-DQ2/DQ8 negativity to rule out CD in non-European patients"},{"population":"Sub-Saharan African populations","estimated_size":"Over 1 billion people; CD prevalence unknown due to near-complete absence of screening studies","why_missed":"Lack of diagnostic infrastructure; perceived absence of disease; wheat consumption increasing rapidly with urbanization; HLA-DQ2/DQ8 carried by ~27% of Ethiopians","proposed_solution":"Population-based screening studies in wheat-consuming Sub-Saharan populations; awareness campaigns"}],"diagnostic_step_sensitivity":{"step_name":"IgA-tTG2 serology — race-stratified with verification bias decomposition","reported_sensitivity":">95% in guidelines (derived from verification-bias-inflated European cohorts)","adjusted_sensitivity":"57% general after Hujoel verification-bias correction; ~20% in Black biopsy-confirmed patients (partly biological, partly less-biased sampling); estimated true sensitivity when biopsy is independent of serology: 40-65% across all populations","false_negative_rate":"~80% in Black biopsy-confirmed (upper bound, includes selection effects); ~43% general after bias correction; ~9% in white biopsy-confirmed (lower bound, deflated by serologic pre-selection)","key_limitations":["No race-stratified biopsy-independent sensitivity study exists","Cartee Black subgroup is small (42 Black patients total, ~10-15 biopsy-confirmed)","The 80% figure conflates biological differences with less-biased sampling — cannot separate without prospective design","The ~9% in white cohorts is artificially low due to verification bias, not a valid comparator","No commercial IgA-tTG2 assay has been validated across racial/ethnic groups","The Hujoel 57% correction (95% CI 35-76%) has wide confidence intervals","NHANES concordance data (72% White vs 32% non-White) provides independent population-based evidence of differential test behavior unaffected by biopsy selection","IgA deficiency explanation excluded (12× less common in Black Americans)","Higher baseline immunoglobulin levels in Black patients paradoxically associated with lower CD-specific antibody detection"]},"contradictory_studies":[{"citation":"Cartee et al. 2024, Gastro Hep Advances — Black Patients Are More Likely to Have Negative Serologies With Celiac Consistent Histology","pmid":"39132179","finding":"80% of Black biopsy-confirmed CD patients had IgA-tTG2 below upper limit of normal. Partly reflects less verification-biased sampling pathway.","contradicts":"Guideline claims of >95% IgA-tTG2 sensitivity; may be closer to true sensitivity when verification bias is removed"},{"citation":"Hujoel et al. 2021, J Clin Gastroenterol — Estimating the Impact of Verification Bias on Celiac Disease Testing","pmid":"32433257","finding":"After verification bias correction, IgA-tTG2 sensitivity drops to 57.1% (95% CI 35.4-76.4%) in general population. Only 3.6% of tTG-negative patients referred for biopsy vs 79.2% of tTG-positive.","contradicts":"Guideline-reported >95% sensitivity; falls between the ~9% white-biopsy-confirmed rate and 80% Black rate"},{"citation":"Singh et al. 2018, Clin Gastroenterol Hepatol — Global Prevalence of Celiac Disease: Systematic Review and Meta-analysis","pmid":"29551598","finding":"Africa has lowest seroprevalence of any continent but biopsy-confirmed prevalence (0.5%) equal to North America","contradicts":"Assumption that low seroprevalence = low true prevalence in African populations"},{"citation":"Mardini et al. 2015, Dig Dis Sci — Racial Differences in Celiac Disease Prevalence (NHANES 2009-2012)","pmid":"25577269","finding":"tTG2/EMA concordance 72% in whites vs 32% in non-whites; non-whites more likely to have positive EMA with weakly positive tTG2 (26.4% vs 3.6%)","contradicts":"Assumption that tTG2 performs uniformly across populations; population-based evidence independent of biopsy selection"},{"citation":"All of Us Research Program Preprint, medRxiv December 2024","pmid":null,"finding":"16.5% of diverse CD patients lack all known HLA risk haplotypes; AH8.1 extended haplotype absent in non-European ancestries; distinct clinical features in minority CD","contradicts":"Guideline assumption that DQ2/DQ8 negativity effectively rules out CD"},{"citation":"Kaistha et al. 2008, Pediatr Endocrinol Rev — Celiac disease in African American children with T1D","pmid":"18806716","finding":"82% of African American children with T1D carried HLA-DQ2/DQ8 yet 94% were serology-negative for CD","contradicts":"Expectation that high-risk HLA carriers in high-risk populations should show detectable celiac serology"},{"citation":"Hujoel 2024, Gastro Hep Advances — Current Diagnostic Algorithms May Fail to Identify Black Americans With Celiac Disease","pmid":"39132190","finding":"Explicitly describes the vicious cycle of underdiagnosis in Black Americans and argues current algorithms encode racial bias","contradicts":"Implicit assumption in guidelines that diagnostic algorithms perform equitably across racial groups"}],"research_gaps":[{"gap":"Population-based US screening with biopsy INDEPENDENT of serology across diverse racial/ethnic groups — the essential missing study","importance":"high","proposed_study_design":"Screen diverse cohort with both serology and routine duodenal biopsy (serology-blinded biopsy), stratified by genetic ancestry. Would simultaneously measure true prevalence by race, true sensitivity of tTG2 by race, and quantify verification bias across populations."},{"gap":"Separate the biological from selection-bias components of the 80% seronegativity in Black CD patients","importance":"high","proposed_study_design":"Compare seronegativity rates in white vs Black CD patients diagnosed via the SAME pathway (e.g., incidental biopsy during endoscopy for non-CD indications). If white incidental CD shows 40-50% seronegativity and Black shows 60-80%, the difference quantifies the biological component."},{"gap":"Race-specific IgA-tTG2 thresholds — no commercial assay validated across ancestries","importance":"high","proposed_study_design":"Multi-ancestry cohort with standardized serology (quantitative tTG2 levels, not just positive/negative) and biopsy, examining optimal cutoffs by genetic ancestry"},{"gap":"Validation of HLA screening panels in non-European populations","importance":"high","proposed_study_design":"Expanded HLA typing (beyond DQ2.5/DQ2.2/DQ8 to include DQ6, DQ9.3, novel alleles) in biopsy-confirmed CD patients of diverse ancestries"},{"gap":"Evaluation of alternative serologic markers (DGP-IgG, EMA) performance stratified by race/ethnicity","importance":"high","proposed_study_design":"Multi-ancestry biopsy-confirmed cohort with parallel testing of IgA-tTG2, DGP-IgG, EMA, and total IgA; DGP-IgG is a logical candidate for cases missed by IgA-tTG2"},{"gap":"Mechanism of seronegativity in non-European CD — haplotype-linked antibody kinetics","importance":"medium","proposed_study_design":"Compare tTG2 antibody affinity, epitope specificity, serum vs mucosal antibody ratios, and class-switching patterns (IgM→IgG1→IgA per Siniscalco 2025 PMID:41253159) across HLA haplotype backgrounds"},{"gap":"Routine duodenal biopsy during all upper endoscopies — impact on CD detection rates by race","importance":"medium","proposed_study_design":"Pragmatic trial mandating duodenal biopsy during all EGDs at diverse centers, measuring CD detection rates before and after implementation, stratified by race"},{"gap":"Replication of Cartee 80% finding in larger multi-center cohorts","importance":"high","proposed_study_design":"Multi-center pathology database review of all patients with biopsy-confirmed villous atrophy, with retrospective serology and demographic correlation, at centers serving diverse populations"}],"differential_diagnoses_relevant":[{"condition":"NCGS (Non-Celiac Gluten Sensitivity)","overlap_with_cd":"Similar GI symptoms; more commonly diagnosed in minority patients. If tTG2 is falsely negative in minorities, some patients diagnosed with NCGS may have undiagnosed seronegative CD misclassified. Choung et al. noted increased GFD adoption without CD diagnosis in Black Americans.","distinguishing_features":"No villous atrophy; no celiac-specific antibodies. But if tTG2 is falsely negative, the distinction becomes unreliable. Biopsy is the only reliable differentiator."},{"condition":"Tropical sprue","overlap_with_cd":"Villous atrophy in populations from tropical regions; more likely to be considered in minority patients, creating risk of misdiagnosis when a Black patient with seronegative villous atrophy is diagnosed with tropical sprue instead of CD.","distinguishing_features":"Response to antibiotics; travel history; different geographic distribution. HLA typing and gluten challenge may help differentiate."},{"condition":"IBD (especially Crohn's disease)","overlap_with_cd":"GI symptoms, malabsorption, anemia. More commonly suspected in Black patients than CD, potentially diverting from CD diagnosis.","distinguishing_features":"Endoscopic and histologic pattern; granulomas; skip lesions; different distribution. Co-occurrence is possible."},{"condition":"Drug-induced enteropathy (olmesartan, NSAIDs)","overlap_with_cd":"Villous atrophy mimicking CD. Cartee study explicitly excluded these causes.","distinguishing_features":"Temporal relationship to drug; resolution on drug withdrawal; absence of HLA risk alleles"},{"condition":"Autoimmune enteropathy / CVID","overlap_with_cd":"Villous atrophy with seronegative presentation","distinguishing_features":"Anti-enterocyte antibodies (AIE); low immunoglobulins (CVID); different IEL phenotype"}],"recommendations":[{"recommendation":"Perform duodenal biopsy in ALL symptomatic patients with suggestive symptoms (IDA, chronic diarrhea, unexplained weight loss, osteoporosis) regardless of serology AND regardless of race — the less-biased-sampling insight shows high seronegativity affects all populations, not just minorities","target":"clinicians","evidence_basis":"Hujoel verification bias correction (57% general sensitivity); Cartee 80% seronegativity in less-filtered cohort; 44% vs 28% biopsy rate disparity (PMID:22732871)"},{"recommendation":"Mandate routine duodenal biopsy during all upper endoscopies regardless of indication","target":"guidelines (ACG, AGA, ESPGHAN)","evidence_basis":"Low marginal cost; would eliminate verification bias at biopsy step; would detect seronegative CD across all populations; directly addresses racial biopsy gap"},{"recommendation":"Require tTG-IgA assay manufacturers to publish sensitivity and specificity data stratified by racial/ethnic groups using biopsy gold standard in diverse cohorts","target":"diagnostic manufacturers, FDA, regulatory bodies","evidence_basis":"No existing race-specific validation data; NHANES concordance data shows 32% concordance in non-whites; 80% seronegativity in Black CD"},{"recommendation":"Develop race-specific IgA-tTG2 reference ranges or implement universal reflex testing (EMA and/or DGP-IgG) when tTG2 is negative with clinical suspicion","target":"diagnostic manufacturers, guidelines","evidence_basis":"NHANES concordance data; 'negative but detectable' tTG2 pattern in Black CD; higher baseline immunoglobulin levels across races (PMID:32224206)"},{"recommendation":"Update clinical guidelines (ACG, ESPGHAN, AGA) to explicitly address racial considerations: lower serologic thresholds for non-white patients, broader biopsy indications, caution against no-biopsy pathway in diverse populations until validated across ancestries","target":"guidelines","evidence_basis":"All of Us cohort data, Cartee registry, Hujoel editorial (PMID:39132190)"},{"recommendation":"Expand HLA screening panels beyond DQ2.5/DQ2.2/DQ8 to include DQ6, DQ9.3, and trans-encoded configurations, validated across ancestries","target":"diagnostic manufacturers, researchers","evidence_basis":"16.5% of diverse CD patients lack standard risk haplotypes; novel risk alleles in non-European populations"},{"recommendation":"Eliminate the clinical teaching that CD is a 'disease of white Europeans' — replace with evidence that CD is a global disease present in all ancestries with prevalence of 0.5-5.6% depending on HLA frequency and wheat consumption","target":"medical education, clinicians","evidence_basis":"Saharawi 5.6% (PMID:10466670), India 1.04% (PMID:21182543), Africa biopsy-prevalence = North America (PMID:29551598); Harris Poll 63% Black American unawareness"},{"recommendation":"Fund the essential missing study: population-based US screening with serology-blinded biopsy across diverse racial/ethnic groups","target":"researchers, NIH, NIDDK","evidence_basis":"No such study exists; all prevalence estimates are confounded by verification bias that differentially affects minorities"},{"recommendation":"Investigate the less-biased-sampling hypothesis: compare seronegativity rates across races in patients biopsied via the same non-serologic pathway (incidental endoscopy findings)","target":"researchers","evidence_basis":"Would separate biological from selection-bias components and clarify true seronegativity rate across all populations"}],"meta_analysis_summary":{"studies_reviewed":29,"total_patients":null,"pooled_estimates":{"NHANES_prevalence_white":"1.08%","NHANES_prevalence_black":"0.22%","NHANES_prevalence_hispanic":"0.23%","AllOfUs_prevalence_white":"1.08%","AllOfUs_prevalence_black":"0.16%","AllOfUs_prevalence_hispanic":"0.36%","estimated_true_prevalence_black":"0.4-0.8%","estimated_true_prevalence_gap":"1.5-2.5x (not 4-8x)","Saharawi_prevalence":"5.6%","North_India_prevalence":"1.04%","global_seroprevalence":"1.4% (Singh 2018)","global_biopsy_prevalence":"0.7% (Singh 2018)","Africa_biopsy_prevalence":"0.5% (equal to North America)","tTG2_seronegativity_white_biopsy_confirmed":"~9% (verification-bias deflated)","tTG2_seronegativity_black_biopsy_confirmed":"~80% (less verification-biased sample)","tTG2_seronegativity_general_bias_corrected":"~43% (Hujoel 2021)","estimated_true_seronegativity_all_races":"40-60% when biopsy independent of serology","NHANES_tTG_EMA_concordance_white":"72%","NHANES_tTG_EMA_concordance_nonwhite":"32%","screening_OR_black_vs_white_children":"0.52 (95% CI 0.48-0.55)","biopsy_OR_black_vs_white_adults":"0.55 (95% CI 0.48-0.64)","appropriate_workup_OR_black":"0.095 (95% CI 0.017-0.527)","IgA_deficiency_black_vs_white":"1/6,000 vs 1/500-600","HLA_risk_allele_carriage_black":"~50%","HLA_risk_allele_carriage_white":"~60%","Black_CD_patients_in_Cartee":"42 of 852 total","modeled_diagnosis_rate_white":"~51%","modeled_diagnosis_rate_black":"~10-24%"},"heterogeneity_notes":"Very high heterogeneity across study designs (population screening vs clinical registry vs pathology database vs claims data). The critical insight is that different study designs produce different seronegativity rates depending on degree of serologic pre-filtering, and Black cohorts represent less-biased samples. Key limitation: Cartee Black biopsy-confirmed subgroup is small (n=42 total, ~10-15 biopsy-confirmed). NHANES concordance data provides the strongest population-based evidence of differential test behavior because it is uncontaminated by biopsy selection bias. All prevalence estimates are confounded by verification bias that differentially affects minority populations. The null hypothesis (that prevalence differences are entirely real) holds primarily for East Asian populations with genuinely low HLA-DQ2 (<1-5%) and rice-based diets, but fails for Black Americans where ~50% carry CD-risk alleles yet reported prevalence is 5× lower than whites. Environmental factors (wheat consumption, dietary transition) can produce 3-4× prevalence changes within genetically stable populations (Swedish epidemic), undermining purely genetic explanations."},"reference_patient_implications":{"description":"How these findings affect a patient with DQ8, Marsh 3A, all serology <1, low IgG1, low secretory IgA","diagnostic_failure_modes_identified":["DQ8-predominant CD (common in non-European populations) may produce lower tTG2 antibody titers than DQ2.5-driven CD, contributing to seronegativity","The NHANES tTG2/EMA discordance (72% vs 32%) suggests that weakly positive tTG2 with positive EMA is more common in non-white populations — this patient's completely negative tTG2 (<1) is consistent with this pattern taken to its extreme","The absence of the ancestral haplotype 8.1 (found in Europeans) means this DQ8 patient's immune response occurs on a different haplotype background with potentially different antibody kinetics","The Siniscalco IgM→IgG1→IgA sequential class-switching mechanism means low IgG1 impairs mucosal IgA production independent of HLA — this compounds any DQ8-related reduction in tTG2 production","Low secretory IgA in stool is consistent with impaired sequential class switching (IgG1→IgA) reducing mucosal IgA at the effector site","Standard HLA panels would correctly identify DQ8 risk, but 16.5% of CD patients in diverse cohorts lack even known risk alleles — DQ8 alone may underestimate the genetic risk landscape","The 80% seronegativity in Black CD patients demonstrates that Marsh 3A with negative serology is not a paradox — it may be the norm when verification bias is removed"],"additional_insight":"This patient's profile (DQ8, seronegative, low IgG1, low secretory IgA) would be INVISIBLE to every step of the current diagnostic cascade in all racial groups. The racial bias findings amplify the general verification bias problem: even in white patients, ~43% of true CD may be seronegative (Hujoel correction). In non-white patients or those with non-AH8.1 haplotype backgrounds, the miss rate is likely higher. The less-biased-sampling interpretation suggests this patient's seronegative Marsh 3A presentation is not exceptional but rather representative of a large undiagnosed population."}}
