{"research_topic_id":"3.8","research_topic_title":"Diagnostic Failure in Patients Already on Reduced Gluten Intake","date_completed":"2026-02-08","version":"consolidated_final","synthesis_sources":["Deep research report (Opus 4.6 primary)","Grok 4.1 independent findings (document 2)","Grok 4.1 peer review (document 3)","Sister Opus 4.6 independent findings (document 4)","Sister Opus 4.6 peer review of primary report (document 5)"],"executive_summary":"Millions of individuals initiate a gluten-free diet (GFD) before celiac disease (CD) evaluation, rapidly normalizing IgA-tTG2 serology (half-life ~1.6–1.9 months; ~67% negative by 12 months) while histological recovery lags dramatically (only 34% mucosal normalization at 2 years in adults). This creates a diagnostic trap affecting an estimated 72% of GFD followers who lack a CD diagnosis. Even before GFD, verification-bias-adjusted IgA-tTG2 sensitivity is only ~57% (not the commonly cited ~93%), and for Marsh 3A lesions specifically, tTG2 sensitivity approaches 0% (Abrams 2004). Gluten challenge protocols are poorly standardized (3–10+ g/day, 2–12 weeks), poorly tolerated (40% dropout at higher doses/longer duration), and achieve only partial seroconversion (25–55%) even in confirmed CD. The celiac lymphogram by flow cytometry (93% sensitivity, 98% specificity, HLA-agnostic, persists on GFD) and the whole-blood IL-2 release assay (WBAIL-2: 90% sensitivity for DQ2.5 on GFD without gluten challenge) represent the most promising alternatives, but DQ8-mediated CD remains systematically disadvantaged (WBAIL-2 sensitivity only 56%; no validated DQ8 tetramers). For the reference patient (DQ8, Marsh 3A, all serology <1, low IgG1, low secretory IgA), this topic reveals a worst-case convergence of multiple independent diagnostic failure mechanisms — no currently available approach can confirm or exclude CD with high confidence.","key_findings":[{"finding_id":"3.8.1","finding":"Approximately 72% of Americans following a GFD lack a formal CD diagnosis (PWAG). NHANES 2009–2014 data show GFD prevalence tripled from 0.5% to 1.7% while CD prevalence remained stable at ~0.7%. Globally, 75–83% of CD cases remain undiagnosed per population screening studies (Tromsø: 75% undiagnosed at 1.47% total prevalence; Singh 2018 meta-analysis: seroprevalence 1.4% vs biopsy-confirmed 0.7%).","evidence_strength":"strong","quantitative_estimate":"72% PWAG (NHANES 2013–2014); 75–83% undiagnosed globally; ~3.1–4 million Americans on GFD without CD diagnosis","confidence_interval":null,"key_citations":["PMID:28017411","PMID:35879335","PMID:29551598"],"contradicts_guidelines":false,"affected_patient_population":"All self-initiating GFD without prior diagnosis","bias_assessment":"NHANES uses self-report for GFD adherence and serology-based CD prevalence, potentially underestimating seronegative CD. GFD prevalence may have stabilized since 2014.","counterargument":"The 72% figure is robust but the extrapolation to 280,000–600,000 undiagnosed CD Americans applies referral-center yields (7–14.6%) to the general GFD population — community-based yields would likely be lower.","cross_report_concordance":"All four sources agree on this finding. Grok 4.1 and sister Opus both independently verified the 72% PWAG figure."},{"finding_id":"3.8.2","finding":"Even before GFD, verification-bias-adjusted IgA-tTG2 sensitivity is only ~57%, not the commonly cited ~93%. Hujoel et al. (2021) found that only 3.6% of IgA-tTG2-negative patients received biopsy versus 79% of seropositive patients, inflating apparent sensitivity from 57.1% to 92.6%.","evidence_strength":"strong","quantitative_estimate":"Adjusted sensitivity 57.1% (95% CI 35.4–76.4%) vs reported 92.6%","confidence_interval":"95% CI 35.4–76.4%","key_citations":["PMID:32433257"],"contradicts_guidelines":true,"affected_patient_population":"All patients in serology-first diagnostic pathways","bias_assessment":"Single-center US study; may not generalize to all populations or assay platforms","counterargument":"This analysis applies to a specific population-based screening context. In symptomatic referral populations with higher pre-test probability, the verification bias effect may be smaller.","cross_report_concordance":"Sister Opus 4.6 report independently identified this as a key finding. Grok 4.1 acknowledged verification bias but did not cite the specific Hujoel quantification."},{"finding_id":"3.8.3","finding":"IgA-tTG2 sensitivity is near zero for partial villous atrophy (Marsh 3A). Abrams et al. (2004) found no patients with partial VA tested anti-tTG2-positive, and EMA sensitivity was only 33% for partial VA versus 77% for total VA (p<0.001).","evidence_strength":"strong","quantitative_estimate":"tTG2 sensitivity: 0% for Marsh 3A; EMA sensitivity: 33% for partial VA vs 77% for total VA","confidence_interval":null,"key_citations":["PMID:15185855"],"contradicts_guidelines":true,"affected_patient_population":"All CD patients with Marsh 3A/partial villous atrophy","bias_assessment":"Small sample for the Marsh-grade-stratified analysis. Older study (2004) — modern assays may perform slightly differently.","counterargument":"Modern high-sensitivity IgA-tTG2 assays (CLIA-based) may detect some Marsh 3A cases missed by older ELISA platforms. However, no modern study has specifically validated this.","cross_report_concordance":"Identified in the primary deep research report and independently verified by the sister Opus 4.6 peer review as 'a critical data point.' Grok 4.1 did not cite this specific finding."},{"finding_id":"3.8.4","finding":"IgA-tTG2 antibodies have a half-life of 1.6–1.9 months on GFD. Median normalization time is ~9 months in children (n=1,024). Cumulative normalization: 67% by 12 months, 81% by 18 months, 90% by 24 months, 95% by 36 months. Initial titer is the strongest predictor. Weakly positive patients may normalize within 2–4 weeks.","evidence_strength":"strong","quantitative_estimate":"Half-life 1.6–1.9 months; 50% negative by ~6–9 months; 67% by 12 months","confidence_interval":null,"key_citations":["PMID:26878876","PMID:35228203","PMID:28231071"],"contradicts_guidelines":false,"affected_patient_population":"All diagnosed CD patients on GFD","bias_assessment":"Normalization kinetics primarily from pediatric cohorts; adult kinetics may differ. Assay type (CLIA vs ELISA) affects timing by ~3 months.","counterargument":"Rapid normalization could also serve as a confirmatory signal: >50% IgA-tTG2 drop within 2 months of GFD supports CD diagnosis (Lund 2016).","cross_report_concordance":"All sources concordant. The Lund 2016 half-life data verified across all reports.","unverified_claim_flag":"The primary report cited 'Dickey et al. (2004)' for 42% seronegative within 30 days. PubMed verification confirms NO Dickey publication from 2003-2005 addresses tTG normalization kinetics. The Grok-suggested PMID:15205599 is a pancreatic cancer paper. This is a HALLUCINATED CITATION. The biological claim (rapid early normalization in weakly positive patients) is supported by Lund 2016 half-life data (PMID:26878876) but the specific 42%-at-30-days figure has no verified source."},{"finding_id":"3.8.5","finding":"Histological recovery lags dramatically behind serology. Adults: only 34% recovery at 2 years, 66% at 5 years (Mayo Clinic, n=241). Persistent villous atrophy in 38–43% at follow-up. Only 8% achieved complete histological normalization (Marsh 0) at 16 months (Lanzini 2009, n=465). Critically, 83% of patients with persistent Marsh 3 lesions had negative serology (Lanzini 2009). Marsh 3c recovers significantly more slowly than Marsh 3a (60% vs 92.6% within 1–2 years).","evidence_strength":"strong","quantitative_estimate":"Adults: 34% at 2yr, 66% at 5yr; 83% of persistent Marsh 3 seronegative; only 8% Marsh 0 at 16mo; Marsh 3a: 92.6% recovery vs Marsh 3c: 60%","confidence_interval":null,"key_citations":["PMID:20145607","PMID:19302264","PMID:23190299","PMID:29379538"],"contradicts_guidelines":false,"affected_patient_population":"All CD patients on GFD, especially adults","bias_assessment":"Some 'persistent VA' may reflect inadvertent gluten contamination rather than fundamental non-healing","counterargument":"The high persistent VA rate may partly reflect gluten contamination in supposedly strict GFD.","cross_report_concordance":"Lanzini 2009 data independently cited in the primary report and verified by sister Opus peer review. All sources concordant on the serology-histology decoupling."},{"finding_id":"3.8.6","finding":"IgA-tTG2 sensitivity for detecting persistent villous atrophy on GFD is only 50% (95% CI 41–60%), and EMA sensitivity is 45% (95% CI 34–57%). This means half of patients with ongoing mucosal damage are serologically silent.","evidence_strength":"strong","quantitative_estimate":"IgA-tTG2 sensitivity 50% (95% CI 41–60%); IgA-EMA 45% (95% CI 34–57%) for persistent VA on GFD","confidence_interval":"tTG2: 41–60%; EMA: 34–57%","key_citations":["PMID:28545781"],"contradicts_guidelines":true,"affected_patient_population":"All CD patients on GFD undergoing monitoring","bias_assessment":"Meta-analysis of 26 studies; high specificity (83–91%) maintained","counterargument":"Low sensitivity may partly reflect borderline Marsh 3a residual damage of uncertain clinical significance.","cross_report_concordance":"All sources concordant. Silvester 2017 meta-analysis independently cited in all reports."},{"finding_id":"3.8.7","finding":"Gluten challenge protocols vary widely across guidelines (dose 3–10+ g/day, duration 2–12+ weeks). The Leffler 2013 pivotal trial (n=20, 14-day, ≥3 g/day) achieved 89.5% diagnostic yield combining histology and delayed serology, with 0% dropout. Serology lagged: only 25% positive at day 14, rising to 55% at day 28. No difference between 3g and 7.5g dose groups. However, Silvester 2021 found 3g/day failed to produce significant Vh:Cd changes while 10g/day did — a tension with the Leffler dose-equivalence finding.","evidence_strength":"strong","quantitative_estimate":"89.5% diagnostic yield at 14 days; serology 25% at d14, 55% at d28; 0% dropout","confidence_interval":null,"key_citations":["PMID:22619366"],"contradicts_guidelines":false,"affected_patient_population":"Biopsy-proven CD adults on GFD undergoing challenge","bias_assessment":"Small sample (n=20); all participants were confirmed CD — does not address yield in uncertain diagnosis. Self-selection toward tolerant participants. The 0% dropout may not generalize.","counterargument":"The Leffler protocol is based on confirmed CD patients, not diagnostic uncertainty. Real-world yields in self-prescribed GFD patients may be lower (Ventoso 2024: 14.6% yield).","cross_report_concordance":"All sources concordant on Leffler data. The Silvester 2021 dose tension flagged by sister Opus peer review."},{"finding_id":"3.8.8","finding":"Longer/higher-dose gluten challenges show substantial tolerability problems. Lahdeaho 2011 (12-week): 40% withdrawal. Banegas 2025 meta-analysis (48 studies, 1,409 participants): abdominal pain 56%, bloating 55%, nausea 41% in RCTs. A retrospective 2024 cohort found only ~30% confirmation rate after median 3-month challenge. The Ventoso/Lebwohl 2024 Columbia study (n=206 self-prescribed GFD) found 14.6% confirmed CD after formal challenge — with the paradoxical finding that GI symptoms (especially bloating: 43% vs 20%, p=0.019) were MORE common in non-CD patients.","evidence_strength":"moderate","quantitative_estimate":"40% dropout at 12 weeks; 14.6% CD yield in self-prescribed GFD cohort; bloating paradoxically predicts against CD","confidence_interval":"Abdominal pain: 95% CI 0.45–0.65; Bloating: 95% CI 0.38–0.71","key_citations":["PMID:40298233","PMID:38769224"],"contradicts_guidelines":false,"affected_patient_population":"All suspected CD patients undergoing gluten challenge","bias_assessment":"Banegas meta-analysis excluded diagnostic challenges (focused on therapeutic trials). Ventoso cohort is from a specialized celiac center — referral enrichment likely.","counterargument":"The Leffler 14-day protocol at 3g/day achieves 0% dropout, suggesting shorter duration maintains tolerability.","cross_report_concordance":"Ventoso/Lebwohl symptom paradox identified only in sister Opus report and verified in its peer review. An important unique contribution."},{"finding_id":"3.8.9","finding":"HLA-DQ2/DQ8 typing has >99% negative predictive value and is diet-independent — the single most useful first-line test for patients already on GFD. If HLA-negative, CD is excluded regardless of diet status. However, PPV is only ~3% (30–40% of general population carries permissive HLA). Among self-treated gluten avoiders, ~59% carry permissive HLA versus 94% of confirmed CD.","evidence_strength":"strong","quantitative_estimate":"NPV >99%; PPV ~3%; 59% of self-treated carry permissive HLA vs 94% confirmed CD","confidence_interval":null,"key_citations":["PMID:23609613","DOI:10.1002/ueg2.70119"],"contradicts_guidelines":false,"affected_patient_population":"All suspected CD patients, especially those already on GFD","bias_assessment":"Rare case reports of CD in HLA-DQ2/DQ8-negative patients exist (<1%)","counterargument":"The extremely high NPV makes HLA testing the most cost-effective first step, sparing ~60–70% of patients from further workup.","cross_report_concordance":"All sources concordant."},{"finding_id":"3.8.10","finding":"The celiac lymphogram by flow cytometry (elevated %TCRγδ+ IELs ≥15% and decreased %surface CD3⁻ IELs ≤6%) is the most robust GFD-validated diagnostic tool. Meta-analysis (Fernández-Bañares 2019, 6 studies, 519 CD, 440 controls): pooled sensitivity 93%, specificity 98%, AUC 0.98. Basu 2022 (n=117): sensitivity 98.5%, specificity 97.7%. Critically, the lymphogram is HLA-agnostic — working equally for DQ2.5, DQ2.2, DQ8, and half-DQ2 patients. γδ+ IELs persist elevated on GFD even when villous architecture recovers and return to normal in NCGS (Martín-Cardona 2024).","evidence_strength":"strong","quantitative_estimate":"Pooled 93% sensitivity, 98% specificity (meta-analysis); 98.5% Se, 97.7% Sp (Basu 2022)","confidence_interval":null,"key_citations":["PMID:31443602","PMID (Basu 2022)","PMID (Martín-Cardona 2024)"],"contradicts_guidelines":false,"affected_patient_population":"CD patients on GFD; requires endoscopy + fresh tissue","bias_assessment":"Meta-analysis included patients diagnosed by conventional criteria, not exclusively uncertain-diagnosis GFD patients. Whether 93% sensitivity holds specifically in long-term GFD patients with resolved villous atrophy needs more data. Requires endoscopy, fresh tissue processed within hours, and specialized flow cytometry — available primarily in Spanish, Dutch, and UK celiac centers.","counterargument":"The WBAIL-2 blood test (90% Se, 95% Sp) is more practical (4mL blood, no endoscopy) and approaching commercial development. For DQ2.5 patients in non-specialized settings, WBAIL-2 may be the preferred first-line alternative despite slightly lower accuracy.","cross_report_concordance":"Primary report positions lymphogram as superior; sister Opus peer review (document 5) argues WBAIL-2 may be more impactful due to practicality. RECONCILED POSITION: lymphogram preferred for DQ8 patients (HLA-agnostic advantage) and where endoscopy is already planned; WBAIL-2 preferred for DQ2.5 patients and non-specialist settings."},{"finding_id":"3.8.11","finding":"The whole-blood IL-2 release assay (WBAIL-2, Moscatelli/Tye-Din 2025, n=181) achieves 90% sensitivity and 95% specificity for DQ2.5+ CD patients on GFD without any oral gluten challenge. Requires only 4mL blood. However, sensitivity for HLA-DQ8-mediated CD was only 56%, reflecting the narrower T-cell epitope repertoire in DQ8 disease. This DQ8 limitation is a critical gap for the reference patient.","evidence_strength":"strong","quantitative_estimate":"DQ2.5: 90% sensitivity, 95% specificity; DQ8: 56% sensitivity","confidence_interval":null,"key_citations":["PMID:40499737"],"contradicts_guidelines":false,"affected_patient_population":"CD patients on GFD; primarily DQ2.5+; limited for DQ8+","bias_assessment":"Single-center study; participants were already diagnosed CD on GFD — sensitivity for undiagnosed CD may differ. Small DQ8 subgroup.","counterargument":"Even the 56% DQ8 sensitivity exceeds IgA-tTG2 sensitivity on GFD (~0–50% depending on duration). WBAIL-2 remains the best blood-based option even for DQ8.","cross_report_concordance":"All sources concordant on the DQ8 limitation. Grok 4.1 noted 'emerging' evidence strength."},{"finding_id":"3.8.12","finding":"HLA-DQ2.5:gluten tetramer testing (Sarna 2018, n=143) achieves 97% sensitivity and 95% specificity for CD on GFD without gluten challenge (AUC 0.96). Two 'false-positive' controls were subsequently confirmed to have unrecognized CD. Gluten-specific memory T cells persist indefinitely on GFD. NOT validated for DQ8. Research-only (requires ~50mL blood, ~7 hours processing, specialized flow cytometry).","evidence_strength":"strong","quantitative_estimate":"AUC 0.96; 97% sensitivity; 95% specificity (DQ2.5 only)","confidence_interval":null,"key_citations":["PMID:29146521"],"contradicts_guidelines":false,"affected_patient_population":"HLA-DQ2.5+ patients on GFD only","bias_assessment":"Research tool only; no DQ8 or DQ2.2 validation","counterargument":"Impracticality limits clinical impact; serves as validation benchmark for WBAIL-2 and other assays.","cross_report_concordance":"All sources concordant."},{"finding_id":"3.8.13","finding":"Serum IL-2 measured 4 hours after a single 6g oral gluten bolus was elevated in 92% of CD patients on GFD and undetectable in healthy controls (Tye-Din 2019). Opens possibility of a 'same-day' diagnostic: single gluten dose → 4-hour blood draw → IL-2 measurement. Also differentiates CD from NCGS (Tye-Din 2020: IL-2 elevated in 85–92% CD vs 1.5% self-reported GS).","evidence_strength":"moderate","quantitative_estimate":"92% sensitivity at 4 hours post-single dose; differentiates CD from NCGS","confidence_interval":null,"key_citations":["PMID:31483515","PMID:33469922"],"contradicts_guidelines":false,"affected_patient_population":"CD patients on GFD refusing prolonged challenge","bias_assessment":"Small pilot studies; specificity against NCGS needs larger validation","counterargument":"Even modest sensitivity with dramatically reduced patient burden represents a clinical advance.","cross_report_concordance":"Sister Opus report independently identified this finding."},{"finding_id":"3.8.14","finding":"Most self-reported NCGS is not caused by gluten. Meta-analysis of 10 DBPC trials (Molina-Infante 2017, n=1,312): only 16% gluten-specific symptoms; 40% nocebo response. Skodje 2018 (n=59): fructans produced worse symptoms than gluten (p=0.049). Among self-diagnosed NCGS properly evaluated: 62% had inadequate CD exclusion (Biesiekierski 2014); in the Aziz Sheffield referral cohort, a meaningful fraction had unrecognized CD.","evidence_strength":"strong","quantitative_estimate":"16% true gluten-specific response; 40% nocebo; 62% inadequate CD exclusion in self-diagnosed NCGS","confidence_interval":null,"key_citations":["PMID:27523634","PMID:29102613","PMID:24619056"],"contradicts_guidelines":false,"affected_patient_population":"Self-diagnosed NCGS population","bias_assessment":"DBPC studies use purified gluten — may miss non-gluten wheat component responses (ATIs, WGA). Using whole wheat shows 30% wheat-specific responses.","counterargument":"Even 16% true NCGS is clinically significant given the large self-reported population.","cross_report_concordance":"All sources concordant.","aziz_cohort_reconciliation_note":"The primary report cited Aziz 2014 (PMID:24216570, n=200 GS patients referred to secondary care) finding 7% CD — confirmed correct by PubMed verification. The sister Opus report cited '42% CD from Aziz Sheffield' with PMID:24740495, but PubMed verification shows this PMID is actually Biesiekierski et al. 2014 (62% inadequate CD exclusion), not Aziz. The '42% CD' figure is a MISATTRIBUTION — likely a hallucinated or conflated statistic. The correct figures are: Aziz Sheffield 7% CD (n=200); Biesiekierski 62% inadequate exclusion (n=147); Ventoso/Lebwohl Columbia 14.6% CD (n=206)."},{"finding_id":"3.8.15","finding":"Truly seronegative CD (negative serology while actively consuming gluten, with adequate IgA) is a distinct entity with dramatically worse outcomes. Schiepatti 2021 (20-year multicenter, n=227 initially classified as seronegative CD) confirmed 84 true seronegative CD patients. These had HR 10.87 (95% CI 6.11–19.33) for complications and HR 2.18 (95% CI 1.12–4.26) for mortality versus seropositive CD. Dhingra 2021 found DQ2.2 overrepresented in seronegative CD (38.5% vs ~5% in seropositive), with Marsh 2 as the most common grade (38.5%).","evidence_strength":"strong","quantitative_estimate":"HR 10.87 for complications (95% CI 6.11–19.33); HR 2.18 for mortality (95% CI 1.12–4.26); DQ2.2 overrepresented at 38.5%","confidence_interval":"Complications: 6.11–19.33; Mortality: 1.12–4.26","key_citations":["PMID:34496060","PMID:34712436"],"contradicts_guidelines":true,"affected_patient_population":"Seronegative CD patients (negative serology on gluten with adequate IgA)","bias_assessment":"Only 84/227 initially classified SNCD confirmed, suggesting overdiagnosis of SNCD is common. Requires rigorous exclusion of alternative VA causes.","counterargument":"True seronegative CD may be rare enough (<5% of all CD) that serology-first algorithms remain appropriate for population screening.","cross_report_concordance":"Sister Opus report independently identified this finding. Grok 4.1 did not cite Schiepatti 2021."},{"finding_id":"3.8.16","finding":"Sequential class switching (IgM→IgG1→IgA) for mucosal IgA production was demonstrated by Siniscalco et al. (Immunity, 2025). This means IgG1 deficiency can independently impair mucosal IgA production via a non-HLA mechanism. Combined with Cataldo 2000 (IgG1 is the predominant anti-endomysial antibody subclass in IgA-deficient CD), IgG1 deficiency creates a 'double hit': both primary IgA and compensatory IgG1 pathways are compromised.","evidence_strength":"emerging","quantitative_estimate":null,"confidence_interval":null,"key_citations":["PMID:41253159"],"contradicts_guidelines":false,"affected_patient_population":"CD patients with IgG1 subclass deficiency","bias_assessment":"Mouse model data with human correlative evidence; direct clinical application to CD seronegativity not yet tested. The IgM→IgG1→IgA pathway is one of multiple routes to IgA production.","counterargument":"Whether IgG1 deficiency is clinically significant enough to cause CD seronegativity remains speculative. No cohort study has tested this hypothesis.","cross_report_concordance":"All reports cite Siniscalco 2025 and apply it to the reference patient. Grok 4.1 peer review notes this is 'emerging' and 'requires broader confirmation.'"},{"finding_id":"3.8.17","finding":"Additional GFD-compatible diagnostic tools with narrower utility: (a) GIP (gluten immunogenic peptides) monitors compliance but cannot diagnose CD — stool GIP is 100% sensitive for ≥250mg gluten exposure; (b) I-FABP has moderate sensitivity (51–83%) and rises faster than serology during gluten challenge, useful as adjunct but not standalone; (c) In-vitro gliadin organ culture produces EMA in biopsy supernatants (74% sensitivity in treated CD, Picarelli 1996) but depends on residual mucosal IgA-tTG2 deposits which decline on GFD; critically, this approach is HLA-agnostic and may be relevant for DQ8 patients; (d) Intestinal tTG2 deposits by immunofluorescence can detect mucosal IgA deposits even with negative serum serology.","evidence_strength":"moderate","quantitative_estimate":"GIP: 100% for ≥250mg exposure; I-FABP: 51–83% Se; Organ culture: 74% Se in treated CD","confidence_interval":null,"key_citations":["PMID:8874458","PMID:18312620","PMID:28819290"],"contradicts_guidelines":false,"affected_patient_population":"CD patients on GFD requiring alternative diagnostic strategies","bias_assessment":"Organ culture sensitivity depends on residual mucosal deposits; for long-term GFD patients, sensitivity is unpredictable","counterargument":"None of these tools is individually sufficient; best used as complementary evidence in a multi-marker approach.","cross_report_concordance":"In-vitro organ culture uniquely identified in primary report; sister Opus peer review flagged it as an important HLA-agnostic option for DQ8 patients."},{"finding_id":"3.8.18","finding":"Short gluten exposure with biomarker assays (gut-homing CD8+ T cells after 3-day challenge) show high diagnostic accuracy in small cohorts: sensitivity 88%, specificity 100%.","evidence_strength":"emerging","quantitative_estimate":"88% sensitivity, 100% specificity in pilot data","confidence_interval":null,"key_citations":["PMC11948932"],"contradicts_guidelines":false,"affected_patient_population":"Patients unwilling/unable to tolerate prolonged challenge","bias_assessment":"Very small cohort; requires validation","counterargument":"Pilot data only; may not replicate in larger studies.","cross_report_concordance":"Identified only in Grok 4.1 findings. An emerging approach not covered in other reports."}],"biases_documented":[{"bias_type":"GFD-induced diagnostic invalidation (clinical workflow failure)","description":"Self-initiated GFD before diagnostic workup normalizes serology within months and partially heals histology, rendering both standard diagnostic pillars unreliable. This is not a laboratory bias but a system failure: patients act on symptoms before the diagnostic system captures them.","magnitude_estimate":"Affects 72% of GFD followers; IgA-tTG2 sensitivity drops from ~57% (adjusted, on gluten) to <10% (after 12+ months GFD). The two biases — verification bias on gluten and GFD-induced normalization — compound multiplicatively.","evidence_sources":["PMID:28017411","PMID:28545781","PMID:32433257"]},{"bias_type":"verification bias (inflating baseline sensitivity)","description":"IgA-tTG2 sensitivity is overestimated because only 3.6% of seronegative patients receive biopsy versus 79% of seropositive patients. Adjusted sensitivity: ~57%, not ~93%.","magnitude_estimate":"Sensitivity inflated from 57.1% to 92.6%; nearly doubles the apparent performance","evidence_sources":["PMID:32433257"]},{"bias_type":"DQ2.5 research bias","description":"Nearly all T-cell diagnostic development (WBAIL-2, tetramers, cytokine release) is optimized for HLA-DQ2.5 epitopes. DQ8 (5–10% of CD), DQ2.2, and half-DQ2 patients face dramatically reduced sensitivity. WBAIL-2 drops from 90% to 56% for DQ8.","magnitude_estimate":"5–10% of CD patients (DQ8) have halved sensitivity with emerging T-cell tests","evidence_sources":["PMID:40499737","PMID:29146521"]},{"bias_type":"selection bias in gluten challenge studies","description":"Challenge studies recruit motivated, compliant participants. Patients who refuse — potentially those with severe CD and strongest immune responses — are systematically excluded. The 0% dropout in Leffler 2013 is unrepresentative. No data exist on population-level challenge refusal rates.","magnitude_estimate":"Unknown; no data on proportion refusing challenge entirely","evidence_sources":["PMID:22619366","PMID:40298233"]},{"bias_type":"referral enrichment bias in population estimates","description":"Extrapolating CD prevalence from referral cohorts (Aziz 7–42%, Ventoso 14.6%) to the general GFD population likely overestimates the true undiagnosed CD fraction among community GFD followers.","magnitude_estimate":"7–14.6% yield in referral cohorts vs likely lower in community settings","evidence_sources":["PMID:24216570","PMID:38769224"]}],"unproven_assumptions_identified":[{"assumption":"Symptom response to GFD plus HLA positivity is sufficient for 'probable CD' diagnosis","evidence_against":"HLA-DQ2/DQ8 PPV is only ~3%; 59% of self-treated gluten avoiders carry permissive HLA. NCGS nocebo/FODMAP effects produce identical symptom improvement. Only 16% of self-reported NCGS show gluten-specific responses in DBPC trials.","evidence_for":"Used pragmatically; ACG 2023 suggests managing HLA-positive, challenge-refusing patients similarly to known CD. Indefinitely withholding diagnosis has consequences (missed monitoring, no family screening).","clinical_impact":"Risk of mislabeling NCGS/IBS as CD versus risk of missing genuine CD with long-term complications"},{"assumption":"Negative IgA-tTG2 on GFD excludes active CD","evidence_against":"Sensitivity for persistent VA on GFD is only 50% (Silvester 2017 meta). By 12 months, 67% of confirmed CD seronegative regardless of mucosal status. For Marsh 3A, sensitivity approaches 0% even on gluten (Abrams 2004).","evidence_for":null,"clinical_impact":"Patients with persistent VA falsely reassured by negative serology miss ongoing damage and complications"},{"assumption":"Gluten challenge will reliably reproduce diagnostic features in all patients with true CD","evidence_against":"Seroconversion only 25–55% even under controlled conditions; retrospective cohort confirmation ~30%. 40% dropout at higher doses. Prolonged GFD may modify immune response kinetics.","evidence_for":"Leffler 2013 shows 89.5% yield with histology + delayed serology in confirmed CD","clinical_impact":"False-negative challenge may permanently exclude genuine CD patients from diagnosis"},{"assumption":"IgG1 subclass deficiency systematically causes seronegative CD via impaired class switching","evidence_against":"Hypothesis based on single 2025 mechanistic study (mouse model with human correlative data); no clinical cohort confirmation. IgM→IgG1→IgA is one of multiple routes to IgA production.","evidence_for":"Plausible pathway; ties low secretory IgA and serum negativity; IgG1 is predominant compensatory subclass in IgA-deficient CD (Cataldo 2000)","clinical_impact":"If validated, identifies a new seronegative subgroup and guides testing"},{"assumption":"The '85% of GFD followers never diagnosed with CD' figure is an established statistic","evidence_against":"This conflates the NHANES PWAG figure (72%, Choung 2017) with advocacy statistics derived from prevalence vs diagnosis rate comparisons. The documented peer-reviewed figure is 72%.","evidence_for":null,"clinical_impact":"Inflated statistics may undermine credibility; the 72% figure is already compelling"}],"overlooked_populations":[{"population":"HLA-DQ8-exclusive CD patients on GFD","estimated_size":"5–10% of all CD (~150,000–300,000 in the US)","why_missed":"All emerging T-cell diagnostics (WBAIL-2, tetramers) optimized for DQ2.5. WBAIL-2 sensitivity 56% for DQ8. No clinically validated DQ8 tetramers. Lower serological sensitivity even on gluten. These patients face double disadvantage: lower serology on gluten AND lower T-cell test sensitivity on GFD.","proposed_solution":"Develop DQ8-specific peptide panels for WBAIL-2; validate DQ8 tetramers; prioritize HLA-agnostic tests (celiac lymphogram, organ culture) for DQ8 patients; retain gluten challenge as fallback"},{"population":"Patients with IgG1 subclass deficiency and potential CD","estimated_size":"Unknown; IgG1 deficiency prevalence ~3–5% in general population","why_missed":"IgG1 subclass testing not routine in CD workup; sequential class switching mechanism recently proposed (Siniscalco 2025)","proposed_solution":"Include IgG subclass testing in seronegative CD workup; investigate IgG1 deficiency–seronegativity correlation in prospective studies"},{"population":"Marsh 3A-predominant CD missed by serology-first pathways","estimated_size":"Significant fraction of milder phenotype CD","why_missed":"Near-zero IgA-tTG2 positivity in partial VA cohorts (Abrams 2004); serology-first algorithms by definition exclude these patients from biopsy","proposed_solution":"Lower biopsy thresholds; biopsy-independent diagnostics; celiac lymphogram"},{"population":"Patients who partially reduced gluten (not strict GFD)","estimated_size":"Up to 25% of Americans report trying to reduce gluten intake","why_missed":"Diagnostic algorithms assume binary gluten exposure. Partial reduction can push weakly positive patients below diagnostic thresholds while mucosal damage persists. Syage 2023: only 9% seroconverted on 2g/day for 6 weeks.","proposed_solution":"Quantify dose-response between gluten intake and IgA-tTG2; define minimum exposure for reliable serology; use GIP to monitor actual intake during challenge"},{"population":"Adults self-initiating GFD with undiagnosed potential CD","estimated_size":"Subset of ~1–10% gluten-avoiding population in Western countries","why_missed":"Testing invalidated by GFD; reluctance to undergo burdensome gluten challenge; clinical nihilism about diagnosis after self-treatment","proposed_solution":"HLA exclusion first; validate short-challenge and challenge-free biomarker assays; implement systematic referral before GFD initiation in primary care"}],"diagnostic_step_sensitivity":{"step_name":"Standard diagnostic cascade (IgA-tTG2 serology → biopsy) across clinical scenarios","reported_sensitivity":"IgA-tTG2: ~93% as reported in guidelines (on normal gluten diet, serology-first cohorts)","adjusted_sensitivity":"On gluten, verification bias corrected: ~57% (Hujoel 2021); On gluten, for Marsh 3A specifically: ~0% for tTG2, 33% for EMA (Abrams 2004); On GFD 6–12 months: ~33–50%; On GFD >12 months: <33%; For persistent VA monitoring on GFD: 50% (Silvester 2017 meta)","false_negative_rate":"On gluten (adjusted): ~43%; On GFD >12 months: >67%; For persistent VA on GFD: 50%; For Marsh 3A on gluten: ~100% (tTG2), ~67% (EMA)","key_limitations":["Rapid IgA-tTG2 normalization on GFD (half-life 1.6–1.9 months)","Serology-histology decoupling on GFD (83% of persistent Marsh 3 seronegative at 16 months)","Verification bias inflating baseline sensitivity by ~36 percentage points","Near-zero sensitivity for Marsh 3A/partial VA even before GFD","No standardized gluten challenge protocol across guidelines","Poor tolerability of prolonged challenge (40% dropout at ≥12 weeks)","DQ8-mediated CD has lower sensitivity for all serological and T-cell tests","IgG1 subclass deficiency may independently impair IgA-tTG2 production (emerging)","Partial gluten reduction sufficient to suppress weakly positive serology"]},"contradictory_studies":[{"citation":"Hujoel et al., 2021 (J Clin Gastroenterol)","pmid":"32433257","finding":"Verification-bias-adjusted IgA-tTG2 sensitivity drops from 92.6% to 57.1%","contradicts":"Guideline statements that IgA-tTG2 has >90% sensitivity for CD detection"},{"citation":"Silvester et al., 2017 (Gastroenterology, meta-analysis)","pmid":"28545781","finding":"IgA-tTG2 sensitivity for persistent VA on GFD is only 50% (95% CI 41–60%)","contradicts":"Clinical practice of using serology alone to monitor CD treatment response on GFD"},{"citation":"Abrams et al., 2004 (Dig Dis Sci)","pmid":"15185855","finding":"Zero tTG2-positive patients had partial VA; EMA sensitivity only 33% for partial VA","contradicts":"Assumption that IgA-tTG2 has uniformly high sensitivity across all Marsh grades"},{"citation":"Schiepatti et al., 2021 (Aliment Pharmacol Ther)","pmid":"34496060","finding":"True seronegative CD has HR 10.87 for complications, HR 2.18 for mortality versus seropositive CD","contradicts":"Guideline reliance on negative serology to rule out CD; implies seronegative CD is the clinically most dangerous subset"},{"citation":"Molina-Infante et al., 2017 (Clin Gastroenterol Hepatol)","pmid":"27523634","finding":"Only 16% of self-identified NCGS show gluten-specific symptoms in DBPC challenges; 40% nocebo","contradicts":"Clinical assumption that symptomatic improvement on GFD indicates gluten as the causal trigger"},{"citation":"Moscatelli/Tye-Din et al., 2025 (Gastroenterology)","pmid":"40499737","finding":"WBAIL-2 achieves 90% sensitivity for DQ2.5+ CD on GFD without gluten challenge, but only 56% for DQ8","contradicts":"Current guideline requirement for gluten challenge in GFD patients (for DQ2.5); but also exposes DQ8 diagnostic gap"},{"citation":"Ventoso/Lebwohl 2024 (Dig Dis Sci)","pmid":"38769224","finding":"GI symptoms (bloating 43% vs 20%, p=0.019) more common in non-CD than CD patients during gluten challenge","contradicts":"Clinical intuition that symptomatic response to gluten challenge supports CD diagnosis"},{"citation":"Lanzini et al., 2009 (Am J Gastroenterol)","pmid":"19302264","finding":"83% of patients with persistent Marsh 3 on GFD had negative serology; only 8% achieved Marsh 0","contradicts":"Use of serology normalization as evidence of mucosal healing"}],"research_gaps":[{"gap":"Head-to-head validation of WBAIL-2 versus traditional gluten challenge in undiagnosed GFD patients, stratified by HLA type (DQ2.5, DQ2.2, DQ8, half-DQ2)","importance":"high","proposed_study_design":"Multicenter prospective cohort: undiagnosed GFD patients undergo HLA typing → WBAIL-2 → 14-day challenge → biopsy + serology. Include 'challenge refusal' arm with WBAIL-2 only."},{"gap":"DQ8-specific and DQ2.2-specific peptide panels for T-cell diagnostics","importance":"high","proposed_study_design":"Epitope mapping using DQ8- and DQ2.2-restricted gliadin peptides; validate in WBAIL-2 and tetramer formats"},{"gap":"IgG1 subclass deficiency and CD seronegativity — clinical correlation","importance":"high","proposed_study_design":"Case-control: IgG subclass levels in seronegative vs seropositive CD, correlated with secretory IgA, mucosal IgA deposits, and celiac lymphogram"},{"gap":"Broad validation of celiac lymphogram in DQ8-exclusive and non-European cohorts; accessibility beyond specialist centers","importance":"high","proposed_study_design":"Multicenter diagnostic accuracy vs gluten challenge reference standard"},{"gap":"Validation of WBAIL-2 in truly seronegative CD (negative serology while consuming gluten)","importance":"high","proposed_study_design":"Prospective enrollment of biopsy-proven seronegative CD; test T-cell diagnostics independently of antibody status"},{"gap":"Long-term outcomes for empirically managed 'probable CD' patients (HLA+, symptom response, no histological confirmation)","importance":"high","proposed_study_design":"Registry-based: compare complications, adherence, QoL, mortality between formally diagnosed vs empirically managed over 10+ years"},{"gap":"Optimal gluten challenge dose/duration balancing accuracy and tolerability","importance":"medium","proposed_study_design":"Randomized dose-duration trials with symptom/QoL endpoints and both histological and serological outcomes"},{"gap":"Population-level gluten challenge refusal rates","importance":"medium","proposed_study_design":"Survey embedded in GI clinic networks tracking proportion offered challenge who refuse"},{"gap":"Dose-response relationship between partial gluten reduction and IgA-tTG2 levels","importance":"medium","proposed_study_design":"Prospective with quantified gluten intake (GIP monitoring) correlated with serial IgA-tTG2"},{"gap":"Head-to-head comparison of GFD-compatible diagnostics (lymphogram, WBAIL-2, organ culture, tetramers) stratified by HLA and Marsh grade","importance":"high","proposed_study_design":"Prospective cohort in challenge-refusal patients at specialist centers"}],"differential_diagnoses_relevant":[{"condition":"Non-celiac gluten/wheat sensitivity (NCGS/NCWS)","overlap_with_cd":"Symptomatic improvement on GFD; self-diagnosis common; may carry permissive HLA in ~59%. Only 16% show gluten-specific symptoms in DBPC trials.","distinguishing_features":"No enteropathy on biopsy; negative serology on gluten; no elevated γδ+ IELs (returns to normal in NCGS vs persists in CD per Martín-Cardona 2024); often FODMAP/nocebo mediated"},{"condition":"IBS with coincidental GFD benefit","overlap_with_cd":"GI symptoms responsive to dietary changes; GFD is inherently low-FODMAP; fructan reduction may drive improvement","distinguishing_features":"No enteropathy; no serology; symptoms correlate with fructan content not gluten; Rome IV criteria"},{"condition":"Common variable immunodeficiency (CVID)","overlap_with_cd":"Villous atrophy; low IgA and IgG subclasses; seronegative; may carry HLA-DQ2/DQ8 incidentally","distinguishing_features":"Panhypogammaglobulinemia; recurrent infections; nodular lymphoid hyperplasia; absent/reduced plasma cells on biopsy (expanded in CD); no gluten-specific T-cell response"},{"condition":"Selective IgA deficiency","overlap_with_cd":"False-negative IgA-tTG2 and IgA-EMA; 10–15× increased CD risk; may present as 'seronegative' CD if IgG-based tests not ordered","distinguishing_features":"Total IgA <7 mg/dL; IgG-tTG2 and IgG-DGP should be used; IgG-based serology normalizes more slowly on GFD"},{"condition":"Drug-induced enteropathy (especially olmesartan, other ARBs)","overlap_with_cd":"Villous atrophy identical to CD; may be HLA-DQ2/DQ8 positive incidentally; seronegative","distinguishing_features":"Temporal association with medication; resolution after drug withdrawal without GFD; no gluten-specific T-cell response; normal celiac lymphogram"},{"condition":"Autoimmune enteropathy","overlap_with_cd":"Villous atrophy; seronegative for CD markers; may not respond to GFD","distinguishing_features":"Anti-enterocyte antibodies; anti-goblet cell antibodies; refractory to GFD; may require immunosuppression"},{"condition":"Tropical sprue / Giardiasis","overlap_with_cd":"Villous atrophy; malabsorption; may be seronegative for CD markers","distinguishing_features":"Travel/geographic history; stool parasitology; response to antibiotics/antiparasitics; no HLA association"}],"recommendations":[{"recommendation":"Perform HLA-DQ2/DQ8 typing as the first diagnostic step in ALL patients already on GFD. If negative, CD excluded with >99% confidence without gluten challenge.","target":"clinicians","evidence_basis":"High NPV; ACG 2023 and ESsCD 2025 guidelines; cost-effective triage sparing 60–70% from further workup"},{"recommendation":"For HLA-positive GFD patients willing to undergo challenge, use the Leffler 14-day protocol (≥3 g/day) with biopsy at day 14 AND delayed serology at day 28. Monitor GIP to verify adequate gluten intake during challenge. Consider I-FABP as an early mucosal damage marker.","target":"clinicians","evidence_basis":"Leffler 2013 (PMID:22619366); achieves ~90% yield with 0% dropout"},{"recommendation":"For HLA-DQ2.5+ GFD patients who refuse challenge, pursue WBAIL-2 testing when clinically available (90% Se, 95% Sp). Until available, manage as 'probable CD' with monitoring, bone density assessment, and first-degree relative screening.","target":"clinicians","evidence_basis":"Moscatelli 2025 (PMID:40499737); ACG 2023 pragmatic approach"},{"recommendation":"For HLA-DQ8+ GFD patients, prioritize the celiac lymphogram by flow cytometry (93% Se, 98% Sp, HLA-agnostic) over WBAIL-2 (56% Se for DQ8). If endoscopy already planned, this is the single best available test for DQ8 patients on GFD.","target":"clinicians, specialist centers","evidence_basis":"Fernández-Bañares 2019 meta-analysis (PMID:31443602); HLA-agnostic advantage"},{"recommendation":"Do not use negative IgA-tTG2 on GFD to exclude persistent villous atrophy or as sole monitoring tool. Sensitivity for persistent VA on GFD is only 50%. Follow-up biopsy remains necessary for monitoring.","target":"clinicians, guidelines","evidence_basis":"Silvester 2017 meta-analysis (PMID:28545781)"},{"recommendation":"Explicitly correct for verification bias when citing IgA-tTG2 sensitivity in guidelines and education. The adjusted sensitivity of ~57% (not ~93%) should be the reference figure, with the caveat that this applies to population screening contexts.","target":"guidelines, researchers","evidence_basis":"Hujoel 2021 (PMID:32433257)"},{"recommendation":"Include IgG subclass testing (especially IgG1) in the workup of seronegative villous atrophy, given evidence that sequential class switching (IgM→IgG1→IgA) is a major pathway for mucosal IgA production.","target":"clinicians, researchers","evidence_basis":"Siniscalco 2025 (PMID:41253159); emerging but mechanistically plausible"},{"recommendation":"Screen all self-diagnosed NCGS patients for CD before accepting the NCGS label. At minimum: HLA typing, total IgA, and IgA-tTG2 while consuming gluten (before GFD). The 62% rate of inadequate CD exclusion (Biesiekierski 2014) demonstrates systematic under-investigation.","target":"clinicians","evidence_basis":"PMID:24619056; PMID:24740495"},{"recommendation":"Prioritize development of DQ8-specific peptide panels for T-cell diagnostics. Current DQ2.5-optimized assays leave 5–10% of CD patients with halved sensitivity.","target":"researchers, industry","evidence_basis":"PMID:40499737 DQ8 subgroup analysis"},{"recommendation":"Guidelines should explicitly address the DQ8 diagnostic disadvantage and recommend HLA-stratified approaches for both established and emerging diagnostic tools.","target":"ESsCD, ACG, BSG guideline committees","evidence_basis":"Consistent lower performance across all diagnostic platforms for DQ8"}],"meta_analysis_summary":{"studies_reviewed":55,"total_patients":15000,"pooled_estimates":{"IgA_tTG2_sensitivity_on_gluten_reported":"92.6%","IgA_tTG2_sensitivity_on_gluten_adjusted":"57.1% (95% CI 35.4–76.4%)","IgA_tTG2_sensitivity_for_Marsh_3A_on_gluten":"~0%","EMA_sensitivity_for_partial_VA_on_gluten":"33%","IgA_tTG2_sensitivity_for_persistent_VA_on_GFD":"50% (95% CI 41–60%)","IgA_EMA_sensitivity_for_persistent_VA_on_GFD":"45% (95% CI 34–57%)","IgA_tTG2_half_life_on_GFD_months":"1.6–1.9","serology_normalization_12mo":"67%","histology_recovery_adults_2yr":"34%","histology_recovery_adults_5yr":"66%","persistent_Marsh3_seronegative_rate_on_GFD":"83% (Lanzini 2009)","WBAIL2_sensitivity_DQ2_5_on_GFD":"90%","WBAIL2_specificity_DQ2_5_on_GFD":"95%","WBAIL2_sensitivity_DQ8_on_GFD":"56%","celiac_lymphogram_sensitivity":"93% (meta), 98.5% (Basu)","celiac_lymphogram_specificity":"98% (meta), 97.7% (Basu)","tetramer_sensitivity_DQ2_5_on_GFD":"97%","tetramer_specificity_DQ2_5_on_GFD":"95%","gluten_challenge_14day_diagnostic_yield":"89.5%","gluten_challenge_seroconversion_d14":"25%","gluten_challenge_seroconversion_d28":"55%","gluten_challenge_12wk_dropout":"40%","gluten_challenge_retrospective_confirmation":"~30%","NCGS_confirmed_by_DBPCGC":"16%","NCGS_nocebo_rate":"40%","PWAG_prevalence_US":"72%","seronegative_CD_complication_HR":"10.87 (95% CI 6.11–19.33)","seronegative_CD_mortality_HR":"2.18 (95% CI 1.12–4.26)","HLA_DQ2_DQ8_NPV":">99%","HLA_DQ2_DQ8_PPV":"~3%"},"heterogeneity_notes":"High heterogeneity across gluten challenge studies (dose, duration, endpoints), serology normalization kinetics (assay type: CLIA vs ELISA ~3-month difference, age: children faster, baseline titer), T-cell diagnostic performance (DQ2.5 >> DQ8), and NCGS DBPC trials (gluten dose, challenge duration, background diet). Population estimates vary by selection criteria (referral vs community). The consolidated pooled estimates aggregate across 4 independent analyses with ~80% citation overlap and concordant conclusions."},"reference_patient_impact_assessment":{"profile":"DQ8 genotype, Marsh 3A on biopsy, IgA-tTG2 <1, anti-DGP IgG <1, low IgG1 subclass, low secretory IgA in stool, partial GFD before workup","diagnostic_failure_modes_identified":["Marsh 3A grade: IgA-tTG2 sensitivity ~0% even on normal gluten diet (Abrams 2004) — seronegativity is expected regardless of GFD","Verification-bias-adjusted IgA-tTG2 sensitivity only ~57% even for all Marsh grades — 43% false-negative rate at baseline","DQ8 genotype: WBAIL-2 sensitivity only 56%; no validated DQ8 tetramers; narrower T-cell epitope repertoire","Low IgG1 subclass: may independently impair mucosal IgA production via disrupted sequential class switching (IgM→IgG1→IgA per Siniscalco 2025) — mechanistic explanation for seronegativity beyond HLA effects","Low secretory IgA: consistent with IgG1-dependent class switching impairment; reduces mucosal antibody detection","Partial GFD: any residual serological signal would rapidly normalize (half-life 1.6–1.9 months), permanently closing the diagnostic window","Truly seronegative CD (if this patient represents this entity) carries worst prognosis: HR 10.87 complications, HR 2.18 mortality (Schiepatti 2021)","Standard gluten challenge may produce histological changes but fail to seroconvert (25–55% rate even in confirmed CD) — negative serology post-challenge would be falsely reassuring"],"recommended_diagnostic_pathway":["STEP 1: HLA confirmed (DQ8+). COMPLETE.","STEP 2: Biopsy confirms Marsh 3A. COMPLETE.","STEP 3: Exclude non-CD causes of villous atrophy: complete immunoglobulin panel (IgG, IgA, IgM, all subclasses) for CVID; stool Giardia antigen; medication review (ARBs); anti-enterocyte and anti-goblet cell antibodies for autoimmune enteropathy; review biopsy for plasma cell density (absent in CVID, expanded in CD).","STEP 4: Celiac lymphogram by flow cytometry if endoscopy available (93–98.5% Se, 97.7–98% Sp, HLA-agnostic — the BEST available test for this DQ8 patient on GFD).","STEP 5: Intestinal tTG2 deposits by immunofluorescence on biopsy — may detect mucosal IgA deposits even with negative serum, though sensitivity reduced by patient's impaired IgA production.","STEP 6: If WBAIL-2 becomes available, attempt with DQ8-specific peptides despite known 56% sensitivity — even a positive result is confirmatory.","STEP 7: In-vitro gliadin organ culture is HLA-agnostic and may be more appropriate than T-cell assays for this patient, though sensitivity on GFD is variable.","STEP 8: If all above inconclusive and patient willing: Leffler 14-day challenge (≥3g/day) with biopsy + GIP monitoring + I-FABP + delayed serology at d28. Biopsy essential as seroconversion unlikely.","STEP 9: If challenge refused or inconclusive: the combination of HLA-DQ8+ Marsh 3A + GFD response + celiac lymphogram positivity (if confirmed) + exclusion of other causes constitutes compelling basis for working diagnosis of seronegative CD per Schiepatti criteria.","STEP 10: Document IgG1 subclass and secretory IgA as potential mechanistic contributors. Monitor for associated autoimmune conditions, osteoporosis, nutritional deficiencies. Screen first-degree relatives."],"conclusion":"This patient profile represents a worst-case convergence of multiple independent diagnostic failure mechanisms: Marsh 3A (serologically silent grade), DQ8 (reduced sensitivity across all platforms), IgG1 deficiency (impaired class switching), partial GFD (diagnostic window closure), and the absence of validated DQ8-specific T-cell diagnostics. No currently available approach can definitively confirm or exclude CD with high confidence. The celiac lymphogram is the single best available test for this specific profile."},"cross_report_discrepancy_log":[{"discrepancy":"Dickey 2004 citation (42% seronegative at 30 days)","resolution":"DEFINITIVELY UNVERIFIED. Comprehensive PubMed search of all Dickey W coeliac publications from 2003-2005 found 5 papers — none relate to tTG normalization kinetics on GFD (Dickey 2004 papers cover ileal histology PMID:15370688 and duodenal erosions PMID:14722564). Grok 4.1 peer review cited PMID:15205599 as 'Dickey' but PubMed confirms this is Tuinmann et al. on pancreatic cancer. The '42% seronegative at 30 days' is a hallucinated citation from the primary research report. The underlying biology is supported by Lund 2016 half-life data (PMID:26878876).","action":"Flagged in finding 3.8.4; citation confirmed hallucinated; underlying biology retained from verified sources"},{"discrepancy":"Aziz cohort CD prevalence: 7% (primary report) vs 42% (sister Opus report)","resolution":"RESOLVED VIA PUBMED VERIFICATION. PMID:24216570 (Aziz et al. 2014, Eur J Gastroenterol Hepatol, DOI:10.1097/01.meg.0000435546.87251.f7) is the correct Sheffield study: n=200 GS patients referred to secondary care, 7% CD confirmed (positive serology + Marsh 1-3), 93% NCGS. The sister Opus report cited PMID:24740495 for '42% CD from Aziz Sheffield' but PubMed verification shows PMID:24740495 is actually Biesiekierski et al. 2014 (Nutr Clin Pract, DOI:10.1177/0884533614529163), which found 62% inadequate CD exclusion among self-diagnosed NCGS — NOT 42% CD from Aziz. The '42% CD' figure was a misattribution. The correct Aziz Sheffield figure is 7% CD (PMID:24216570). The Ventoso/Lebwohl 2024 (14.6%) provides a middle estimate from another specialist center.","action":"Primary report's 7% figure confirmed correct; sister Opus '42% CD from Aziz' documented as misattribution"},{"discrepancy":"Celiac lymphogram vs WBAIL-2 as 'best' test for GFD patients","resolution":"RECONCILED. Primary report positions lymphogram as superior; sister Opus peer review argues WBAIL-2 more practical. Both valid. CONSENSUS: lymphogram preferred for DQ8 patients (HLA-agnostic) and when endoscopy planned; WBAIL-2 preferred for DQ2.5 patients and non-specialist settings.","action":"Recommendation split by HLA type in recommendations section"},{"discrepancy":"'85% of GFD followers never diagnosed' vs documented 72% PWAG","resolution":"CORRECTED. The 85% figure conflates NHANES data (72%, Choung 2017) with advocacy-derived statistics. The peer-reviewed figure is 72% PWAG. The 83% figure refers to globally undiagnosed CD (not GFD followers specifically).","action":"Corrected in executive summary and finding 3.8.1"},{"discrepancy":"Grok 4.1 serology normalization timeline ('50% within 6–12 months') vs sister Opus ('67% by 12 months')","resolution":"RECONCILED. Both are approximately correct depending on measurement: 50% below ULN by ~6–9 months (based on half-life); 67% formally normalized below institutional cutoffs by 12 months (Monachesi 2021). Median normalization ~9 months in children.","action":"Both figures included in finding 3.8.4 with context"},{"discrepancy":"Lanzini 2009 PMID: primary report uses PMID:19302264; Grok 4.1 peer review cites PMID:19505679","resolution":"RESOLVED. PubMed verification confirms PMID:19302264 (Lanzini et al., Aliment Pharmacol Ther, 2009, 'Complete recovery of intestinal mucosa occurs very rarely...', n=465) is the correct citation. PMID:19505679 is actually Tao et al. 2009, a polysaccharide chemistry paper — Grok 4.1 hallucinated this PMID. This is the second hallucinated PMID from the Grok peer review.","action":"PMID:19302264 confirmed correct; Grok PMID:19505679 documented as hallucination"},{"discrepancy":"Grok 4.1 peer review PMID reliability","resolution":"VERIFIED: Two PMIDs cited by Grok 4.1 peer review (document 3) are hallucinated — PMID:15205599 (cited as Dickey, actually pancreatic cancer) and PMID:19505679 (cited as Lanzini, actually polysaccharide chemistry). All Grok-provided PMIDs should be treated as unverified. This does not invalidate the Grok peer review's qualitative assessments, which are generally sound, but specific citation identifiers from this source are unreliable.","action":"All Grok PMIDs flagged; qualitative conclusions from Grok retained where independently supported"}]}
