{"research_topic_id":"3.9","research_topic_title":"Diagnostic Failure in Atypical and Extraintestinal Celiac Disease","date_completed":"2026-02-08","executive_summary":"Extraintestinal manifestations affect 60-62% of diagnosed CD patients (9% EIM-only), yet diagnostic delay averages 42 months for non-GI versus 2.3 months for GI presentations. IgA-tTG2 sensitivity is Marsh-grade-dependent (approaching 100% in Marsh 3c but estimated 0-33% in Marsh 3a from small-sample studies), and two independent mechanisms drive higher seronegativity in extraintestinal CD: damage-severity correlation (milder enteropathy → lower titer) and target-antigen mismatch (DH targets tTG3, neurological CD targets tTG6). The claim that seronegative CD is 'primarily classical/severe' reflects survivorship bias — only classical patients with severe symptoms get biopsied despite negative serology — not true phenotypic distribution.","key_findings":[{"finding_id":"3.9.1","finding":"62% of adults with CD have extraintestinal manifestations at diagnosis; 9% present EIM-only; only 10-20% present classically. All prevalence estimates derive from serology-first cohorts and therefore reflect survivorship bias — true EIM prevalence including undiagnosed seronegative patients is unknown.","evidence_strength":"strong","quantitative_estimate":"62% EIM; 9% EIM-only; 10-20% classical","confidence_interval":null,"key_citations":["PMID:28644353","PMC6895422","PMC8746138"],"contradicts_guidelines":false,"affected_patient_population":"All CD patients; prevalence subject to selection bias from serology-first cohorts"},{"finding_id":"3.9.2","finding":"Diagnostic delay is ~18-fold longer for non-GI presentations (42 months median) versus classical GI (2.3 months median). Population-level mean delay is 5.8-11 years. Neurological and musculoskeletal symptoms independently predict extreme delay (OR 2.31).","evidence_strength":"strong","quantitative_estimate":"42 months non-GI vs 2.3 months GI; population mean 5.8-11 years","confidence_interval":null,"key_citations":["PMID:28623177","PMID:11197241","PMID:22060243"],"contradicts_guidelines":false,"affected_patient_population":"Patients with non-GI initial presentations"},{"finding_id":"3.9.3","finding":"IgA-tTG2 sensitivity is Marsh-grade-dependent: ~100% for Marsh 3c, 31% for Marsh 3a (EMA, Rostami 1999, n=29 Marsh 3a), and 0% point estimate for IgA-tTG2 in partial VA (Abrams 2004, ~33 patients — wide CIs given small sample). This transforms serology from a disease-detection tool to a mucosal damage severity marker.","evidence_strength":"strong","quantitative_estimate":"0-33% in Marsh 3a (small samples, wide CIs) vs ~100% in Marsh 3c","confidence_interval":"Upper bound of 0% estimate plausibly 10-15% based on binomial bounds of ~33-patient subgroup","key_citations":["PMID:10201452","PMID:15185855","PMID:9718937"],"contradicts_guidelines":true,"affected_patient_population":"Patients with mild-to-moderate villous atrophy (Marsh 3a)"},{"finding_id":"3.9.4","finding":"Verification bias correction (Hujoel 2021): only 3.6% of IgA-tTG2-negative patients receive biopsy vs 79.2% of positive patients. Begg-Greenes correction drops sensitivity from 92.6% to 57.1% (95% CI 35.4-76.4%). Methodologically debated but direction of bias is unambiguous.","evidence_strength":"strong","quantitative_estimate":"57.1% corrected sensitivity (95% CI 35.4-76.4%)","confidence_interval":"95% CI 35.4-76.4%","key_citations":["PMID:32433257"],"contradicts_guidelines":true,"affected_patient_population":"All patients undergoing CD serological testing"},{"finding_id":"3.9.5","finding":"The tTG isoform model demonstrates organ-specific autoimmunity: tTG2 (gut), tTG3 (skin/DH), tTG6 (brain/neurological). These can be independently activated — IgA-tTG2 has no theoretical basis for detecting brain- or skin-targeting variants.","evidence_strength":"moderate","quantitative_estimate":null,"confidence_interval":null,"key_citations":["PMID:11901200","PMID:23576621","PMID:30885888"],"contradicts_guidelines":true,"affected_patient_population":"Patients with neurological and dermatological gluten-related disease"},{"finding_id":"3.9.6","finding":"In DH, IgA-tTG2 sensitivity is reduced: 25-53% seronegative. Finnish cohort (n=352): 28% had normal villous architecture; among those, only 39% seropositive vs 73% with VA. IgA anti-tTG3 positive in >90% of untreated DH. Standard IgA-tTG2 misses the target antigen in DH.","evidence_strength":"strong","quantitative_estimate":"25-53% seronegative in DH; 39% seropositive without VA vs 73% with VA; tTG3 >90% sensitive","confidence_interval":null,"key_citations":["PMC5986520","PMID:10950050","PMID:11901200"],"contradicts_guidelines":false,"affected_patient_population":"Dermatitis herpetiformis patients"},{"finding_id":"3.9.7","finding":"In neurological gluten sensitivity without enteropathy (Rashtak 2011, Mayo Clinic): IgA-tTG2 sensitivity 78% with enteropathy vs 11% without; EMA 70% vs 0%. CRITICAL: the 59% Marsh 0 in Hadjivassiliou's series may include NCGS, not exclusively missed enteropathy-positive CD.","evidence_strength":"moderate","quantitative_estimate":"IgA-tTG2: 78% with enteropathy vs 11% without; EMA: 70% vs 0%","confidence_interval":null,"key_citations":["PMID:21056914","PMID:26832652"],"contradicts_guidelines":true,"affected_patient_population":"Patients with idiopathic ataxia, neuropathy, and other neurological presentations"},{"finding_id":"3.9.8","finding":"Anti-tTG6 antibodies present in 73% of gluten ataxia and 40% of newly diagnosed CD. tTG6-positive CD patients show reduced cerebellar volume. However, tTG6 testing remains a research tool — not commercially available. Gluten ataxia prevalence estimates (20-40% of idiopathic ataxia) derive predominantly from a single center (Sheffield) without large independent replication.","evidence_strength":"moderate","quantitative_estimate":"73% tTG6-positive in gluten ataxia; 40% in newly diagnosed CD","confidence_interval":null,"key_citations":["PMID:23576621","PMID:30885888"],"contradicts_guidelines":false,"affected_patient_population":"Neurological CD/gluten sensitivity patients"},{"finding_id":"3.9.9","finding":"IDA is the most common EIM (20-46% at diagnosis). CD accounts for 3.2-5.5% of unexplained IDA (meta-analysis, n=2,998). BSG 2021 recommends screening ALL adults with IDA; AGA restricts to 'plausible CD'; hematologists under-screen. Counterintuitively, DIAGNOSED IDA-CD patients have higher tTG2 levels than diarrhea-presenters — but this reflects survivorship bias (seronegative IDA-CD never diagnosed).","evidence_strength":"strong","quantitative_estimate":"3.2-5.5% CD yield in unexplained IDA","confidence_interval":null,"key_citations":["PMID:29689265","PMID:23756221","PMID:34497146","PMID:28931034"],"contradicts_guidelines":false,"affected_patient_population":"Patients with unexplained IDA across all specialties"},{"finding_id":"3.9.10","finding":"Elevated transaminases in ~21% of CD (meta-analysis, 42 studies); CD accounts for ~9.3% of cryptogenic hypertransaminasemia. Normalization on GFD in 86%. ESsCD, NICE, AASLD recommend CD screening in unexplained liver enzyme elevation.","evidence_strength":"strong","quantitative_estimate":"21% in CD; 9.3% CD yield in cryptogenic cases; 86% normalize on GFD","confidence_interval":null,"key_citations":["PMID:10051464","PMC7868701"],"contradicts_guidelines":false,"affected_patient_population":"Patients with unexplained liver enzyme elevation"},{"finding_id":"3.9.11","finding":"Osteoporosis/osteopenia present in ~40-75% of CD at diagnosis. However, Laszkowska meta-analysis found CD prevalence among osteoporosis patients is only 1.6% (95% CI 1.1-2.0%) — comparable to general population — challenging the assumption that routine screening in all osteoporosis is warranted.","evidence_strength":"strong","quantitative_estimate":"1.6% CD yield in osteoporosis patients (95% CI 1.1-2.0%)","confidence_interval":"95% CI 1.1-2.0%","key_citations":["PMID:29984519","PMC6895422"],"contradicts_guidelines":false,"affected_patient_population":"Patients with unexplained osteoporosis, especially premenopausal women and young men"},{"finding_id":"3.9.12","finding":"Infertility data are conflicting: Tersigni (OR 5.06 unexplained infertility; OR 5.82 recurrent miscarriage) vs Glimberg 2021 (0.7% biopsy-confirmed CD in infertile women — not significantly above general population). Possible resolution: Zugna data show fertility reduced only in 2 years preceding CD diagnosis, suggesting timing-dependent effect.","evidence_strength":"moderate","quantitative_estimate":"OR 5.06 vs 0.7% prevalence (conflicting meta-analyses)","confidence_interval":null,"key_citations":["PMID:33850456","PMC4989603"],"contradicts_guidelines":false,"affected_patient_population":"Women with unexplained infertility or recurrent miscarriage"},{"finding_id":"3.9.13","finding":"Dental enamel defects: 50-94% in CD vs 4-27.5% controls. Pattern is bilateral, symmetrical, chronologically distributed — highly specific. Grossly underutilized as a diagnostic window; most dentists attribute to fluorosis.","evidence_strength":"strong","quantitative_estimate":"50-94% in CD vs 4-27.5% in controls","confidence_interval":null,"key_citations":["PMC10932357"],"contradicts_guidelines":false,"affected_patient_population":"Children and young adults with systematic enamel defects"},{"finding_id":"3.9.14","finding":"Physician awareness critically low: only 35% of PCPs ever diagnosed CD, 45% aware of anemia association, 13% know diabetes link, 69.9% consider CD rare. Only 11% of diagnoses made by primary care. Finland's nationwide education increased detection 4-fold.","evidence_strength":"strong","quantitative_estimate":"35% PCPs ever diagnosed CD; 11% of diagnoses by primary care","confidence_interval":null,"key_citations":["PMID:16050861","PMID:30249556","PMC6284647"],"contradicts_guidelines":false,"affected_patient_population":"All patients presenting to non-gastroenterology specialties"},{"finding_id":"3.9.15","finding":"CRITICAL METHODOLOGICAL FINDING: The claim that seronegative CD associates preferentially with classical/severe presentations (Volta 2016) reflects survivorship bias, not true phenotypic distribution. Seronegative patients are only biopsied when classical symptoms are severe enough to prompt investigation despite negative serology. Seronegative extraintestinal patients are never biopsied → never diagnosed → never counted. The true phenotypic distribution is unknowable from current data.","evidence_strength":"strong","quantitative_estimate":null,"confidence_interval":null,"key_citations":["PMID:32433257","DOI:10.1016/j.dld.2016.06.021"],"contradicts_guidelines":false,"affected_patient_population":"All seronegative CD patients, particularly those with extraintestinal presentations who are never biopsied"},{"finding_id":"3.9.16","finding":"The Kalixanda population study (Walker 2010, n=1,000) found 100% IgA-tTG2 sensitivity for villous atrophy — the strongest counterevidence to the sensitivity-collapse hypothesis. However, only 7 CD cases identified (85% true sensitivity would yield 7/7 positive with 33% probability); IEL threshold was 40 (not standard 25); and 3.8% seronegative had lymphocytic duodenosis. The null hypothesis cannot be confirmed or rejected from this study alone.","evidence_strength":"moderate","quantitative_estimate":"7/7 (100%) — but n=7, wide confidence interval","confidence_interval":"Lower bound of 95% CI for 7/7: approximately 65%","key_citations":["PMID:20398668"],"contradicts_guidelines":false,"affected_patient_population":"General population"},{"finding_id":"3.9.17","finding":"The no-biopsy pathway (ESsCD 2025: IgA-tTG2 ≥10× ULN) paradoxically worsens the seronegative problem: applicable to only ~32% of adult CD (and <10% in one multicenter study). By encouraging diagnosis without tissue examination in high-titer patients, the pathway becomes more efficient for severe disease while more exclusionary for mild disease.","evidence_strength":"moderate","quantitative_estimate":"Applicable to ~10-32% of biopsy-confirmed adult CD","confidence_interval":null,"key_citations":["DOI:10.1002/ueg2.70119"],"contradicts_guidelines":false,"affected_patient_population":"Low-titer and seronegative CD patients"}],"biases_documented":[{"bias_type":"verification bias","description":"Only 3.6% of IgA-tTG2-negative patients receive confirmatory biopsy vs 79.2% of positive patients. When corrected (Begg-Greenes method), IgA-tTG2 sensitivity drops from 92.6% to 57.1%. This affects ALL extraintestinal prevalence and sensitivity estimates because they derive from serology-first cohorts.","magnitude_estimate":"Sensitivity inflation from 92.6% to 57.1% (95% CI 35.4-76.4%); magnitude would be greater in extraintestinal-only presentations where clinical suspicion for seronegative biopsy is even lower","evidence_sources":["Hujoel et al. 2021, PMID:32433257"]},{"bias_type":"survivorship bias in seronegative CD characterization","description":"Studies characterizing 'seronegative CD' overwhelmingly describe patients with severe classical symptoms — because severe symptoms are the ONLY reason a clinician biopsies a seronegative patient. Seronegative patients with extraintestinal presentations are never biopsied → never diagnosed → never counted. The resulting phenotypic profile ('seronegative CD is classical and severe') is an artifact of ascertainment, not a true disease characteristic. Accepting this at face value creates a self-perpetuating diagnostic loop.","magnitude_estimate":"Unknown; creates false impression that seronegative CD is primarily classical when the extraintestinal seronegative fraction is simply unmeasured","evidence_sources":["Volta et al. 2016 DOI:10.1016/j.dld.2016.06.021","Logical analysis of ascertainment pathway","Hujoel 2021 PMID:32433257"]},{"bias_type":"selection bias in EIM prevalence tables","description":"All EIM prevalence estimates (Therrien 2020, Laurikka 2018, PMC6895422) derive from serology-first diagnosed cohorts. True EIM prevalence in the complete CD population (including seronegative patients) is unknown. Direction of bias uncertain: may underestimate if seronegative EIM-predominant patients excluded, or overestimate if seronegative patients without EIM excluded.","magnitude_estimate":"Unknown direction and magnitude","evidence_sources":["General CD literature pattern; identified in peer review"]},{"bias_type":"specialty referral bias","description":"CD awareness varies dramatically by specialty (35% PCPs ever diagnosed CD). Patients presenting to low-awareness specialties have lower probability of serological testing and therefore lower probability of diagnosis regardless of serology result.","magnitude_estimate":"Up to 89% of diagnoses missed at PCP level","evidence_sources":["PMID:16050861","PMID:30249556","PMC6284647"]},{"bias_type":"ascertainment bias in neurological prevalence","description":"Gluten ataxia prevalence (20-40% of idiopathic sporadic ataxia) and neuropathy ranges (2-39%) derive predominantly from Sheffield group and specialized referral centers. Higher estimates may reflect center-specific referral patterns rather than true population prevalence.","magnitude_estimate":"Unknown; no large independent replication of Sheffield ataxia estimates","evidence_sources":["Hadjivassiliou series; noted by mainstream neurology consensus"]}],"unproven_assumptions_identified":[{"assumption":"IgA-tTG2 sensitivity is equivalent in extraintestinal-only CD versus classical GI CD","evidence_against":"DH: 25-53% seronegative; neurological without enteropathy: 71-89% seronegative (Rashtak PMID:21056914); Marsh grade-serology correlation (sensitivity as low as 0-33% in Marsh 3a); extraintestinal presentations may have lower average Marsh grades; verification bias prevents measurement","evidence_for":"Most diagnosed extraintestinal CD cases are seropositive — but this reflects survivorship bias (seronegative cases not diagnosed). Kalixanda 100% sensitivity (but n=7).","clinical_impact":"If sensitivity is lower in extraintestinal presentations, a large seronegative population with organ-specific damage goes undetected indefinitely"},{"assumption":"Seronegative CD is primarily a classical/severe phenotype","evidence_against":"This is an artifact of survivorship bias — only patients with severe classical symptoms get biopsied despite negative serology. Indirect evidence from DH and neurological CD suggests extraintestinal seronegativity is common.","evidence_for":"Published case series (Volta 2016) do show classical phenotype predominance in diagnosed SNCD","clinical_impact":"Accepting this assumption discourages biopsy in seronegative extraintestinal patients, perpetuating the diagnostic failure the assumption describes"},{"assumption":"Negative IgA-tTG2 reliably excludes CD in non-gastroenterology settings","evidence_against":"Verification bias correction (57.1%); Marsh grade-serology correlation; DH/neurological evidence; IgA deficiency (2-3%); potential IgG1/class-switching effects","evidence_for":"Reported sensitivity >92% in uncorrected studies; clinical practice guidelines rely on negative serology","clinical_impact":"Millions of patients with extraintestinal symptoms may be incorrectly ruled out based on a single negative blood test"},{"assumption":"The tTG family (tTG2, tTG3, tTG6) targets are always co-activated in CD","evidence_against":"DH can present with minimal enteropathy and negative IgA-tTG2 but positive tTG3; neurological disease can present Marsh 0 with positive tTG6; suggests independent organ-specific activation","evidence_for":"Most DH patients do have intestinal involvement; majority of newly diagnosed CD patients are tTG6-negative","clinical_impact":"If organ-specific tTG autoimmunity occurs independently, IgA-tTG2 as sole screening test misses entire disease categories"},{"assumption":"DQ8 genotype and IgG1 deficiency do not independently reduce serology sensitivity","evidence_against":"DQ8 associated with milder phenotypes (lower Marsh grades → lower sensitivity via grade correlation); IgG1 deficiency may impair IgM→IgG1→IgA class switching (Siniscalco 2025) → reduced mucosal IgA; both mechanisms are plausible and align with reference patient","evidence_for":"No direct studies testing these hypotheses; mechanisms are inferred from adjacent evidence","clinical_impact":"Potential additional blind spot in immunologically atypical profiles — classified as EMERGING hypothesis"}],"overlooked_populations":[{"population":"Seronegative CD with Marsh 3A in extraintestinal presentations","estimated_size":"Unknown; verification bias correction implies ~43% false-negative rate. If even 10-20% of these are extraintestinal-predominant, this represents thousands of patients at population level.","why_missed":"Negative serology terminates diagnostic workup in non-GI specialties; biopsy never performed; patient never enters CD cohorts. Survivorship bias in SNCD literature reinforces complacency.","proposed_solution":"Protocol-mandated duodenal biopsy in high-risk extraintestinal presentations (unexplained IDA, idiopathic neuropathy/ataxia, premature osteoporosis) regardless of serology, at least in research settings."},{"population":"Reference patient profile: DQ8, Marsh 3A, IgA-tTG2 <1, DGP IgG <1, low IgG1, low secretory IgA","estimated_size":"Unknown; convergence of multiple low-frequency factors but each mechanism is individually documented","why_missed":"Five compounding failure modes: (1) Marsh 3a below serology sensitivity threshold; (2) DQ8 lower prior probability; (3) low IgG1 impairs class switching → reduced mucosal IgA independent of HLA; (4) DGP IgG also fails due to IgG1 deficiency; (5) extraintestinal presentation to low-awareness specialty","proposed_solution":"IgG1 subclass testing and secretory IgA measurement in clinical suspicion with negative standard serology; HLA typing as risk stratification; lower biopsy threshold for DQ2/DQ8-positive patients"},{"population":"Patients with organ-specific tTG autoimmunity (tTG3-skin, tTG6-brain) without significant enteropathy","estimated_size":"Neurological: 59% Marsh 0 in Hadjivassiliou 2016; DH: 28% normal villous architecture. Note: Marsh 0 cases may include NCGS rather than missed CD.","why_missed":"Do not meet strict CD definition requiring enteropathy; IgA-tTG2 not designed for their disease; tTG3 and tTG6 assays not commercially available","proposed_solution":"Commercialization of tTG3 and tTG6 assays; revised diagnostic frameworks recognizing gluten-related autoimmunity beyond enteropathy"},{"population":"Elderly CD patients (>60 years) with extraintestinal presentations","estimated_size":"Unknown; CD increasingly diagnosed in elderly; older patients more likely seronegative with less severe histopathology","why_missed":"Symptoms attributed to aging, polypharmacy, comorbidities; lower serology sensitivity in milder disease; clinician bias toward CD as childhood disease","proposed_solution":"Age-inclusive screening guidelines; lower biopsy threshold in elderly with compatible symptoms"}],"diagnostic_step_sensitivity":{"step_name":"IgA-tTG2 serology in extraintestinal-only CD","reported_sensitivity":">92% in mixed (predominantly seropositive-identified) cohorts","adjusted_sensitivity":"57.1% after verification bias correction (Hujoel 2021); likely lower in extraintestinal-only presentations. DH: 47-75% sensitive. Neurological without enteropathy: 11% (Rashtak PMID:21056914). Marsh 3a: estimated 0-33% (small samples, wide CIs).","false_negative_rate":"Unmeasured in extraintestinal-only populations. DH: 25-53%. Neurological without enteropathy: 71-89%. Marsh 3a: estimated 67-100% based on Marsh-grade correlation (small-sample estimates).","key_limitations":["Verification bias: 96.4% of seronegative patients never biopsied (Hujoel 2021)","Survivorship bias: diagnosed SNCD reflects severe classical phenotype because only severe cases trigger biopsy despite negative serology","No head-to-head comparison of sensitivity in extraintestinal-only vs classical GI CD","tTG2 is gut-specific autoantigen — no theoretical basis for detecting tTG3 (skin) or tTG6 (brain) autoimmunity","Marsh grade correlation: sensitivity drops with lower grades; extraintestinal-only CD may have lower average grades","IgA deficiency (2-3%) causes false negatives on IgA-based tests","IgG1 subclass deficiency may impair mucosal IgA via class-switching pathway (Siniscalco 2025) — emerging hypothesis","Test cutoffs optimized for DQ2.5-predominant populations; DQ8 patients may have lower titers — untested","0-33% Marsh 3a sensitivity estimates derive from small subgroups (~29-33 patients) with wide confidence intervals"]},"contradictory_studies":[{"citation":"Walker et al. (Kalixanda 2010)","pmid":"20398668","finding":"100% IgA-tTG2 sensitivity in population-based screening (7/7 villous atrophy cases positive). The only unbiased population study.","contradicts":"Marsh-grade-dependent sensitivity hypothesis. However, n=7 means 85% true sensitivity has 33% probability of producing 7/7 positive. High IEL threshold (40 vs standard 25) may have excluded milder cases."},{"citation":"Abu Daya et al. 2013, Clin Gastroenterol Hepatol","pmid":"23756221","finding":"IDA-presenting CD patients had HIGHER IgA-tTG2 levels and more severe villous atrophy than diarrhea-presenting patients","contradicts":"Hypothesis that extraintestinal presentations have lower serology sensitivity. However, this applies only to DIAGNOSED patients — survivorship bias excludes seronegative IDA-CD from analysis."},{"citation":"Volta et al. 2016, Dig Liver Dis","pmid":null,"finding":"Seronegative CD cohorts show predominantly classical/severe phenotype","contradicts":"Hypothesis that seronegative CD is common in extraintestinal presentations. However, this reflects survivorship bias — only classical/severe patients get biopsied despite negative serology."},{"citation":"Glimberg et al. 2021","pmid":"33850456","finding":"CD prevalence 0.7% in infertile women — not significantly higher than general population","contradicts":"Tersigni 2014 finding of OR 5.06 for unexplained infertility. May reflect improved diagnosis rates, population heterogeneity, or timing-dependent effect (Zugna: fertility reduced only in 2 years pre-diagnosis)."},{"citation":"Laszkowska et al. 2018","pmid":"29984519","finding":"CD prevalence in osteoporosis patients is only 1.6% (95% CI 1.1-2.0%) — comparable to general population","contradicts":"Common assumption that osteoporosis screening for CD is always high-yield. Challenges routine screening of all osteoporosis patients."},{"citation":"Mainstream neurology consensus","pmid":null,"finding":"Gluten ataxia considered rare; Sheffield group estimates viewed as potential outliers","contradicts":"Hadjivassiliou estimates of 20-40% of idiopathic sporadic ataxia being gluten-related. No large independent replication."},{"citation":"Lebwohl (cited in Hujoel 2021 discussion)","pmid":null,"finding":"Disagrees that true IgA-tTG2 sensitivity is below 90%","contradicts":"Hujoel verification bias correction to 57.1%. Methodological disagreement about Begg-Greenes correction appropriateness."}],"research_gaps":[{"gap":"No direct comparison of IgA-tTG2 sensitivity in extraintestinal-only versus classical GI CD using serology-independent biopsy","importance":"high","proposed_study_design":"Prospective multicenter study with protocol-mandated duodenal biopsy in patients with high-risk extraintestinal conditions (unexplained IDA, idiopathic neuropathy/ataxia, premature osteoporosis, cryptogenic transaminitis) regardless of serology. Compare sensitivity, Marsh grade distribution, and HLA frequency to parallel classical GI cohort."},{"gap":"Large population-based study with universal biopsy regardless of serology, powered for Marsh 3a detection","importance":"high","proposed_study_design":"Extension of Kalixanda-type design with n≥5,000 and standard IEL threshold (25/100), stratified by HLA genotype and immunoglobulin subclass. This is the definitive study needed to settle the sensitivity question."},{"gap":"No commercially available anti-tTG6 assay despite >20 years of evidence","importance":"high","proposed_study_design":"Industry partnership for assay development, followed by multicenter validation in idiopathic ataxia/neuropathy cohorts. Establish clinical sensitivity, specificity, and predictive value for GFD response."},{"gap":"No studies of IgG1 subclass deficiency as mechanism for false-negative IgA-tTG2 via impaired sequential class switching","importance":"high","proposed_study_design":"Prospective study measuring IgG1 subclass, secretory IgA, mucosal IgA deposits, and serum IgA-tTG2 in patients undergoing biopsy for suspected CD. Test whether IgG1 deficiency predicts seronegativity independent of Marsh grade and HLA."},{"gap":"Impact of DQ8 vs DQ2.5 genotype on IgA-tTG2 sensitivity across Marsh grades","importance":"high","proposed_study_design":"Subgroup analysis of existing CD registries (e.g., Swedish registry) stratified by HLA genotype, Marsh grade, and presentation type."},{"gap":"Marsh grade distribution at diagnosis in extraintestinal-only versus classical GI CD never systematically compared","importance":"high","proposed_study_design":"Retrospective analysis of large CD registries comparing Marsh grade distribution stratified by presenting symptom category."},{"gap":"No randomized trial of universal CD screening in unexplained IDA, idiopathic neuropathy, or unexplained osteoporosis","importance":"high","proposed_study_design":"Cluster-randomized trial in hematology/neurology/rheumatology clinics: mandatory IgA-tTG2 + total IgA + duodenal biopsy screening vs standard care. Primary outcome: CD diagnosis rate; secondary: diagnostic delay, patient outcomes at 1 year."},{"gap":"Commercialization of anti-tTG3 assay for DH screening in dermatology practice","importance":"medium","proposed_study_design":null},{"gap":"Longitudinal natural history study of seronegative extraintestinal-only CD","importance":"medium","proposed_study_design":null}],"differential_diagnoses_relevant":[{"condition":"Non-celiac gluten sensitivity (NCGS)","overlap_with_cd":"Neurological symptoms (ataxia, neuropathy, brain fog), fatigue, GI symptoms. 59% of Hadjivassiliou neurological cohort had Marsh 0 — potentially NCGS rather than missed CD.","distinguishing_features":"Negative IgA-tTG2, negative EMA, normal duodenal biopsy (Marsh 0). No villous atrophy. No validated biomarker. Diagnosis by double-blind gluten rechallenge."},{"condition":"Selective IgA deficiency","overlap_with_cd":"False-negative IgA-tTG2; prevalence 2-3% in CD vs 0.2% general population. Can coexist with CD.","distinguishing_features":"Total serum IgA <0.07 g/L. Requires IgG-based testing (IgG-tTG2, IgG-DGP). CD prevalence 10-30× higher in IgA deficiency."},{"condition":"Common variable immunodeficiency (CVID)","overlap_with_cd":"Villous atrophy, malabsorption, negative serology due to hypogammaglobulinemia. Can cause sprue-like enteropathy.","distinguishing_features":"Low total IgG, IgA, and/or IgM. Broader immunodeficiency. Does not respond to GFD. Lymphocytic infiltrate may differ."},{"condition":"Drug-induced enteropathy (olmesartan, mycophenolate)","overlap_with_cd":"Villous atrophy with IEL mimicking Marsh 3. Seronegative.","distinguishing_features":"Temporal association with drug initiation. Resolution on withdrawal. Olmesartan most common culprit."},{"condition":"Autoimmune enteropathy","overlap_with_cd":"Villous atrophy, malabsorption. Seronegative for CD markers.","distinguishing_features":"Anti-enterocyte and anti-goblet cell antibodies. Often childhood onset. Responds to immunosuppression, not GFD."},{"condition":"Tropical sprue","overlap_with_cd":"Villous atrophy, malabsorption, IDA. Seronegative for CD markers.","distinguishing_features":"Travel/residence in tropical regions. Responds to antibiotics + folate. Affects ileum more than proximal duodenum."},{"condition":"Giardiasis","overlap_with_cd":"Can cause villous atrophy and IEL. Seronegative for CD markers.","distinguishing_features":"Trophozoites on biopsy/stool. Responds to metronidazole."},{"condition":"Inflammatory bowel disease (Crohn's duodenal involvement)","overlap_with_cd":"Duodenal inflammation, possible VA. Upper GI Crohn's can mimic CD histologically.","distinguishing_features":"Granulomas, transmural inflammation, skip lesions. Different distribution on imaging."},{"condition":"Microscopic colitis","overlap_with_cd":"Chronic diarrhea. Co-occurs with CD in 5-10% of cases.","distinguishing_features":"Colonic not small bowel pathology. Diagnosed by colonic biopsy. Responds to budesonide."},{"condition":"Small intestinal bacterial overgrowth (SIBO)","overlap_with_cd":"Bloating, diarrhea, malabsorption. Can coexist with CD.","distinguishing_features":"Positive breath test. Responds to antibiotics. No villous atrophy. Can be secondary to CD-related dysmotility."}],"recommendations":[{"recommendation":"Mandatory IgA-tTG2 + total IgA screening in ALL adults with unexplained iron-deficiency anemia, regardless of GI symptoms.","target":"Guidelines (hematology, general medicine, gastroenterology)","evidence_basis":"CD found in 3.2-5.5% of unexplained IDA (Mahadev 2018, n=2,998). BSG 2021 already recommends. Cost-effective given treatable etiology."},{"recommendation":"CD screening (IgA-tTG2 + total IgA + AGA) in ALL patients with idiopathic cerebellar ataxia and idiopathic peripheral neuropathy. Pursue tTG6 testing where available.","target":"Guidelines (neurology)","evidence_basis":"Gluten-related etiology in 9-34% of idiopathic neuropathy and 20-40% of sporadic ataxia (Sheffield series — single-center caveat noted). Rashtak data: only 11% sensitivity without enteropathy."},{"recommendation":"In high-suspicion extraintestinal presentations with negative serology, proceed to duodenal biopsy if HLA-DQ2/DQ8 positive.","target":"Clinicians across all specialties","evidence_basis":"Verification bias inflates reported sensitivity (Hujoel 2021). Marsh-grade correlation means partial VA may be missed. ACG 2023 already advises biopsy despite negative serology in high suspicion."},{"recommendation":"Include IgG1 subclass levels and fecal secretory IgA in workup of patients with negative CD serology but high clinical suspicion, especially DQ8 genotype.","target":"Clinicians, researchers","evidence_basis":"Sequential class switching IgM→IgG1→IgA (Siniscalco 2025) means IgG1 deficiency can impair mucosal IgA independently of HLA. Emerging hypothesis requiring validation."},{"recommendation":"Fund and prioritize commercialization of tTG6 and tTG3 assays for clinical use.","target":"Research funders, diagnostic industry","evidence_basis":"Two decades of evidence: tTG6 in 73% of gluten ataxia; tTG3 in >90% of DH. Without these assays, organ-specific gluten autoimmunity is undetectable."},{"recommendation":"Integrate CD extraintestinal manifestation recognition into residency training and CME for hematology, neurology, hepatology, endocrinology, dermatology, rheumatology, gynecology, and dentistry.","target":"Medical education programs, specialty societies","evidence_basis":"Finland's nationwide program increased detection 4-fold. Only 35% PCPs ever diagnosed CD; 69.9% consider it rare."},{"recommendation":"When interpreting published claims that seronegative CD is 'primarily classical/severe', explicitly flag survivorship bias: only classical/severe seronegative patients are biopsied, creating a self-reinforcing diagnostic loop.","target":"Researchers, systematic reviewers, guideline authors","evidence_basis":"Logical analysis of ascertainment pathway; supported by verification bias data (Hujoel 2021)"},{"recommendation":"Explicitly flag verification/selection bias in all prevalence tables in future CD research.","target":"Authors, systematic reviewers","evidence_basis":"All EIM prevalence data derive from serology-first cohorts; true prevalence including seronegative CD unknown."}],"meta_analysis_summary":{"studies_reviewed":65,"total_patients":null,"pooled_estimates":{"diagnostic_delay_non_GI":"42 months median (Paez 2017, PMID:28623177, n=101)","diagnostic_delay_GI":"2.3 months median (Paez 2017)","CD_yield_in_unexplained_IDA":"3.2-5.5% (Mahadev 2018, PMID:29689265, n=2,998)","IgA_tTG2_sensitivity_corrected":"57.1% (95% CI 35.4-76.4%) (Hujoel 2021, PMID:32433257, n=36,477)","IgA_tTG2_sensitivity_Marsh_3a":"0-33% (Rostami 1999 PMID:10201452 n=29; Abrams 2004 PMID:15185855 n~33; small samples, wide CIs)","IgA_tTG2_sensitivity_Marsh_3c":"~100% (Rostami 1999)","hypertransaminasemia_in_CD":"21.4% (Jena 2022, 42 studies)","CD_yield_cryptogenic_transaminitis":"4-9.3%","DH_seronegativity_rate":"25-53% on IgA-tTG2","neurological_without_enteropathy_tTG2_sensitivity":"11% (Rashtak 2011, PMID:21056914)","neurological_without_enteropathy_EMA_sensitivity":"0% (Rashtak 2011)","tTG6_positivity_gluten_ataxia":"73% (Hadjivassiliou 2013, PMID:23576621)","tTG6_positivity_newly_diagnosed_CD":"40%","CD_yield_in_osteoporosis":"1.6% (95% CI 1.1-2.0%) (Laszkowska 2018, PMID:29984519, n=3,188)","CD_yield_in_infertile_women":"0.7% biopsy-confirmed (Glimberg 2021, PMID:33850456)","dental_enamel_defects_CD_vs_controls":"50-94% vs 4-27.5%","physician_awareness_PCP_ever_diagnosed":"35% (Zipser 2005, PMID:16050861)","physicians_consider_CD_rare":"69.9% (PMID:30249556)"},"heterogeneity_notes":"Extreme heterogeneity across prevalence estimates due to: (1) serology-first cohort selection in virtually all studies; (2) varying definitions of 'seronegative'; (3) geographic variation; (4) age/sex composition; (5) varying Marsh grade thresholds; (6) absence of serology-independent biopsy protocols; (7) single-center dominance in neurological prevalence estimates (Sheffield). The 0-33% Marsh 3a sensitivity range derives from small subgroups (~29-33 patients) and should be interpreted with appropriate confidence-interval caution."}}
