{"research_topic_id":"4.1","research_topic_title":"Primary Care Barriers to Celiac Disease Diagnosis — Corrected Synthesis","date_completed":"2026-02-08","version":"FINAL — incorporating peer review corrections from Grok 4.1 and sister Opus 4.6 chat","executive_summary":"Primary care is the critical bottleneck in celiac disease (CD) diagnosis: ~70% of physicians consider CD rare despite 1–2% prevalence, knowledge scores average only 50–52% on validated assessments, and IgA-tTG2 testing rates for guideline-indicated conditions such as iron-deficiency anemia (IDA) range from 8.6–61% depending on patient demographics. The resulting diagnostic delay of 5–12 years drives dose-dependent complications including osteoporosis (HR 5.39), lymphoma, and rising autoimmune disease prevalence. This pre-serology failure is the largest single source of patient loss in the diagnostic cascade and compounds downstream verification bias: because most patients never reach IgA-tTG2 testing, serology sensitivity is circularly validated on a biased subset, and seronegative CD patients — such as those with DQ8, Marsh 3A, low IgG1, and low secretory IgA — are virtually invisible to a system that requires physician suspicion to initiate any testing.","peer_review_corrections_applied":[{"correction_id":"C1","original_error":"Selective citation of Abrams et al. 2004 (PMID:15185855) implying 0% tTG2 sensitivity for Marsh 3A, without acknowledging the same group's 2006 paper (PMID:16630760) showing 42.3% tTG sensitivity for partial villous atrophy","correction":"Both papers now cited. tTG sensitivity for partial villous atrophy is approximately 42.3% (2006 larger cohort), not 0%. The 2004 finding that all tTG-positive patients had total villous atrophy was based on a subset with available tTG data, not the full cohort. Additionally, extreme lab-to-lab variability (40% vs 86.4%, P<.0001) is now documented as a key finding.","impact":"Reduces the extremity of the serology-insensitivity claim for Marsh 3A but does NOT change the core conclusion: tTG2 sensitivity is substantially reduced for partial villous atrophy","source":"Peer review (Grok 4.1 and Opus 4.6)"},{"correction_id":"C2","original_error":"Misinterpretation of Cosnes et al. 2008 (PMID:18255352) as showing 'late adult diagnosis was associated with decreased autoimmune disease risk'","correction":"Cosnes found that CD diagnosed BEFORE age 36 (i.e., early-onset CD) was a risk factor for autoimmune disease (HR 2.65, 95% CI 1.79–3.85). This reflects shared genetic susceptibility between early-onset CD and autoimmunity, NOT a protective effect of late diagnosis. The key Cosnes finding is that GFD adherence reduces autoimmune disease incidence (5.4 vs 11.3/1000 patient-years, P=.002). Cosnes and Ventura measure different constructs and are not necessarily contradictory.","impact":"Removes a misleading counterargument; actually strengthens the case for early diagnosis and treatment","source":"Peer review (Grok 4.1 and Opus 4.6)"},{"correction_id":"C3","original_error":"Attribution of '11–18% ordering rate' to Smukalla et al. 2014 hematologist survey (PMID:24892255)","correction":"Smukalla abstract reports only 8.6% of hematologists believe ALL IDA patients should be screened. Per-scenario ordering rates of 61%, 48%, 43%, and 18% come from Spencer et al. 2017 (PMID:28931034) PCP survey, not Smukalla. The '11%' figure cannot be traced to either abstract.","impact":"Attribution corrected; core finding unchanged — hematologist and PCP testing rates for IDA remain dramatically low","source":"Peer review (Grok 4.1)"},{"correction_id":"C4","original_error":"USPSTF 2017 report attributed the Hujoel 57% sensitivity figure, which was published 2020/2021","correction":"The Hujoel verification bias analysis (PMID:32433257) was published online May 2020, print April 2021 — it could NOT have appeared in the USPSTF 2017 evidence review. The USPSTF may have noted lower sensitivity in asymptomatic/low-prevalence populations, but the specific 57% figure is Hujoel's, not the USPSTF's.","impact":"Attribution corrected; the verification bias finding remains valid on its own merits","source":"Peer review (Grok 4.1)"},{"correction_id":"C5","original_error":"Inconsistent lymphoma risk figures: OR 15.84 (opening) vs RR 35.8 (body)","correction":"OR 15.84 (95% CI 7.85–31.94) for T-cell lymphoma comes from the Tio et al. 2012 meta-analysis (PMID:22239821). RR 35.8 (95% CI 27.1–47.4) for EATL specifically comes from the Catassi et al. 2002 risk review (and is cited in the Lebwohl/Green literature). These are different measures (OR vs RR) from different studies with different reference populations. Both are now clearly attributed.","impact":"Reconciled; both figures plausible within their respective contexts","source":"Peer review (Opus 4.6)"},{"correction_id":"C6","original_error":"Catassi case-finding described as '32–43-fold increase' — only 43-fold is verified from abstract","correction":"Catassi et al. 2007 (PMID:17355413) abstract: baseline 0.27/1000 visits → 11.6/1000 visits = 43-fold increase. The '32-fold' lower bound cannot be confirmed from the abstract. Using '43-fold' as verified figure.","impact":"Minor; direction and magnitude unchanged","source":"Peer review (Grok 4.1)"},{"correction_id":"C7","original_error":"Hopper et al. 2008 Marsh 3a-specific sensitivity of 85% cited but not verifiable from abstract","correction":"Hopper abstract (PMID:18328437) reports overall IgA-tTG sensitivity of 90.9% and 2-step tTG+EMA sensitivity of 85.7%. Marsh grade-stratified data may be in full text but cannot be independently confirmed from abstract alone. Flagged as 'full-text derived, unverified from abstract.'","impact":"Minor; Abrams 2006 data (42.3% for PVA) now serves as the primary citation for Marsh-grade-stratified sensitivity","source":"Peer review (Grok 4.1)"},{"correction_id":"C8","original_error":"Lebwohl 2012 Hispanic OR 0.69 not in abstract","correction":"Lebwohl abstract (PMID:22732871) confirms Black OR 0.55, male OR 0.81, age ≥70 OR 0.51. Hispanic OR 0.69 is NOT in the abstract and may derive from full-text tables. Flagged as 'full-text derived.'","impact":"Minor; core demographic disparity finding fully supported by the verified ORs","source":"Peer review (Grok 4.1)"},{"correction_id":"C9","original_error":"Cartee et al. 2023 finding (80% seronegative in Black patients) presented without adequate discussion of small sample size (n=42)","correction":"Now noted: UAB registry, n=852 total, only n=42 (4.9%) Black patients. Study authors themselves note potential timing bias (tTG tested after GFD initiation in some cases). Hujoel editorial in same issue called tTG 'a particularly poor screening tool in the Black American population' but also urged caution given the small sample.","impact":"Finding flagged as preliminary requiring replication; direction likely valid but magnitude uncertain","source":"Peer review (Grok 4.1 and Opus 4.6)"}],"key_findings":[{"finding_id":"4.1.1","finding":"69.9% of physicians consider CD a rare disorder despite true prevalence of 1–2%. Mean physician knowledge scores are 50–52% on validated questionnaires across international surveys (2005–2024). Only 35% of US PCPs have ever diagnosed CD. Symptom recognition follows a steep gradient: diarrhea 90%, fatigue 54%, anemia/osteoporosis 45%, depression 24%, diabetes association 13%.","evidence_strength":"strong","quantitative_estimate":"69.9% perceive CD as rare; knowledge scores 50.9–52.2%; symptom recognition 13–90%","confidence_interval":null,"key_citations":["PMID:30249556","PMID:33346575","PMID:39123100","PMID:16050861"],"contradicts_guidelines":true,"affected_patient_population":"All CD patients — low suspicion prevents testing initiation"},{"finding_id":"4.1.2","finding":"Only 8.6% of hematologists believe all IDA patients should be screened for CD, despite meta-analytic CD prevalence of 3.2% (95% CI 2.6–3.9%) in IDA populations (NNS ~31). PCP testing rates for IDA vary significantly by demographics: 61% for young Caucasian males, 43% for premenopausal Caucasian women, 18% for elderly Caucasian men. 80% of PCPs would initiate GFD before confirmatory biopsy, violating guidelines.","evidence_strength":"strong","quantitative_estimate":"8.6% hematologist endorsement; 18–61% PCP testing rate; 3.2% CD prevalence in IDA","confidence_interval":"95% CI 2.6–3.9% (IDA pooled prevalence)","key_citations":["PMID:24892255","PMID:28931034","PMID:29689265"],"contradicts_guidelines":true,"affected_patient_population":"IDA patients, especially women, elderly, non-Caucasian; NOTE: scenario-specific rates from Spencer et al. (PMID:28931034), not Smukalla"},{"finding_id":"4.1.3","finding":"Diagnostic delay averages 5–12 years from symptom onset: US 11y, Canada 11.7y, Sweden 9.7y, Denmark 5.8y. Non-GI presentations experience ~18× longer delay than GI symptoms (42 vs 2.3 months). Women experience ~50% longer delay than men (93.1 vs 60.2 months total), driven entirely by physician behavior ('doctor's delay'), not patient delay. >60% of Canadian patients consulted ≥3 physicians before diagnosis.","evidence_strength":"strong","quantitative_estimate":"5–12 years average delay; 18× longer for non-GI presentations; women 93.1 vs men 60.2 months","confidence_interval":null,"key_citations":["PMID:11197241","PMID:22060243","PMID:36618766","PMID:27401607","PMID:25139307"],"contradicts_guidelines":false,"affected_patient_population":"Adult-onset CD, non-classical presentations, women"},{"finding_id":"4.1.4","finding":"25% of CD patients receive a prior IBS diagnosis. IBS-labeled patients show a 3× excess compared to controls, detectable up to 10 years before eventual CD diagnosis. CD prevalence among IBS patients meeting Rome criteria is ~4.1% (OR 4.48). IBS diagnosis functions as a diagnostic trap: once labeled, patients are rarely re-evaluated.","evidence_strength":"strong","quantitative_estimate":"25% prior IBS misdiagnosis; 4.1% CD prevalence in IBS","confidence_interval":null,"key_citations":["PMID:23697749"],"contradicts_guidelines":true,"affected_patient_population":"Patients meeting IBS criteria who have not been tested for CD"},{"finding_id":"4.1.5","finding":"IgA-tTG2 sensitivity for partial villous atrophy (Marsh 3A) is substantially reduced: 42.3% in the Abrams et al. 2006 Columbia cohort (vs 90% for total villous atrophy, P<.0001). CRITICAL: extreme lab-to-lab variability exists — sensitivity was 40% for one major US commercial lab vs 86.4% for another (P<.0001). EMA sensitivity for partial vs total atrophy: 33% vs 77% (Abrams 2004, P<.001). The 2004 study found all tTG-positive patients had total villous atrophy, but this was based on a subset with available tTG data, not the full cohort.","evidence_strength":"strong","quantitative_estimate":"tTG sensitivity: 42.3% for Marsh 3A vs 90% for Marsh 3B/C; lab variability 40–86.4%","confidence_interval":null,"key_citations":["PMID:16630760","PMID:15185855"],"contradicts_guidelines":true,"affected_patient_population":"Patients with partial villous atrophy (Marsh 3A); all patients tested by commercial laboratories with variable performance"},{"finding_id":"4.1.6","finding":"Verification bias in the serology-first algorithm inflates reported IgA-tTG2 sensitivity. Hujoel et al. 2021 systematic review: only 3.6% (95% CI 1.1–10.9%) of IgA-tTG2-negative individuals underwent confirmatory biopsy vs 79.2% of positives. Bias-adjusted sensitivity drops from 92.6% to 57.1% (95% CI 35.4–76.4%). The wide CI (35–76%) reflects substantial uncertainty; true sensitivity may be closer to the upper bound. This finding is directionally correct but magnitude remains debatable.","evidence_strength":"strong","quantitative_estimate":"Adjusted sensitivity 57.1% (95% CI 35.4–76.4%)","confidence_interval":"95% CI 35.4–76.4%","key_citations":["PMID:32433257"],"contradicts_guidelines":true,"affected_patient_population":"All CD patients screened by serology; seronegative patients doubly excluded"},{"finding_id":"4.1.7","finding":"Delayed diagnosis drives dose-dependent complications. Osteoporosis: HR 5.39 (95% CI 4.89–5.95) in Danish nationwide cohort (n=9,397). Lymphoma: meta-analytic OR 2.61 for NHL, OR 15.84 (95% CI 7.85–31.94) for T-cell lymphoma (Tio et al. 2012). EATL-specific risk reported as RR 35.8 in some series. Autoimmune disease prevalence in pediatric CD: 5.1% if diagnosed <2y, 17% ages 2–10, 23.6% >10y (Ventura et al., P=0.000001). CORRECTION: Cosnes et al. 2008 found early-ONSET CD (diagnosed <36y) predicts autoimmune risk (HR 2.65), and GFD adherence is protective (5.4 vs 11.3/1000 patient-years). Cosnes and Ventura are not contradictory — they measure different constructs (disease onset vs cumulative exposure). Undiagnosed CD carries ~4× excess mortality over 45 years (Rubio-Tapia 2009, HR 3.9, 95% CI 2.0–7.5; based on n=14 seropositive individuals from 1948–54 Air Force sera).","evidence_strength":"strong","quantitative_estimate":"HR 5.39 osteoporosis; OR 15.84 T-cell lymphoma; 5.1–23.6% autoimmune accumulation; HR 3.9 mortality","confidence_interval":"95% CI 4.89–5.95 (osteoporosis); 95% CI 7.85–31.94 (T-cell lymphoma); 95% CI 2.0–7.5 (mortality)","key_citations":["PMID:37730081","PMID:22239821","PMID:10419909","PMID:18255352","PMID:19362553"],"contradicts_guidelines":false,"affected_patient_population":"All undiagnosed CD patients — risk proportional to delay duration"},{"finding_id":"4.1.8","finding":"Only ~35% of physicians routinely measure total serum IgA alongside CD serology, meaning ~65% fail to check for the primary cause of false-negative IgA-tTG2 (selective IgA deficiency, 2–3% prevalence in CD vs 0.1–0.4% general population). Without total IgA measurement, IgA-deficient patients with CD receive false-negative results and are removed from diagnostic consideration permanently.","evidence_strength":"strong","quantitative_estimate":"34.5% check total IgA; 65% failure rate","confidence_interval":null,"key_citations":["PMID:30249556"],"contradicts_guidelines":true,"affected_patient_population":"IgA-deficient CD patients (2–3% of CD population)"},{"finding_id":"4.1.9","finding":"Finland's active case-finding model achieves the world's highest clinical detection rate (~35% of true prevalence; clinical prevalence 0.55–0.70%) through systematic healthcare personnel training and government GFD cost compensation (Kela system). Catassi et al. 2007 demonstrated a 43-fold increase in CD diagnostic rate with primary care case-finding (0.27 to 11.6 per 1000 visits). Even Finland misses ~65% of cases (true prevalence 2.0–2.7%). Italy passed Law 130/2023 mandating universal pediatric screening; pilot data show 2.8–4.4% seropositivity.","evidence_strength":"strong","quantitative_estimate":"43-fold increase with case-finding; Finland ~35% detection rate; Italy 1.65% prevalence with 60% undiagnosed","confidence_interval":"95% CI 6.8–16.4 per 1000 visits (post-intervention rate)","key_citations":["PMID:17355413","PMID:19492246","PMID:17944736"],"contradicts_guidelines":false,"affected_patient_population":"Risk-group patients and general pediatric population"},{"finding_id":"4.1.10","finding":"Demographic disparities compound under-testing: during EGD for CD-compatible indications, Black patients (OR 0.55, 95% CI 0.48–0.64), males (OR 0.81, 95% CI 0.75–0.88), and patients ≥70 years (OR 0.51, 95% CI 0.46–0.57) are significantly less likely to receive duodenal biopsy. Cartee et al. 2023 found 80% of Black patients with biopsy-confirmed CD had tTG-IgA below upper limit of normal vs ~9% of Whites — HOWEVER, this was based on only n=42 Black patients from a single center (UAB), with potential timing bias relative to GFD initiation. Requires replication before firm conclusions.","evidence_strength":"moderate","quantitative_estimate":"Black OR 0.55; male OR 0.81; age ≥70 OR 0.51 for biopsy; 80% seronegativity in Black CD (preliminary, n=42)","confidence_interval":"95% CI 0.48–0.64 (Black); 95% CI 0.75–0.88 (male); 95% CI 0.46–0.57 (age ≥70)","key_citations":["PMID:22732871","DOI:10.1016/j.gastha.2023.08.014"],"contradicts_guidelines":true,"affected_patient_population":"Non-White, male, and elderly patients. NOTE: Hispanic OR 0.69 cited elsewhere is from Lebwohl full text, not verifiable from abstract."},{"finding_id":"4.1.11","finding":"No randomized controlled trial has ever tested a physician education intervention with CD diagnosis rate as a primary outcome. EHR-based NLP algorithms achieve 72.9% sensitivity/89.9% specificity for identifying potentially undiagnosed CD; ML models using routine lab data achieve AUC 0.86. Neither has been deployed at scale. Cost-effectiveness analyses support both case-finding (€3,603/QALY) and mass screening (€3,841/QALY) — both well below standard willingness-to-pay thresholds.","evidence_strength":"strong","quantitative_estimate":"NLP: 72.9% sensitivity, 89.9% specificity; ML: AUC 0.86; ICER €3,603–3,841/QALY","confidence_interval":null,"key_citations":["PMID:23956016","DOI:10.1053/j.gastro.2024.07.024"],"contradicts_guidelines":false,"affected_patient_population":"All undiagnosed CD patients in EHR-equipped health systems"},{"finding_id":"4.1.12","finding":"The USPSTF issued an 'I' (insufficient evidence) statement on CD screening in 2017, citing no RCTs of screening vs no screening. This is widely misinterpreted as evidence against screening. CD's NNS in the general population (67–100) is far more favorable than routinely screened conditions such as breast cancer (NNS 500–2,000) and colorectal cancer (NNS 800–1,000). The USPSTF report predates the Hujoel verification bias analysis (2020/2021) and Italy's Law 130/2023 screening data.","evidence_strength":"strong","quantitative_estimate":"CD NNS 67–100 (general); 5–33 (high-risk)","confidence_interval":null,"key_citations":["USPSTF 2017"],"contradicts_guidelines":false,"affected_patient_population":"General and high-risk populations"},{"finding_id":"4.1.13","finding":"Non-classical CD presentations now constitute the majority of cases. A 40-year Italian cohort (1980–2020, n=1,547) showed non-classical CD at 63.3% vs classical at ~25%. Green et al. 2005 documented diarrhea as presenting complaint dropping from 73% (pre-1993) to 43% (post-1993). Mass screening in Italy found symptoms suggestive of CD equally common in celiac and non-celiac children, demonstrating inherent limits of symptom-based detection.","evidence_strength":"strong","quantitative_estimate":"63.3% non-classical; diarrhea declining from 73% to 43%","confidence_interval":null,"key_citations":["DOI:10.3390/nu16142292","DOI:10.1053/j.gastro.2005.02.060"],"contradicts_guidelines":false,"affected_patient_population":"All contemporary CD patients — majority present non-classically"}],"biases_documented":[{"bias_type":"Pre-serology clinical suspicion bias (the dominant bottleneck)","description":"The largest source of patient loss occurs BEFORE any serological test is ordered. Physicians must first suspect CD to order IgA-tTG2, but ~70% consider CD rare, symptom recognition drops below 50% for atypical presentations, and demographic biases (sex, ethnicity, age) further suppress testing. This creates a massive pre-analytical selection filter that excludes most CD patients from the diagnostic pathway entirely. This step is unmeasured in any diagnostic accuracy study because studies begin after testing is ordered.","magnitude_estimate":">50–80% of guideline-indicated patients never receive IgA-tTG2 testing; majority of undiagnosed CD patients lost at this step; this likely represents the single largest sensitivity loss in the entire diagnostic cascade","evidence_sources":["PMID:30249556","PMID:16050861","PMID:28931034","PMID:24892255"]},{"bias_type":"Verification bias in serology validation studies","description":"Differential biopsy rates (79.2% seropositive vs 3.6% seronegative) inflate reported IgA-tTG2 sensitivity from ~57% (adjusted) to ~93% (headline figure). Only patients who test positive proceed to the gold standard, making the test appear more sensitive than it is. The wide CI (35–76%) means true sensitivity could be anywhere in this range.","magnitude_estimate":"Sensitivity inflation from ~57% to ~93%; seronegative CD structurally excluded from most cohorts","evidence_sources":["PMID:32433257"]},{"bias_type":"Demographic/sex bias in clinical suspicion and biopsy","description":"Women experience 50% longer diagnostic delay than men (93.1 vs 60.2 months), driven entirely by physician delay. PCP testing rates for IDA vary significantly by patient demographics (61% for young White men vs 18% for elderly men). During EGD, Black patients (OR 0.55), males (OR 0.81), and elderly (OR 0.51) are less likely to receive duodenal biopsy even when indications are present.","magnitude_estimate":"50% longer delay for women; 2–3× disparity in biopsy rates by race","evidence_sources":["PMID:27401607","PMID:28931034","PMID:22732871"]},{"bias_type":"IBS misclassification bias","description":"25% of CD patients receive a prior IBS diagnosis, creating a diagnostic trap: once labeled, patients are unlikely to be re-evaluated for CD despite overlapping symptoms. This 3× excess IBS labeling is detectable up to 10 years before correct diagnosis.","magnitude_estimate":"25% prior IBS misdiagnosis; IBS label prevents CD re-evaluation","evidence_sources":["PMID:23697749"]},{"bias_type":"Compounding cascade bias: pre-serology loss amplifies verification bias","description":"Pre-serology loss and verification bias are not independent — they compound. Because physicians with low CD suspicion rarely order serology, the patients who do get tested are a biased subset (higher suspicion, more severe/classical presentations). This inflates apparent serology sensitivity. Seronegative patients are doubly excluded: they evade both the suspicion filter and the serology filter. The result is a self-reinforcing cycle where low physician awareness → biased testing → inflated sensitivity estimates → continued reliance on serology as gatekeeper → continued invisibility of seronegative CD.","magnitude_estimate":"Structurally guaranteed; unmeasured but amplifies all downstream bias estimates","evidence_sources":["Structural inference from physician awareness data combined with Hujoel verification bias analysis"]},{"bias_type":"Lab-to-lab variability in commercial tTG2 testing (CORRECTED — added per peer review)","description":"Abrams et al. 2006 found extreme variability between two major US commercial laboratories: Lab #1 tTG sensitivity 40% vs Lab #2 sensitivity 86.4% (P<.0001). Specificity also varied: 100% (Lab #1) vs 41.7% (Lab #2). This means clinical tTG performance depends heavily on which laboratory processes the sample — a source of variation entirely invisible to the ordering physician.","magnitude_estimate":"Sensitivity range 40–86.4% depending on commercial lab used","evidence_sources":["PMID:16630760"]}],"unproven_assumptions_identified":[{"assumption":"Physician awareness of CD has meaningfully improved over recent decades","evidence_against":"2024 Danube survey (PMID:39123100) shows only marginal improvement to 52.2% mean knowledge score. Zipser 2005 findings on symptom recognition remain largely unreplicated. No pre/post educational intervention study with diagnosis rate as outcome has ever been published.","evidence_for":"Increasing media coverage, growing gluten-free food market, some countries (Finland, Italy) have implemented active measures. Younger physicians consistently outscore older ones in knowledge assessments.","clinical_impact":"If awareness has NOT improved, all published diagnostic delay estimates may still be current, and pre-serology patient loss remains the dominant bottleneck"},{"assumption":"Symptom-based case-finding can close the diagnostic gap if physicians are better educated","evidence_against":"Italian mass screening found symptoms suggestive of CD equally common in celiac and non-celiac children — even perfect symptom recognition cannot distinguish most cases. Finland's world-best case-finding still misses ~65% of cases.","evidence_for":"The 18× delay difference between GI and non-GI presentations shows room for improvement through better recognition of atypical presentations. Catassi's 43-fold increase demonstrates enormous latent capacity.","clinical_impact":"Symptom-based case-finding likely has inherent ceiling effects; universal screening (Italy model) or EHR-automated testing may be required to substantially reduce the undiagnosed population"},{"assumption":"IgA-tTG2 serology is adequate as the sole initial screening test, and seronegative CD is negligibly rare","evidence_against":"65% of physicians don't check total IgA. Hujoel adjusted sensitivity 57% (CI 35–76%). Abrams 2006: tTG sensitivity 42.3% for partial villous atrophy. Lab-to-lab variability 40–86.4%. Cartee: potentially 80% seronegativity in Black patients (preliminary, n=42).","evidence_for":"In high-prevalence symptomatic populations, IgA-tTG2 PPV >95% when titer >10× ULN. Most diagnosed CD patients ARE seropositive. The Hujoel upper CI bound (76%) is closer to conventional estimates. Seronegative CD may represent a distinct clinical entity with different natural history.","clinical_impact":"Even accepting the upper bound of the Hujoel CI (76% sensitivity), ~24% of CD patients would be missed by serology. Combined with the pre-serology loss (>50% never tested), the total cascade sensitivity is far below what guidelines assume."},{"assumption":"The USPSTF 'I' statement reflects evidence that universal screening is not beneficial","evidence_against":"'I' means insufficient evidence, not evidence of no benefit. CD's NNS (67–100) is far more favorable than many routinely screened conditions. No RCTs exist partly because randomizing to non-screening is ethically problematic once CD is detected. Italy's Law 130/2023 pilot data show higher-than-expected detection yields.","evidence_for":"Long-term outcomes of screen-detected asymptomatic CD remain uncertain; treatment burden (lifelong GFD) is non-trivial; overdiagnosis of potential CD is possible; no RCT demonstrating net benefit exists.","clinical_impact":"The USPSTF statement has been widely used to justify clinical inertia regarding CD screening, particularly in US primary care"}],"overlooked_populations":[{"population":"Seronegative CD patients, especially with Marsh 3A, non-DQ2.5 genotypes (DQ8, DQ2.2), and immunoglobulin deficiencies","estimated_size":"Estimates range from 1.7–24% of all CD; applying conservative assumptions to the 3.3M estimated US CD cases yields thousands to tens of thousands of affected individuals. CAVEAT: this estimate multiplies uncertain proportions with wide ranges and should be treated as order-of-magnitude only.","why_missed":"Doubly excluded: first by low physician suspicion (pre-serology loss), then by negative serology falsely reassuring both patient and physician. Reference patient profile (DQ8, Marsh 3A, all serology <1, low IgG1, low secretory IgA) illustrates complete evasion of every standard diagnostic checkpoint. Sequential IgM→IgG1→IgA class switching (Siniscalco, Immunity, 2025) means IgG1 deficiency independently impairs mucosal IgA production regardless of HLA genotype.","proposed_solution":"Biopsy independent of serology in high-clinical-suspicion patients; develop non-serological biomarkers; include IgG1 subclass and secretory IgA in expanded testing panels; EHR prompts should flag persistent symptoms even after negative serology"},{"population":"Non-Caucasian CD patients, particularly Black Americans","estimated_size":"CD prevalence in non-Caucasian populations estimated at 0.5–1.0%; seroprevalence studies in Black Americans scarce. Cartee finding (80% seronegativity in Black CD patients, n=42) suggests serology may systematically underperform in this population, but requires replication.","why_missed":"Physician testing rates significantly lower for non-Caucasian patients with identical presentations (Spencer et al.); CD perceived as 'Caucasian disease'; potentially reduced serology sensitivity in Black patients (preliminary evidence).","proposed_solution":"Remove ethnicity from clinical decision-making about CD testing; automated EHR prompts based on symptoms/labs without demographic filtering; replicate Cartee finding in larger, multi-center cohorts"},{"population":"Elderly-onset CD (>60 years)","estimated_size":"CD prevalence in elderly may be 2.7% (higher than working-age adults in Finnish data); ~28% of new CD diagnoses are in patients >60","why_missed":"Symptoms attributed to aging, medications, or comorbidities; OR 0.51 for duodenal biopsy in patients ≥70; IDA commonly attributed to chronic disease or occult GI blood loss rather than malabsorption","proposed_solution":"Include elderly-specific CD testing algorithms; mandate CD serology in unexplained IDA workup regardless of age"},{"population":"Patients previously misdiagnosed with IBS who have never been tested for CD","estimated_size":"4.1% of IBS patients may have undiagnosed CD; IBS prevalence ~10–15% of population, implying a large absolute number","why_missed":"IBS diagnosis functions as a diagnostic trap — once labeled, patients are rarely re-evaluated for CD; 25% of diagnosed CD patients had prior IBS label","proposed_solution":"Guidelines should mandate IgA-tTG2 testing before or concurrent with any IBS diagnosis; AGA/ACG already recommend this but adherence is poor without EHR enforcement"},{"population":"Males with CD","estimated_size":"Diagnosed female:male ratio is 2–3:1 but seroprevalence studies show closer to 1:1, suggesting systematic male underdiagnosis","why_missed":"Lower physician suspicion for CD in males; males less likely to seek care for GI symptoms; iron deficiency in males triggers GI malignancy workup but not necessarily CD testing","proposed_solution":"Include CD serology in all unexplained IDA workups regardless of sex"}],"diagnostic_step_sensitivity":{"step_name":"Primary care clinical suspicion → IgA-tTG2 test ordering → biopsy confirmation (the full pre-diagnosis cascade)","reported_sensitivity":"IgA-tTG2 commonly reported as ~93% sensitive (from verification-biased studies); pre-serology step sensitivity is NOT formally measured in any diagnostic accuracy study","adjusted_sensitivity":"IgA-tTG2 bias-adjusted: ~57% (95% CI 35–76%); Marsh-3A-specific: ~42% (Abrams 2006); lab-dependent: 40–86% (Abrams 2006). Pre-serology step: estimated <20–50% of guideline-indicated patients receive testing. Combined cascade sensitivity for a seronegative patient: <2–5%.","false_negative_rate":"Pre-serology step: >50–80% in many high-yield indications (IDA testing: 39–91.4% never tested). Post-serology (verification bias): ~43% additional false negatives. Post-serology (Marsh 3A-specific): ~58% false negatives. The unmeasured pre-serology step likely represents the single largest sensitivity loss in the entire diagnostic cascade.","key_limitations":["Entirely physician-knowledge-dependent — no automated safeguards deployed at scale","Symptom recognition drops below 50% for atypical presentations that now constitute the majority of CD cases","Demographic biases (sex, ethnicity, age) systematically reduce testing for specific subgroups","IBS misdiagnosis functions as a diagnostic trap, removing patients from CD consideration for years","~65% of physicians fail to order total serum IgA alongside tTG2, missing IgA-deficient patients","Extreme lab-to-lab variability (40–86.4% sensitivity) means clinical performance depends on which commercial lab is used","Physician unawareness of seronegative CD means negative serology terminates investigation in virtually all clinical settings","This step is structurally unmeasured — no diagnostic accuracy study can capture it because studies begin after testing is ordered"]},"contradictory_studies":[{"citation":"USPSTF Screening Recommendation, 2017","pmid":null,"finding":"Concluded insufficient evidence ('I' statement) to recommend screening for CD in asymptomatic persons, citing no RCTs of screening vs no screening and uncertain benefit of treating screen-detected asymptomatic CD","contradicts":"ACG, ESPGHAN, BSG, and ESsCD guidelines that recommend active case-finding in at-risk groups; Italy's Law 130/2023 mandating universal pediatric screening; cost-effectiveness analyses showing ICERs well below standard thresholds"},{"citation":"Some osteoporosis screening studies suggest limited yield of CD screening in isolated osteoporosis","pmid":null,"finding":"CD prevalence in unselected osteoporosis patients is ~1.6%, only modestly above background, leading some to argue against routine screening in osteoporosis","contradicts":"ACG/BSG guidelines recommending CD testing in unexplained osteoporosis; the finding that 38–72% of newly diagnosed CD patients have reduced BMD suggests the relationship is real but asymmetric — CD→osteoporosis is strong, but osteoporosis→CD yield is modest"},{"citation":"Cosnes et al. 2008, Clin Gastroenterol Hepatol (CORRECTED INTERPRETATION)","pmid":"18255352","finding":"CD diagnosed before age 36 was a risk factor for autoimmune disease (HR 2.65, 95% CI 1.79–3.85); GFD adherence reduced autoimmune disease incidence (5.4 vs 11.3/1000 patient-years, P=.002). This reflects shared genetic susceptibility between early-onset CD and autoimmunity, NOT a protective effect of late diagnosis.","contradicts":"Does NOT contradict Ventura et al. 1999 as originally stated. Cosnes and Ventura measure different constructs: Ventura measured age at diagnosis as a proxy for cumulative gluten exposure in pediatric patients; Cosnes measured age at diagnosis as a predictor reflecting disease onset timing in adults. Both support the importance of early diagnosis and GFD adherence."}],"research_gaps":[{"gap":"No RCT has ever tested a primary care educational intervention with CD diagnosis rate as primary outcome — the single largest actionable research gap in CD diagnosis","importance":"high","proposed_study_design":"Cluster-randomized trial: intervention arm receives structured CD education + EHR prompts for IgA-tTG2 when trigger conditions (IDA, unexplained transaminitis, IBS) are documented; control arm receives standard care. Primary outcome: incident CD diagnoses per 10,000 patient-years. Minimum 24-month follow-up."},{"gap":"No health system has implemented and evaluated EHR best-practice alerts for automatic IgA-tTG2 ordering in high-yield indications","importance":"high","proposed_study_design":"Stepped-wedge cluster-randomized trial: automated EHR alert fires when IDA, unexplained elevated transaminases, or new IBS diagnosis documented without concurrent CD serology. Measure ordering rates, diagnosis yield, and diagnostic delay."},{"gap":"True pre-serology patient loss has never been directly measured","importance":"high","proposed_study_design":"Population-based study linking claims/EHR data for trigger conditions (IDA, thyroid disease, T1D, IBS) to CD serology ordering rates, stratified by specialty, patient demographics, and healthcare setting."},{"gap":"Validation of bias-adjusted serology sensitivity in diverse populations, Marsh grades, and HLA genotypes","importance":"high","proposed_study_design":"Prospective studies with serology-independent biopsy in high-suspicion cases across diverse demographics; stratify by Marsh grade and HLA type"},{"gap":"Replication of Cartee finding (80% seronegativity in Black CD patients) in larger, multi-center cohorts","importance":"high","proposed_study_design":"Multi-center US study with prospective enrollment of Black patients undergoing EGD with duodenal biopsy regardless of serology status"},{"gap":"Long-term outcomes of Italy's universal pediatric screening program (Law 130/2023)","importance":"high","proposed_study_design":"Longitudinal cohort: screen-detected vs clinically detected children compared for complications, QoL, GFD adherence, healthcare costs at 5 and 10 years"},{"gap":"No study has measured physician awareness of seronegative CD or the clinical consequences of false reassurance from negative IgA-tTG2","importance":"high","proposed_study_design":"Survey with vignette-based assessment of management after negative IgA-tTG2 in high-suspicion patient; combined with retrospective cohort of patients with negative serology who were later diagnosed with CD"},{"gap":"Medical school and residency CD curriculum hours have never been quantified","importance":"medium","proposed_study_design":"Survey of medical school and residency program directors across multiple countries"},{"gap":"Lab-to-lab variability in commercial tTG2 performance has not been systematically assessed since Abrams 2006","importance":"medium","proposed_study_design":"Prospective comparison of multiple commercial tTG2 assays using the same serum samples from patients with biopsy-confirmed CD across all Marsh grades"}],"differential_diagnoses_relevant":[{"condition":"Irritable Bowel Syndrome (IBS)","overlap_with_cd":"Bloating, abdominal pain, altered bowel habits, fatigue. 25% of CD patients initially misdiagnosed with IBS. 4.1% of IBS patients have undiagnosed CD.","distinguishing_features":"IgA-tTG2 serology; guidelines already mandate CD testing before IBS diagnosis but adherence is poor. Persistent symptoms after IBS treatment should prompt CD re-evaluation."},{"condition":"Iron-deficiency anemia (unexplained)","overlap_with_cd":"Fatigue, pallor, exercise intolerance. IDA is the most common extraintestinal manifestation of CD (present in 32–69% of adult CD patients). CD prevalence in IDA: 3.2%.","distinguishing_features":"Refractory IDA or IDA without obvious blood loss should mandate IgA-tTG2 testing. Iron absorption occurs in proximal duodenum — same site as CD villous atrophy."},{"condition":"Non-celiac gluten sensitivity (NCGS)","overlap_with_cd":"GI and extraintestinal symptoms improving on GFD; negative IgA-tTG2 serology","distinguishing_features":"No villous atrophy on biopsy; no elevated IELs; HLA-DQ2/DQ8 not required. However, some NCGS cases may represent undetected seronegative CD if biopsy is not performed — NCGS could be a diagnostic sink for seronegative CD."},{"condition":"Selective IgA deficiency","overlap_with_cd":"Not a differential diagnosis per se, but a confounder causing false-negative IgA-tTG2. Prevalence 2–3% in CD vs 0.1–0.4% general population.","distinguishing_features":"Total serum IgA <7 mg/dL should trigger IgG-based testing (IgG-tTG2, IgG-DGP). ~65% of physicians fail to check total IgA alongside CD serology."}],"recommendations":[{"recommendation":"Implement EHR-based clinical decision support that automatically prompts IgA-tTG2 + total IgA testing when iron-deficiency anemia, unexplained elevated transaminases, new IBS diagnosis, unexplained osteoporosis, type 1 diabetes, or autoimmune thyroid disease is documented","target":"health systems, EHR vendors, researchers","evidence_basis":"Persistent low testing rates (8.6–61%) despite decades of guidelines; NLP (73% sensitivity) and ML (AUC 0.86) tools demonstrate feasibility; no health system has implemented or tested this approach"},{"recommendation":"Mandate CD serology before or concurrent with any new IBS diagnosis, with EHR enforcement","target":"guidelines, health systems","evidence_basis":"25% of CD patients misdiagnosed with IBS; 4.1% of IBS patients have undiagnosed CD; AGA/ACG already recommend this but adherence is poor without enforcement"},{"recommendation":"Require total serum IgA measurement alongside every IgA-tTG2 order, implemented as a reflexive laboratory protocol","target":"laboratories, guidelines","evidence_basis":"65% of physicians fail to order total IgA; false-negative IgA-tTG2 in IgA deficiency is completely preventable"},{"recommendation":"Conduct cluster-randomized trials of primary care CD education interventions with incident CD diagnosis rate as primary outcome","target":"researchers, funding agencies","evidence_basis":"No such trial has ever been conducted — the single largest actionable research gap in CD diagnosis"},{"recommendation":"Develop EHR prompts that flag patients with persistent unexplained symptoms AFTER negative IgA-tTG2, to prevent false reassurance from seronegative results","target":"health systems, researchers","evidence_basis":"Seronegative CD patients (e.g., DQ8/Marsh 3A/low IgG1/low secretory IgA) are invisible to current algorithms; negative serology terminates investigation in virtually all clinical settings"},{"recommendation":"Reclassify CD from 'rare' to 'common' in medical education curricula and allocate teaching time proportional to disease burden (1–2% prevalence)","target":"medical schools, residency programs, CME providers","evidence_basis":"69.9% of physicians consider CD rare; knowledge scores average 50–52%; curriculum hours for CD have never been quantified"},{"recommendation":"Remove ethnicity and age from clinical decision-making about CD testing; apply identical testing thresholds across all demographics","target":"guidelines, clinicians","evidence_basis":"Significant demographic biases documented in testing and biopsy rates; OR 0.55 for Black patients, 0.51 for elderly receiving duodenal biopsy during EGD"},{"recommendation":"Standardize commercial tTG2 assay performance through regulatory benchmarks or head-to-head comparison data available to clinicians","target":"laboratories, regulators, professional societies","evidence_basis":"Abrams 2006 found sensitivity ranging 40–86.4% between two US labs (P<.0001); clinicians have no visibility into which lab's performance characteristics apply to their patients"},{"recommendation":"Guidelines should explicitly address seronegative CD, recommend biopsy independent of serology in high-suspicion cases, and acknowledge the limitations of serology-first algorithms","target":"ACG, ESPGHAN, BSG, other guideline bodies","evidence_basis":"Verification bias evidence (Hujoel); Marsh-grade-dependent sensitivity (Abrams 2004, 2006); lab-to-lab variability; reference patient profile demonstrating diagnostic evasion"}],"reference_patient_analysis":{"profile":"DQ8 genotype, Marsh 3A villous atrophy, IgA-tTG2 <1, anti-DGP IgG <1, low IgG1 subclass, low fecal secretory IgA","barriers_converging":["Pre-serology loss: physicians consider CD rare (69.9%), fail to recognize atypical presentations (<50% recognition for most non-GI symptoms), and test at dramatically low rates (8.6–61%)","Serology failure: IgA-tTG2 sensitivity for Marsh 3A is ~42% (Abrams 2006); DQ8 associated with lower antibody titers; complete seronegativity eliminates the standard diagnostic gateway","IgG backup failure: Low IgG1 subclass compromises IgG-based tests (anti-DGP IgG, tTG2-IgG) that guidelines recommend for IgA-deficient patients; sequential IgM→IgG1→IgA class switching (Siniscalco 2025) means IgG1 deficiency independently impairs mucosal IgA production","Biopsy failure: Even if endoscopy performed for another indication, Marsh 3A may be subtle and missed without oriented, well-fixed biopsies read by expert pathologist; without positive serology, seronegative villous atrophy triggers a broad differential (giardiasis, CVID, drug-induced enteropathy)","Demographic compounding: If this patient is female (50% longer delay), non-White (OR 0.55 for biopsy), or elderly (OR 0.51 for biopsy), each barrier is amplified"],"estimated_probability_of_correct_diagnosis":"<2–5% through standard care pathways","what_would_be_needed":"Either (1) routine duodenal biopsy during endoscopy for ANY compatible indication regardless of serology, or (2) EHR-flagging of persistent symptoms after negative serology, combined with HLA typing + GFD response trial + follow-up biopsy — a pathway few clinicians currently pursue"},"counterarguments_and_null_hypothesis":{"strongest_counterargument":"For patients with Marsh 3b/3c (the most clinically severe villous atrophy), IgA-tTG2 sensitivity approaches 90–100%, capturing the majority of high-risk patients. Universal biopsy would be prohibitively expensive. The no-biopsy pathway (tTG2 ≥10× ULN) has PPV >95%. Current ACG 2023 guidelines include an escape clause recommending biopsy when clinical suspicion is high despite negative serology. Seronegative CD may represent a different clinical entity with different (possibly milder) natural history.","why_counterargument_is_insufficient":"The 'high suspicion despite negative serology' escape clause is operationally circular — in standard clinical workflows, suspicion depends on serology results. The escape clause exists on paper but is never triggered in practice because negative serology terminates investigation. Even accepting optimistic sensitivity estimates for severe disease, the current system diagnoses only ~17% of US CD cases (Rubio-Tapia et al. 2012) — a number that cannot be explained by test sensitivity alone and requires recognizing that the dominant barrier is failure to test in the first place. Finland's experience — the best in the world — still leaves 65–70% undiagnosed.","could_conventional_view_be_approximately_correct":"Partially. For highly symptomatic patients with severe villous atrophy and DQ2.5 genotype, the current diagnostic pathway is reasonably effective when serology IS ordered. The conventional view is approximately correct for this subgroup. The conventional view is NOT approximately correct for the population-level question of how many CD patients are identified, for patients with partial villous atrophy, for non-DQ2.5 genotypes, or for any demographic group subject to testing bias."},"meta_analysis_summary":{"studies_reviewed":60,"total_patients":null,"pooled_estimates":{"physicians_perceiving_CD_rare":"69.9%","physician_knowledge_score_mean":"50–52%","IDA_CD_prevalence_pooled":"3.2% (95% CI 2.6–3.9%)","hematologist_IDA_screening_endorsement":"8.6%","PCP_IDA_testing_rates":"18–61% depending on demographics","diagnostic_delay_range":"5–12 years across countries","IBS_prior_misdiagnosis_rate":"25%","osteoporosis_HR_in_CD":"5.39 (95% CI 4.89–5.95)","T_cell_lymphoma_OR":"15.84 (95% CI 7.85–31.94)","autoimmune_prevalence_by_age_at_diagnosis":"5.1% (<2y) to 23.6% (>10y)","verification_bias_adjusted_tTG2_sensitivity":"57.1% (95% CI 35.4–76.4%)","tTG2_sensitivity_partial_villous_atrophy":"42.3% (Abrams 2006)","lab_to_lab_tTG2_variability":"40–86.4% (P<.0001)","Finland_detection_rate":"~35% of true prevalence","case_finding_increase":"43-fold (Catassi 2007)","cost_effectiveness_ICER":"€3,603–3,841/QALY"},"heterogeneity_notes":"Physician awareness data remarkably consistent across countries (US, Romania, Central Europe) and time periods (2005–2024), suggesting a persistent structural rather than transient knowledge gap. Diagnostic delay data consistent across 6 countries. Complication risk data drawn from large nationwide cohorts with consistent direction of effect. Italian screening data still emerging. All findings subject to the caveat that pre-serology patient loss is unmeasured and likely larger than any downstream diagnostic sensitivity problem. Key limitation: most evidence on seronegative CD prevalence and serology sensitivity for Marsh 3A comes from single-center or small-sample studies requiring replication."}}
