{"research_topic_id":"4.2","research_topic_title":"Diagnostic Cascade Losses at the Endoscopy Stage","date_completed":"2026-02-08","version":"2.0 (post-peer-review)","executive_summary":"The endoscopy stage is the single largest quantifiable bottleneck in the CD diagnostic cascade. Duodenal biopsy rates during EGD for CD-relevant indications range from 11–57% (community to academic center), and when biopsies are taken, only 35–40% meet the ≥4 specimen guideline threshold. Compound cascade probability — accounting for non-referral, non-biopsy, inadequate sampling, and pathology error — is estimated at ~15% for seropositive and <7% for seronegative Marsh 3a patients in routine community practice. For the reference patient (DQ8, Marsh 3A, all serology <1, low IgG1, low secretory IgA), estimated detection probability under current practice is <5%.","key_findings":[{"finding_id":"4.2.1","finding":"Duodenal biopsy is performed in only a minority of EGDs for CD-relevant indications (anemia, weight loss, diarrhea, iron deficiency). CORI database: 11% (2000–2003), rising to 43% (2004–2009). Columbia academic center: 57%. Provider-level range at single institution: 27–91%.","evidence_strength":"strong","quantitative_estimate":"11–57% biopsy rate depending on era and setting","confidence_interval":null,"key_citations":["PMID: 15330920","PMID: 22732871","PMID: 29095420"],"contradicts_guidelines":true,"affected_patient_population":"All symptomatic patients at risk of undiagnosed CD, especially seronegative cases with Marsh 3A"},{"finding_id":"4.2.2","finding":"Incomplete biopsy confirmation after positive IgA-tTG2 serology. Only 39% (Cleveland Clinic) to 72% (UK primary care) of seropositive adults complete duodenal biopsy. Meta-analytic data: approximately one-third of seropositive patients are never referred from primary care.","evidence_strength":"strong","quantitative_estimate":"39–72% completion rate; 28–61% non-completion","confidence_interval":null,"key_citations":["PMID: 23305824","PMID: 38176661"],"contradicts_guidelines":true,"affected_patient_population":"Seropositive patients denied histologic confirmation or risk stratification"},{"finding_id":"4.2.3","finding":"Guideline-recommended sampling (≥4 specimens) achieved in only 35–40% of duodenal biopsies. CD detection rate doubles with adherence (1.8% vs 0.7% US; 10.1% vs 4.6% UK).","evidence_strength":"strong","quantitative_estimate":"35–40% adherence; 2× detection improvement","confidence_interval":null,"key_citations":["PMID: 21601201","PMID: 33455912"],"contradicts_guidelines":true,"affected_patient_population":"All patients reaching biopsy stage; Marsh 3a most vulnerable to undersampling"},{"finding_id":"4.2.4","finding":"Normal-appearing mucosa in ~61% of diagnosed CD; endoscopic marker sensitivity only 59% (not stratified by Marsh grade; likely 20–40% for Marsh 3a). EMA sensitivity only 33% in partial villous atrophy vs 77% in total VA.","evidence_strength":"strong","quantitative_estimate":"59% overall visual sensitivity; 33% EMA sensitivity in partial VA","confidence_interval":null,"key_citations":["PMID: 12003429","PMID: 15185855","PMID: 29095420"],"contradicts_guidelines":true,"affected_patient_population":"Marsh 3a patients, especially seronegative — simultaneously visually and serologically cryptic"},{"finding_id":"4.2.5","finding":"IgG1 deficiency impairs mucosal IgA production via sequential IgM→IgG1→IgA class switching (Siniscalco 2025), providing a mechanistic explanation for false-negative IgA-tTG2 independent of HLA and distinct from selective IgA deficiency. Not detected by total IgA measurement.","evidence_strength":"emerging","quantitative_estimate":null,"confidence_interval":null,"key_citations":["Siniscalco et al., Immunity, 2025"],"contradicts_guidelines":false,"affected_patient_population":"Patients with IgG1 subclass deficiency; directly applicable to the reference patient profile"},{"finding_id":"4.2.6","finding":"Compound cascade probability at the endoscopy stage: ~15% for seropositive patients (all Marsh grades); ~7% for seronegative Marsh 3a in community practice; <5% for the reference patient profile.","evidence_strength":"moderate","quantitative_estimate":"15% seropositive; 7% seronegative Marsh 3a; <5% reference patient","confidence_interval":"Range 5–35% depending on practice setting (expert center vs community)","key_citations":["Derived from PMID: 15330920","PMID: 22732871","PMID: 21601201","PMID: 33455912","PMID: 12003429"],"contradicts_guidelines":false,"affected_patient_population":"All CD patients traversing the endoscopy stage"},{"finding_id":"4.2.7","finding":"No-biopsy pathway (tTG-IgA ≥10×ULN) has 98.7% PPV but only 51% sensitivity — roughly half of adult CD patients are eligible, not 30% as previously misstated. The pathway cannot detect seronegative CD by definition. Enache et al. 2025 follow-up showed worse outcomes in no-biopsy diagnosed children.","evidence_strength":"strong","quantitative_estimate":"51% sensitivity (95% CI 42–60%); 98.7–100% PPV; 0% sensitivity for SNCD","confidence_interval":"95% CI 42–60% for sensitivity (Shiha 2024)","key_citations":["PMID: 38176661","PMID: 33139268","PMID: 40181998"],"contradicts_guidelines":true,"affected_patient_population":"~49% of CD patients with tTG-IgA <10×ULN who still need biopsy; all SNCD patients"},{"finding_id":"4.2.8","finding":"Diagnostic yield justifies automatic biopsy for IDA (3.2–5.5%), chronic diarrhea (8.5%), and especially their combination (19%), all above the 1.8% cost-effectiveness threshold. Dyspepsia/GERD (1.25–2%) is borderline. Unselected EGD (0.5–2%) falls below threshold.","evidence_strength":"strong","quantitative_estimate":"IDA 3.2% (95% CI 2.6–3.9%); diarrhea 8.5%; IDA+diarrhea 19%; dyspepsia 1.25–2%","confidence_interval":"IDA: 95% CI 2.6–3.9% (Mahadev 2018)","key_citations":["PMID: 29689265","PMID: 25818076"],"contradicts_guidelines":false,"affected_patient_population":"All patients undergoing EGD for these indications"},{"finding_id":"4.2.9","finding":"Significant racial, age, and provider-type disparities in biopsy performance. Black patients OR 0.55; age ≥70 OR 0.51; surgeon endoscopists 18.2% adherence vs nurse endoscopists 51.2%.","evidence_strength":"strong","quantitative_estimate":"Black 28% vs White 44%; ≥70yo 33% vs <50yo 54%","confidence_interval":"OR 0.55 (95% CI 0.48–0.64) for Black patients","key_citations":["PMID: 22732871","PMID: 33455912"],"contradicts_guidelines":true,"affected_patient_population":"Black patients, elderly patients, patients seen by non-gastroenterologist endoscopists"},{"finding_id":"4.2.10","finding":"QI interventions dramatically improve outcomes: EHR checklists raised adherence from 13.3% to 69.5%; education raised ≥4-specimen rates from 21.9% to 60.8% with CD detection doubling. Finland national case-finding achieved world's highest diagnosed CD prevalence (0.55%).","evidence_strength":"strong","quantitative_estimate":"13.3%→69.5% (EHR); 21.9%→60.8% (education); Finland 0.55% prevalence","confidence_interval":null,"key_citations":["PMID: 19492246"],"contradicts_guidelines":false,"affected_patient_population":"System-level improvement affecting all patients"},{"finding_id":"4.2.11","finding":"The commonly cited 2% seronegative CD prevalence is almost certainly a profound underestimate. Hujoel showed only 3.6% of seronegative patients are biopsied vs 79.2% of seropositive. Adjusted IgA-tTG2 sensitivity drops from 92.6% to 57%, implying 43% of CD patients may test seronegative.","evidence_strength":"moderate","quantitative_estimate":"Reported 2% SNCD; adjusted model implies 10–43% depending on severity distribution","confidence_interval":"Adjusted sensitivity 57% (95% CI 35.4–76.4%)","key_citations":["PMID: 32433257"],"contradicts_guidelines":true,"affected_patient_population":"All seronegative CD patients; the 2% figure is from verification-biased cohorts"}],"biases_documented":[{"bias_type":"verification bias","description":"Most CD prevalence and phenotype studies only include biopsied patients. Only 3.6% of seronegative patients are ever biopsied (Hujoel), meaning the seronegative CD prevalence estimate of '2%' is derived from a 96.4% unsampled denominator — at minimum a 25-fold undersampling relative to seropositive patients.","magnitude_estimate":"25-fold differential biopsy rate; adjusted IgA-tTG2 sensitivity drops from 92.6% to 57%","evidence_sources":["PMID: 32433257","PMID: 15330920","PMID: 22732871"]},{"bias_type":"visual-assessment feedback loop","description":"Endoscopists who biopsy only abnormal-appearing mucosa will diagnose CD only in the ~39% with visible markers, underestimating CD prevalence. This reinforces the belief that routine biopsy has low yield, perpetuating non-biopsy. Self-sustaining bias that cannot be broken without protocol-mandated biopsy.","magnitude_estimate":"41% of CD cases (61% normal-appearing mucosa) systematically missed by appearance-dependent practice","evidence_sources":["PMID: 12003429","PMID: 29095420"]},{"bias_type":"center/publication bias","description":"Core data from Columbia (57% biopsy rate) and Sheffield represent academic CD centers; community practice rates are likely 20–35%. CORI data (11–43%) better represents routine care.","magnitude_estimate":"Community biopsy rates likely 20–35% vs academic 50–60%","evidence_sources":["PMID: 15330920","PMID: 29095420"]},{"bias_type":"temporal bias","description":"Core datasets are 10–20 years old (CORI 2000–2009; Columbia 2007–2011). Post-2020 practice may differ due to guideline awareness, no-biopsy adoption, and COVID-era changes. No comprehensive post-2020 update exists.","magnitude_estimate":"Unknown direction of change; some QI data suggests improvement, no-biopsy adoption may paradoxically reduce referral for borderline cases","evidence_sources":["PMID: 15330920","PMID: 22732871","PMID: 33455912"]},{"bias_type":"survivorship bias in QI intervention data","description":"QI studies (Barnsley, pediatric EHR) represent motivated centers that chose to implement changes. Hawthorne effects and regression to mean may inflate effect sizes. Real-world scalability uncertain.","magnitude_estimate":"Intervention effectiveness likely lower in routine implementation than in reported QI studies","evidence_sources":["PMID: 33455912"]}],"unproven_assumptions_identified":[{"assumption":"The 2% seronegative CD prevalence is approximately correct","evidence_against":"Derived from serology-first cohorts where 96.4% of seronegative patients are never biopsied (Hujoel). Adjusted sensitivity of 57% implies 43% of CD patients may test negative. The '2%' reflects the tiny biopsied fraction, not the true population.","evidence_for":"The 2% figure is consistent across multiple cohorts. Some serology-independent screening studies also report low SNCD rates, though these used older histological criteria.","clinical_impact":"If true SNCD is 10–20% rather than 2%, the number of patients who can ONLY be diagnosed via indication-based biopsy is 5–10× larger than assumed, making the 43–57% biopsy gap far more consequential."},{"assumption":"Visual endoscopic inspection has approximately known sensitivity for CD detection","evidence_against":"Oxentenko's 59% was not stratified by Marsh grade. Marsh 3a-specific visual sensitivity is likely 20–40%. No study has reported Marsh-grade-stratified endoscopic marker sensitivity.","evidence_for":"The 59% figure is consistent across studies (50–78% range) for mixed Marsh-grade cohorts.","clinical_impact":"If Marsh 3a-specific visual sensitivity is 20–30% rather than 59%, the biopsy-omission rate for 3a cases is even higher than aggregate data suggest."},{"assumption":"No-biopsy pathways will reduce the non-referral problem rather than exacerbate it","evidence_against":"Enache 2025 showed worse outcomes in no-biopsy patients. Non-gastroenterologists may misinterpret 'no-biopsy pathway' as 'no referral needed.' Johnston (PMID 34966534) warned against applying NBP to any tTG positivity rather than high-titre only.","evidence_for":"ProCeDE and Bi.A.CeD demonstrate high PPV when criteria strictly applied; may reduce endoscopy burden.","clinical_impact":"Risk that NBP adoption widens the gap for the ~49% of CD patients with tTG2 <10×ULN who still require histological confirmation."},{"assumption":"Routine biopsy for all CD-relevant indications is clearly justified","evidence_against":"Cost-effectiveness threshold of 1.8% not met for dyspepsia/GERD (1.25–2%) or unselected EGD (0.5–2%). Universal mandates increase pathology workload substantially for low-yield indications.","evidence_for":"IDA (3.2–5.5%), chronic diarrhea (8.5%), and their combination (19%) clearly exceed threshold. These account for the majority of CD-relevant EGDs.","clinical_impact":"Overstating case for universal biopsy may reduce credibility with guideline committees; stratified recommendations are more defensible."}],"overlooked_populations":[{"population":"Seronegative CD patients with Marsh 3a undergoing EGD for relevant indications but not biopsied","estimated_size":"Unknown; if SNCD is 10–20% of true CD and indication-based biopsy rate is ~30% (community), roughly 7–14% of total CD population in this blind spot","why_missed":"Triple invisibility: no serological flag, normal endoscopic appearance, low clinical suspicion. Additional mechanism: IgG1 deficiency → impaired IgA via Siniscalco pathway","proposed_solution":"Automatic duodenal biopsy protocols for IDA, chronic diarrhea, weight loss regardless of serology or appearance"},{"population":"Patients with positive serology who never complete biopsy","estimated_size":"28–61% of seropositive cases","why_missed":"Non-referral from primary care, endoscopist omission, patient refusal (~49% in screening; lower in symptomatic), premature GFD, endoscopy wait times (48.5 vs 34.5 days)","proposed_solution":"Systematic referral pathways; expanded no-biopsy criteria for high-titre; counseling against pre-biopsy GFD; reduced wait times"},{"population":"DQ8-only CD patients","estimated_size":"5–10% of CD; no endoscopy-stage study stratifies by HLA genotype","why_missed":"HLA genotyping not routine at endoscopy stage; DQ8 may associate with different Marsh distributions and serology levels","proposed_solution":"HLA-stratified subgroup analysis in biopsy completion and adequacy studies"},{"population":"Patients with IgG subclass deficiency causing false-negative serology via Siniscalco pathway","estimated_size":"Unknown; IgG1 deficiency prevalence 2–5% in general population, overlap with CD unknown","why_missed":"Mechanism published 2025; not yet integrated into CD diagnostic algorithms","proposed_solution":"IgG subclass measurement when serology negative but clinical suspicion persists; lower biopsy threshold for these patients"}],"diagnostic_step_sensitivity":{"step_name":"Endoscopy stage overall (referral → biopsy decision → adequate specimens → correct pathology)","reported_sensitivity":"Not reported as compound figure in any published study","adjusted_sensitivity":"Compound estimate: ~15% seropositive all Marsh grades; ~14% seropositive Marsh 3a; ~7% seronegative Marsh 3a (community); <5% reference patient profile","false_negative_rate":"NOTE: Two distinct failure modes must be separated. (1) NON-PERFORMANCE RATE (patient never biopsied): 28–61% seropositive; 43–89% indication-based; >96% seronegative. (2) TECHNICAL FALSE-NEGATIVE RATE (biopsy performed but diagnosis missed): estimated 15–25% from inadequate specimens (<4), poor orientation, and pathologist inter-observer variability (κ=0.35 Marsh-Oberhuber; κ=0.53 for Marsh 3a)","key_limitations":["Non-referral after positive serology (28–61%)","Non-biopsy during EGD for relevant indications (43–89%)","Inadequate specimen count (only 35% meet ≥4 threshold)","Duodenal bulb omission (incremental 5% yield lost)","Poor specimen orientation (~10% inadequacy rate)","Pathologist inter-observer disagreement (κ=0.35–0.53 depending on classification)","Premature GFD initiation before biopsy (negative correlation wait time ↔ Marsh grade)","No HLA genotype stratification available for any sub-step","All core data 10–20 years old; post-2020 update needed"]},"contradictory_studies":[{"citation":"Penny et al. 2021 (Gut); Shiha et al. 2024 (Gastroenterology)","pmid":"33139268; 38176661","finding":"PPV 98.7–100% for tTG-IgA ≥10×ULN supporting no-biopsy pathway in adults","contradicts":"Current adult guidelines requiring biopsy for most cases. However, sensitivity only 51% — pathway misses ~49% of CD patients who need biopsy"},{"citation":"Enache et al. 2025 (Frontiers in Pediatrics)","pmid":"40181998","finding":"8–10 year follow-up showed worse mucosal healing and dietary compliance in no-biopsy diagnosed children vs biopsy-diagnosed","contradicts":"Assumption that no-biopsy diagnosis produces equivalent long-term outcomes"},{"citation":"Yang & Lebwohl 2015 (Clin Gastroenterol Hepatol)","pmid":"25818076","finding":"Routine biopsy NOT cost-effective at base-case CD prevalence of 1% in GERD; becomes cost-effective at ≥1.8% prevalence","contradicts":"Universal mandatory biopsy recommendations for all indications (supports stratified approach)"}],"research_gaps":[{"gap":"No study has computed compound probability of correct CD diagnosis across ALL endoscopy sub-steps for a single patient traversal","importance":"high","proposed_study_design":"Integrated health system study tracking patients from referral through pathology report, documenting failure at each sub-step"},{"gap":"No Marsh-grade-stratified endoscopic marker sensitivity data (Marsh 3a vs 3b/3c)","importance":"high","proposed_study_design":"Prospective study correlating white-light endoscopy findings with Marsh grade, stratifying visual detection sensitivity by histological severity"},{"gap":"No HLA-genotype-stratified biopsy completion or adequacy data","importance":"medium","proposed_study_design":"Retrospective cohort linking HLA genotyping results to endoscopy/biopsy outcomes"},{"gap":"Impact of IgG subclass deficiency on serology-to-biopsy cascade (Siniscalco mechanism)","importance":"high","proposed_study_design":"Prospective cohort measuring IgG subclasses alongside IgA-tTG2 and DGP-IgG in patients biopsied for CD-relevant indications regardless of serology result"},{"gap":"Post-2020 endoscopy-stage completion rates reflecting no-biopsy pathway adoption and COVID-era changes","importance":"high","proposed_study_design":"Multicenter registry or national database study (2020–2025) comparing pre/post no-biopsy guideline adoption"},{"gap":"Prospective studies using serology- and appearance-independent systematic biopsy to establish unbiased SNCD prevalence","importance":"high","proposed_study_design":"Multicenter mandatory biopsy in all EGDs for IDA/diarrhea/weight loss with central pathology review"},{"gap":"True diagnostic sensitivity of duodenal biopsy specifically for Marsh 3a, accounting for specimen count, orientation, and pathologist variability","importance":"high","proposed_study_design":"Multi-pathologist re-read study of standardized Marsh 3a biopsies with varying specimen counts and orientation quality"},{"gap":"Feasibility and unintended consequences of 'duodenal biopsy rate' quality metric (pathology burden, cost per diagnosis by indication)","importance":"medium","proposed_study_design":"Pilot implementation at multiple centers measuring biopsy rate, workload impact, CD yield by indication, and cost"}],"differential_diagnoses_relevant":[{"condition":"Drug-induced enteropathy (olmesartan, mycophenolate, others)","overlap_with_cd":"Villous atrophy, symptoms of malabsorption, iron deficiency","distinguishing_features":"Medication history, resolution on drug cessation, negative celiac serology (though seronegative CD also has this)"},{"condition":"Common variable immunodeficiency (CVID) enteropathy","overlap_with_cd":"Villous atrophy, chronic diarrhea, malabsorption; may have low IgA and IgG subclasses similar to reference patient","distinguishing_features":"Recurrent sinopulmonary infections, low total immunoglobulins, absent plasma cells on biopsy; CD and CVID can coexist"},{"condition":"Selective IgA deficiency-associated CD","overlap_with_cd":"False-negative IgA-tTG2 by definition (total IgA <7 mg/dL); 2–8% of CD patients","distinguishing_features":"Total serum IgA <7 mg/dL; guidelines recommend IgG-based testing (DGP-IgG, tTG-IgG) but these have lower sensitivity"},{"condition":"Autoimmune enteropathy","overlap_with_cd":"Severe villous atrophy, diarrhea, malabsorption","distinguishing_features":"Anti-enterocyte antibodies, typically refractory to GFD, extra-intestinal autoimmune features"},{"condition":"Tropical sprue, SIBO","overlap_with_cd":"Chronic diarrhea, weight loss, potential villous changes","distinguishing_features":"Travel history, response to antibiotics, different histological pattern"}],"recommendations":[{"recommendation":"Implement automatic duodenal biopsy protocols stratified by indication: MANDATORY for IDA, chronic diarrhea, and IDA+diarrhea (yield 3.2–19%, all above 1.8% cost-effectiveness threshold); RECOMMENDED for unexplained weight loss; DISCRETIONARY for dyspepsia/GERD (borderline cost-effective at 1.25–2%)","target":"guidelines (ACG, BSG, ESGE), endoscopy units, quality programs","evidence_basis":"Mahadev 2018 (PMID 29689265) meta-analysis; Yang & Lebwohl 2015 (PMID 25818076) cost-effectiveness threshold"},{"recommendation":"Establish 'Duodenal Biopsy Rate for CD-Relevant Indications' quality metric analogous to colonoscopy's adenoma detection rate, tracking the decision to biopsy (not just specimen count)","target":"ASGE/ACG quality committees","evidence_basis":"27–91% provider variation (PMID 29095420); no existing metric for biopsy decision"},{"recommendation":"Frame all seronegative CD prevalence estimates as lower bounds due to verification bias. The 2% figure is derived from cohorts where 96.4% of seronegative patients are never biopsied.","target":"researchers, guideline authors","evidence_basis":"Hujoel et al. (PMID 32433257): differential biopsy rate creates 25× undersampling of seronegative patients"},{"recommendation":"Screen for IgG subclasses when IgA-tTG2 is negative but clinical suspicion persists, based on Siniscalco 2025 mechanism showing IgG1 deficiency impairs mucosal IgA production independently","target":"clinicians, diagnostic algorithm designers","evidence_basis":"Siniscalco et al. Immunity 2025; applies directly to reference patient profile"},{"recommendation":"Qualify no-biopsy pathway endorsement with Enache 2025 follow-up data showing worse long-term outcomes, and emphasize that NBP cannot detect seronegative CD (~49% of CD patients have tTG-IgA <10×ULN per Shiha sensitivity data)","target":"guidelines, clinicians","evidence_basis":"PMID 40181998; PMID 38176661 (sensitivity 51%)"},{"recommendation":"Require HLA-stratified subgroup reporting in future biopsy completion and adequacy studies to assess whether DQ8 patients have different outcomes","target":"researchers, journal editors","evidence_basis":"No existing HLA-stratified endoscopy-stage data despite known phenotypic differences"},{"recommendation":"Strong counseling against gluten-free diet initiation before diagnostic completion; reduce EGD wait times to <30 days for CD-relevant indications (current median 48.5 days)","target":"clinicians, healthcare system administrators","evidence_basis":"Negative correlation between wait time and Marsh grade at biopsy (PMID 33455912)"}],"meta_analysis_summary":{"studies_reviewed":28,"total_patients":null,"pooled_estimates":{"biopsy_rate_range":"11–57% for CD-relevant indications","specimen_adequacy":"35–40% meet ≥4 threshold","seropositive_completion":"39–72%","IDA_CD_prevalence":"3.2% (95% CI 2.6–3.9%); 5.5% in high-quality studies","no_biopsy_sensitivity":"51% (95% CI 42–60%)","no_biopsy_PPV":"95–99% depending on pretest probability","compound_cascade_seropositive":"~15%","compound_cascade_seronegative_marsh3a":"~7%","compound_cascade_reference_patient":"<5%"},"heterogeneity_notes":"Significant variation by country (US vs UK vs Finland), era (2000–2009 vs 2010–2020), setting (academic CD center vs community), and indication. US CORI database studies dominate quantitative estimates; UK multicentre data provides QI intervention evidence. No comprehensive post-2020 data available. Expert center data (Columbia, Sheffield) likely overestimate community practice."}}
