{"research_topic_id":"5.1","research_topic_title":"Challenging the Claimed 95%+ Sensitivity of IgA-tTG2 in Celiac Disease Diagnosis","date_completed":"2026-02-08","executive_summary":"The 95-97% IgA-tTG2 sensitivity cited in guidelines originates from a 2005 subset analysis of only 3 human-recombinant tTG studies (Rostom, PMID:15825125), propagated through citation chains without independent verification. Rigorous meta-analyses show adult sensitivity of 90.7% (87.3-93.2%) unadjusted (Sheppard 2022, PMID:35043426), and 57.1% (35.4-76.4%) after verification bias correction (Hujoel 2021, PMID:32433257). The sole large biopsy-all study found 90.9% in symptomatic adults (Hopper 2008, PMID:18328437). Sensitivity drops to 0-42% for Marsh 3a, varies 40-96% between commercial labs, and may be particularly unreliable in Black Americans (80% seronegative per Cartee 2024). This overestimation creates false reassurance from negative tests and systematically misses patients with the reference profile (DQ8, Marsh 3A, low IgG1, low sIgA).","key_findings":[{"finding_id":"5.1.1","finding":"The 95-97% sensitivity claim traces to Rostom 2005's human recombinant tTG subset analysis (3 studies, 98.1%, CI: 90.1-99.7%). The same review found only 90.2% for guinea pig tTG (5 studies). Guidelines selectively cited the higher figure, and the citation chain (Rostom 2005 → AGA 2006 → ACG 2013 → clinical teaching) propagated it without re-evaluation. Rostom himself noted sensitivity falls below 90% with milder histologic grades.","evidence_strength":"strong","quantitative_estimate":"98.1% from 3 studies became 95% in guidelines; 90.2% from 5 studies was de-emphasized","confidence_interval":"HR-tTG: 90.1-99.7%; GP-tTG: 85.9-93.4%","key_citations":["PMID:15825125"],"contradicts_guidelines":true,"affected_patient_population":"All adults undergoing CD evaluation"},{"finding_id":"5.1.2","finding":"The most rigorous recent meta-analysis (Sheppard et al. 2022, Cochrane DTA methodology, excluded case-control designs) found adult IgA-tTG2 sensitivity of 90.7%, nearly 5 percentage points below guideline claims. Pediatric sensitivity was 97.7%, confirming the inappropriateness of extrapolating pediatric data to adults.","evidence_strength":"strong","quantitative_estimate":"Adults: 90.7%; Children: 97.7%","confidence_interval":"Adults: 87.3-93.2%; Children: 91.0-99.4%","key_citations":["PMID:35043426"],"contradicts_guidelines":true,"affected_patient_population":"Adults with suspected CD; ~7 percentage point gap from pediatric data"},{"finding_id":"5.1.3","finding":"Verification bias profoundly distorts sensitivity estimates. Only 3.6% of tTG-negative vs 79.2% of tTG-positive patients receive biopsy (22-fold differential). After Begg & Greenes correction, sensitivity drops from 92.6% to 57.1%. The 57% figure has limitations (wide CI, unstable math, violated assumptions), but the direction of bias is unambiguous. Hopper's biopsy-all study (90.9%) provides the best single bias-free reference point.","evidence_strength":"strong","quantitative_estimate":"57.1% bias-corrected; 90.9% biopsy-all","confidence_interval":"Hujoel: 35.4-76.4%; Hopper: point estimate from n=2000","key_citations":["PMID:32433257","PMID:18328437"],"contradicts_guidelines":true,"affected_patient_population":"All patients where negative tTG is used to 'exclude' CD"},{"finding_id":"5.1.4","finding":"Marsh grade is the dominant sensitivity determinant. Abrams 2004 (strict criteria, n=115): ALL tTG-positive patients had TVA; 0% PVA sensitivity. Abrams 2006 (clinical practice, n=122): 90.0% TVA vs 42.3% PVA (P<0.0001). The 0-42% range from the SAME research group for Marsh 3a demonstrates profound instability of this estimate. Tursi 2003: 7.69% Marsh I positivity, mean tTG 3.61 vs 74.95 UA/mL for Marsh IIIc. Singh 2015: mean tTG fold-rise 2.6× (Marsh ≤2) → 4.0× (3a) → 11.8× (3c); 43.9% of patients with <2-fold elevation had CD.","evidence_strength":"strong","quantitative_estimate":"Marsh 3a: 0-42% (assay-dependent); Marsh 3c: 95-100%; Marsh I: ~8%; 43.9% of low-titer patients had confirmed CD","confidence_interval":null,"key_citations":["PMID:15185855","PMID:16630760","PMID:12590232","PMID:24583754"],"contradicts_guidelines":true,"affected_patient_population":"Marsh 3a patients — the exact population of the reference patient"},{"finding_id":"5.1.5","finding":"Inter-laboratory variation in tTG sensitivity is alarming and clinically unacceptable. Abrams 2006 found 40.0% vs 86.4% between two major US commercial labs using the same samples (P<0.0001). Naiyer 2009 found sensitivities from 71.4% to 96.4% across four kits. Li et al. 2009 (International Transglutaminase Autoantibody Workshop) found sensitivity 69-93% across 20 laboratories with inter-lab ELISA r² as low as 0.4244. A clinician ordering 'IgA-tTG' at different labs may unknowingly receive results from assays differing by 25+ percentage points.","evidence_strength":"strong","quantitative_estimate":"40-96% range between commercial labs/kits; 69-93% across 20 international labs","confidence_interval":null,"key_citations":["PMID:16630760","PMID:18724250","PMID:19098864"],"contradicts_guidelines":true,"affected_patient_population":"All patients tested — particularly those near diagnostic thresholds"},{"finding_id":"5.1.6","finding":"Seronegative CD has significantly worse outcomes than seropositive CD. In a 20-year multicenter study (Schiepatti 2021), true SNCD carried HR 10.87 for complications and HR 2.18 for mortality versus seropositive CD. The Paris Consensus (Schiepatti 2022) formalized diagnostic criteria to distinguish SNCD from non-coeliac enteropathies.","evidence_strength":"strong","quantitative_estimate":"HR 10.87 complications (6.11-19.33); HR 2.18 mortality (1.12-4.26)","confidence_interval":"See quantitative_estimate","key_citations":["PMID:34496060","PMID:35676085"],"contradicts_guidelines":true,"affected_patient_population":"Seronegative CD patients (1.7-6.4% strict; likely higher with full verification)"},{"finding_id":"5.1.7","finding":"Emerging evidence of racial disparities in tTG sensitivity. Cartee 2024: 80% of Black patients with biopsy-confirmed CD had tTG below upper limit of normal, vs ~9% of non-Hispanic White patients. Current cutoff values may be fundamentally inappropriate for non-White populations. Serologic screening studies reinforce false belief that CD is rare in Black Americans.","evidence_strength":"moderate","quantitative_estimate":"80% below ULN in Black vs ~9% in White biopsy-confirmed CD","confidence_interval":null,"key_citations":["DOI:10.1016/j.gastha.2023.08.014"],"contradicts_guidelines":true,"affected_patient_population":"Black Americans with celiac disease"},{"finding_id":"5.1.8","finding":"ESPGHAN 2020 is the only major guideline to explicitly refuse to cite a sensitivity figure for case-finding, correctly stating that verification bias prevents valid sensitivity calculation. ESsCD 2025 is the first guideline to formally lower its estimate to 90.7%. ACG 2023 acknowledges verification bias and 63-93% lab range but still leads with ~95%.","evidence_strength":"strong","quantitative_estimate":null,"confidence_interval":null,"key_citations":["ESPGHAN 2020","ESsCD 2025 (Al-Toma)","ACG 2023 (Rubio-Tapia)"],"contradicts_guidelines":false,"affected_patient_population":"All patients evaluated under these guidelines"},{"finding_id":"5.1.9","finding":"The reference patient profile (DQ8, Marsh 3A, all serology <1, low IgG1, low secretory IgA) represents a convergence of every factor favoring seronegativity. DQ8 has lower gene-dose antibody production than DQ2.5, Marsh 3a has 0-42% sensitivity, low IgG1 impairs sequential IgM→IgG1→IgA class switching (Siniscalco 2025), and low sIgA reflects mucosal immune compartment dysfunction. This patient would be classified as 'CD unlikely' under standard algorithms.","evidence_strength":"moderate","quantitative_estimate":null,"confidence_interval":null,"key_citations":["PMID:15185855","PMID:16630760"],"contradicts_guidelines":true,"affected_patient_population":"DQ8 carriers with mild VA and low mucosal immunity"}],"biases_documented":[{"bias_type":"verification bias (work-up bias)","description":"Only 3.6% of tTG-negative vs 79.2% of tTG-positive patients receive confirmatory biopsy (22-fold differential). Seronegative CD cases never diagnosed → never appear as false negatives → sensitivity inflated. Direction of bias is unambiguous; magnitude is debated (corrected sensitivity 57.1%, CI 35.4-76.4%).","magnitude_estimate":"Reduces sensitivity from ~93% to ~57% (Hujoel correction) or to ~91% (Hopper biopsy-all). True magnitude likely between these extremes.","evidence_sources":["PMID:32433257 (Hujoel 2021)","PMID:18328437 (Hopper 2008)"]},{"bias_type":"spectrum bias (case severity enrichment)","description":"Studies over-represent severe Marsh 3b/3c cases from referral centers. Since tTG sensitivity correlates linearly with mucosal damage severity (3.61 UA/mL Marsh I → 74.95 UA/mL Marsh IIIc), inclusion of predominantly severe cases inflates apparent sensitivity. This is compounded by case-control designs comparing confirmed CD against healthy controls.","magnitude_estimate":"Marsh 3c: 95-100% sensitivity; Marsh 3a: 0-42%; difference of 50-100 percentage points","evidence_sources":["PMID:15185855 (Abrams 2004)","PMID:16630760 (Abrams 2006)","PMID:12590232 (Tursi 2003)"]},{"bias_type":"citation propagation bias","description":"Each successive guideline cited the previous guideline rather than independently evaluating primary studies. The 98.1% from 3 HR-tTG studies became ~95% in AGA 2006, was cited by ACG 2013, and entered clinical teaching as established fact. Caveats about milder grades (sensitivity <90%) were dropped from successive citations.","magnitude_estimate":"5-8 percentage point overestimate in adult sensitivity vs best available evidence","evidence_sources":["PMID:15825125 (Rostom 2005)","PMID:35043426 (Sheppard 2022)"]},{"bias_type":"assay variation bias","description":"Inter-laboratory and inter-kit sensitivity variation (40-96%) is not captured by pooled estimates. A single pooled sensitivity figure obscures the clinical reality that tTG performance depends heavily on which commercial kit and laboratory performs the test. International workshop with 20 labs showed r² as low as 0.4244 for ELISA correlation.","magnitude_estimate":"25-56 percentage point range between labs (40% vs 96%); 69-93% across 20 international labs","evidence_sources":["PMID:16630760 (Abrams 2006)","PMID:18724250 (Naiyer 2009)","PMID:19098864 (Li 2009 International Workshop)"]},{"bias_type":"age-group extrapolation bias","description":"Pediatric-derived sensitivity estimates (~98%) dominate the ESPGHAN literature and are frequently cited alongside adult data without distinction. Children have more severe VA, higher titers, and ~7 percentage points higher sensitivity than adults.","magnitude_estimate":"~7 percentage point overestimate when pediatric data applied to adults","evidence_sources":["PMID:35043426 (Sheppard 2022)"]}],"unproven_assumptions_identified":[{"assumption":"IgA-tTG2 sensitivity ≥95% applies broadly across ages, settings, Marsh grades, and populations.","evidence_against":"90.7% in adults unadjusted (Sheppard 2022); 0-42% for Marsh 3a (Abrams 2004/2006); 57.1% after verification bias correction (Hujoel 2021); 40-96% between labs (Abrams 2006); 80% below ULN in Black patients (Cartee 2024).","evidence_for":"95-100% for Marsh 3c with quality assays in referral centers; ~98% in children; high NPV at 1% prevalence.","clinical_impact":"False reassurance from negative tests. Clinician anchoring on 95% reduces vigilance for false negatives, undermining the guideline-recommended safety net of pursuing biopsy despite negative serology."},{"assumption":"A single sensitivity estimate meaningfully represents tTG performance across populations.","evidence_against":"I² = 92.3% (Shiha 2024); Giersiepen 2012 declined to pool at all (range 13-100%); sources of heterogeneity include Marsh grade, age, assay, lab, population, race. A single point estimate is a statistical fiction.","evidence_for":"Pooled estimates are standard in diagnostic accuracy reviews and provide a useful summary for clinical decision-making when heterogeneity sources are acknowledged.","clinical_impact":"A single number (95%) obscures that tTG is near-useless for Marsh 1-2, unreliable for Marsh 3a, and highly assay-dependent — information critical for clinical decision-making."},{"assumption":"Seronegative celiac disease is rare enough to be clinically inconsequential.","evidence_against":"1.7-6.4% strict prevalence; HR 10.87 for complications, HR 2.18 for mortality (Schiepatti 2021); 80% of Black CD patients seronegative (Cartee 2024). With verification bias, many more SNCD cases may exist undiagnosed.","evidence_for":"In referral center cohorts, most biopsied tTG-negative patients do not have CD. Strict SNCD criteria (Paris Consensus) apply to a small fraction of villous atrophy with negative serology.","clinical_impact":"SNCD patients face the worst outcomes of any CD subgroup precisely because diagnostic delay is longest. The clinical significance is inverse to perceived prevalence."}],"overlooked_populations":[{"population":"DQ8-only carriers with Marsh 3a and low mucosal immunity","estimated_size":"5-10% of all CD patients carry DQ8 only; unknown fraction have Marsh 3a","why_missed":"DQ8 produces lower antibody titers than DQ2.5 (gene-dose effect); Marsh 3a has 0-42% tTG sensitivity; no study has stratified tTG sensitivity by HLA genotype. These patients are virtually invisible to serology-first algorithms.","proposed_solution":"Mandatory biopsy regardless of serology for DQ8 symptomatic patients; HLA-stratified sensitivity studies using existing biobanks (UK Biobank, CDPC); intestinal TG2-IgA deposits as supplemental diagnostic tool."},{"population":"Black Americans with celiac disease","estimated_size":"Unknown — serologic screening systematically underestimates prevalence","why_missed":"80% seronegative at biopsy-confirmed diagnosis (Cartee 2024); physicians believe CD is rare in Black patients based on serologic prevalence studies; higher BMI at diagnosis contradicts 'classic' CD phenotype; possible different tTG cutoff requirements based on genetic ancestry.","proposed_solution":"Racial/ethnic validation of tTG cutoffs; lower biopsy threshold in symptomatic Black patients regardless of serology; population-based biopsy studies in diverse cohorts."},{"population":"Adults in primary care / unselected populations","estimated_size":"The majority of all CD testing occurs in primary care","why_missed":"Virtually all diagnostic accuracy studies come from secondary/tertiary referral centers where disease is more severe. Sheppard 2022 explicitly noted all 113 studies were in secondary care. AHRQ CER found evidence 'insufficient' for accuracy in specific risk groups.","proposed_solution":"Prospective diagnostic accuracy studies in primary care with protocol-mandated biopsy regardless of serology result."},{"population":"Patients with IgG1 subclass deficiency","estimated_size":"Unknown in CD population; IgG1 deficiency is the most common IgG subclass deficiency","why_missed":"Low IgG1 impairs sequential IgM→IgG1→IgA class switching (Siniscalco 2025), potentially reducing mucosal IgA production independent of total serum IgA levels. Not captured by standard total IgA measurement. DGP-IgG 'backup' test also impaired.","proposed_solution":"IgG subclass testing in seronegative suspected CD; research into IgG1 deficiency as a mechanism of seronegativity."}],"diagnostic_step_sensitivity":{"step_name":"IgA-tTG2 serology","reported_sensitivity":"95-97% (guideline consensus); 92.5% (AHRQ CER 2016 unadjusted); 90.7% (Sheppard 2022 adults); 97.7% (Sheppard 2022 children)","adjusted_sensitivity":"57.1% (35.4-76.4%) after Begg-Greenes verification bias correction (Hujoel 2021); 90.9% in biopsy-all symptomatic adults (Hopper 2008). Synthesis: likely 75-91% for full disease spectrum depending on Marsh grade distribution, with ~90-93% for Marsh III in secondary care.","false_negative_rate":"~7-10% in secondary care symptomatic adults (unadjusted); 58-100% for Marsh 3a (Abrams 2004/2006); potentially 43% after verification bias correction; unknown in screening populations","key_limitations":["Verification bias: 22-fold differential biopsy referral inflates apparent sensitivity (PMID:32433257)","Marsh grade dependence: 0-42% for Marsh 3a vs 95-100% for Marsh 3c (PMID:15185855, PMID:16630760)","Inter-laboratory variation: 40-96% between commercial labs/kits (PMID:16630760, PMID:18724250); 69-93% across 20 international labs (PMID:19098864)","Age effect: ~98% children vs ~91% adults (PMID:35043426)","No HLA-stratified sensitivity data: DQ8-specific sensitivity unknown","No primary care validation studies","Possible racial/ethnic variation: 80% below ULN in Black patients (Cartee 2024)","IgG1 subclass deficiency may independently impair serology via disrupted class switching (Siniscalco 2025)"]},"contradictory_studies":[{"citation":"Hujoel et al. 2021 — Verification bias correction of AHRQ CER data","pmid":"32433257","finding":"Adjusted IgA-tTG2 sensitivity 57.1% (35.4-76.4%), down from 92.6% unadjusted","contradicts":"All guideline claims of ≥95% sensitivity; even unadjusted meta-analytic estimates of ~90-93%"},{"citation":"Hopper et al. 2008 — Biopsy-all design in 2000 consecutive symptomatic adults","pmid":"18328437","finding":"90.9% sensitivity when ALL patients biopsied regardless of serology","contradicts":"Both the guideline claim of 95% (Hopper is lower) AND the Hujoel bias-corrected 57% (Hopper is much higher). The sole large biopsy-all study and the single most important reference point."},{"citation":"Abrams et al. 2004 vs Abrams et al. 2006 — Same Columbia group, contradictory Marsh 3a findings","pmid":"15185855 and 16630760","finding":"2004: 0% tTG sensitivity for PVA (strict criteria, n=115). 2006: 42.3% for PVA (clinical practice, n=122, different commercial labs). The 0-42% range from the same group demonstrates extreme instability of the Marsh 3a sensitivity estimate.","contradicts":"Each other — reflecting assay/threshold/cohort differences. The instability itself is the finding."},{"citation":"Cartee et al. 2024 — Racial disparities in tTG sensitivity","pmid":null,"finding":"80% of Black patients with biopsy-confirmed CD had tTG below ULN vs ~9% of non-Hispanic White patients","contradicts":"The assumption that a single tTG cutoff applies equally across racial/ethnic groups; prevalence estimates based on serologic screening in non-White populations"},{"citation":"ESPGHAN 2020 — Refused to cite case-finding sensitivity","pmid":null,"finding":"Explicitly stated: 'no study could provide valid data on sensitivity for case finding' due to verification bias","contradicts":"All other guidelines that cite specific sensitivity figures for the same test in the same context"}],"research_gaps":[{"gap":"HLA-stratified IgA-tTG2 sensitivity (DQ2.5 vs DQ2.2 vs DQ8 vs half-DQ2)","importance":"high","proposed_study_design":"Retrospective analysis of existing biobanks (UK Biobank linked to hospital records, CDPC) with HLA typing and matched serology/biopsy data. DQ8-only patients are the single most important unstudied subgroup."},{"gap":"Prospective biopsy-all studies in diverse, unselected populations","importance":"high","proposed_study_design":"Multicenter prospective cohort with protocol-mandated duodenal biopsy regardless of tTG result, in primary care and screening settings, with explicit racial/ethnic diversity targets."},{"gap":"Primary care diagnostic accuracy of IgA-tTG2","importance":"high","proposed_study_design":"Prospective study in primary care where all patients meeting symptom/risk criteria receive both serology and biopsy. Sheppard 2022 explicitly noted all 113 included studies were in secondary care."},{"gap":"Racial and ethnic validation of tTG cutoffs","importance":"high","proposed_study_design":"Large-scale comparison of tTG distribution and optimal cutoffs in Black, Hispanic, Asian, and White populations with biopsy-confirmed CD. Cartee 2024 needs replication in larger, multicenter cohorts."},{"gap":"International assay standardization — Li et al. 2009 workshop participants appealed for a Celiac Disease Antibody Standardization Program; none has been implemented","importance":"high","proposed_study_design":"Development of universal calibration standards for tTG assays; mandatory proficiency testing with published inter-laboratory variability metrics."},{"gap":"IgG1 subclass deficiency as a mechanism of seronegativity","importance":"medium","proposed_study_design":"Prospective measurement of IgG subclasses in all CD patients at diagnosis, correlated with serology results and mucosal IgA deposits. Siniscalco 2025 provides the biological rationale."},{"gap":"Chronological guideline review tracking sensitivity claim evolution","importance":"medium","proposed_study_design":"Systematic review comparing sensitivity figures cited across all major CD guidelines from 1997 to 2025, documenting citation chains and identifying when/if downward revisions occurred."}],"differential_diagnoses_relevant":[{"condition":"Other causes of seronegative villous atrophy (non-coeliac enteropathies)","overlap_with_cd":"Villous atrophy with negative celiac serology; Volta et al. found only ~45% of seronegative VA was true SNCD","distinguishing_features":"Paris Consensus (Schiepatti 2022, PMID:35676085) established formal criteria: SNCD requires HLA-DQ2/8+, exclusion of NCEs, and clinical/histological response to GFD"},{"condition":"Olmesartan enteropathy","overlap_with_cd":"Seronegative villous atrophy, often severe; can mimic CD histologically","distinguishing_features":"Drug history; resolution after olmesartan cessation; typically tTG-negative"},{"condition":"Common Variable Immunodeficiency (CVID)","overlap_with_cd":"VA with negative serology; may have low IgA and IgG; CD-like symptoms","distinguishing_features":"Low total immunoglobulins (IgG, IgA, IgM); absent plasma cells on biopsy; recurrent infections; nodular lymphoid hyperplasia"},{"condition":"Autoimmune enteropathy","overlap_with_cd":"Severe VA; may be HLA-DQ2/8+; seronegative for CD markers","distinguishing_features":"Anti-enterocyte antibodies; anti-goblet cell antibodies; no response to GFD; often more severe/refractory"},{"condition":"Giardiasis / tropical sprue","overlap_with_cd":"VA, malabsorption, diarrhea; tTG-negative","distinguishing_features":"Infection markers; geographic/travel history; response to antibiotics"}],"recommendations":[{"recommendation":"Guidelines should replace single-point sensitivity estimates with context-dependent ranges: ~90-93% for Marsh III in secondary care, 0-42% for Marsh 3a, unknown in screening/primary care, with explicit verification bias caveats.","target":"guidelines (ACG, ESPGHAN, BSG, NICE, ESsCD)","evidence_basis":"Sheppard 2022 (PMID:35043426); Abrams 2004/2006 (PMID:15185855, PMID:16630760); Hujoel 2021 (PMID:32433257)"},{"recommendation":"Negative IgA-tTG2 should be communicated as 'reduces likelihood but does not exclude CD.' When clinical suspicion is high (pretest probability >5%, symptoms, family history, DQ2/8+, autoimmune comorbidities), biopsy should be pursued regardless of serology.","target":"clinicians","evidence_basis":"ACG 2023 recommendation; verification bias evidence; SNCD outcomes (PMID:34496060)"},{"recommendation":"Mandate total serum IgA measurement with every IgA-tTG2 order; consider IgG subclass testing in seronegative suspected CD.","target":"clinicians and laboratories","evidence_basis":"2-3% IgA deficiency in CD; IgG1 deficiency as independent seronegativity mechanism (Siniscalco 2025)"},{"recommendation":"Explicitly lower biopsy threshold for DQ8-only carriers, first-degree relatives with DQ8, and symptomatic Black patients regardless of serology.","target":"clinicians and guidelines","evidence_basis":"DQ8 gene-dose effect on antibody production; Cartee 2024 (80% Black CD patients seronegative)"},{"recommendation":"Intestinal TG2-specific IgA deposits (by immunofluorescence on frozen biopsy) should be considered for diagnostic confirmation in seronegative suspected CD, per Paris Consensus criteria.","target":"clinicians and pathology laboratories","evidence_basis":"Schiepatti 2022 Paris Consensus (PMID:35676085); mucosal trapping hypothesis (Salmi 2006)"},{"recommendation":"Clinician education must incorporate the concept of verification bias. The principle — that serology-gatekept biopsy creates systematic diagnostic blind spots — is methodologically incontrovertible regardless of the debated magnitude.","target":"medical education, gastroenterology training programs","evidence_basis":"Hujoel 2021 (PMID:32433257); behavioral anchoring effects of false precision in guidelines"},{"recommendation":"Urgent need for racial/ethnic validation of tTG cutoffs and prospective biopsy-all studies in diverse populations.","target":"researchers and funding agencies","evidence_basis":"Cartee 2024; absence of primary care or non-White validation data in any meta-analysis"}],"meta_analysis_summary":{"studies_reviewed":10,"total_patients":null,"pooled_estimates":{"Rostom_2005_HR_tTG_adults_3_studies":"98.1% (90.1-99.7%)","Rostom_2005_GP_tTG_adults_5_studies":"90.2% (85.9-93.4%)","Maglione_2016_CER_mixed_9_studies":"92.5% (90.0-94.4%)","Sheppard_2022_adults_5_studies":"90.7% (87.3-93.2%)","Sheppard_2022_children_6_studies":"97.7% (91.0-99.4%)","Hujoel_2021_bias_corrected_9_studies":"57.1% (35.4-76.4%)","Hopper_2008_biopsy_all_symptomatic":"90.9% (single study, n=2000)"},"heterogeneity_notes":"Extreme heterogeneity across all reviews. I² = 92.3% reported by Shiha 2024 for tTG at ≥10× ULN. Giersiepen 2012 declined to pool at all (range 13-100%). Sources: Marsh grade (dominant), age (children>>adults), assay manufacturer, laboratory, clinical setting, study design, potentially race/ethnicity. A single pooled estimate is a statistical fiction masking enormous real-world variation."}}
