{"research_topic_id":"5.2","research_topic_title":"Can Celiac Disease Occur Without HLA-DQ2 or DQ8? Verification Bias in HLA Rule-Out Testing","date_completed":"2026-02-08","version":"3.0-corrected-final","correction_notes":"Incorporates peer review corrections: 2 PMID fixes (Pallav 24705698, Walker 20398668), Maimaris 2024 confirmed real (PMID 38594883 — peer review incorrectly flagged as hallucinated), Anderson PMID added (23981538), NPV framing resolved, Polvi data clarified, DQ2.2-alone paradox elevated to key finding","executive_summary":"Truly HLA-negative CD approaches zero (0.4–0.9%) when comprehensive typing includes DQ2.5, DQ2.2, DQ8, DQ7.5, and half-DQ2 configurations — strongly supporting the biological requirement for HLA-DQ-mediated gluten presentation. However, the widely cited >99% NPV is the best estimate from available data rather than a validated figure, because all estimates derive from typing already-diagnosed patients identified through serology-first pathways that systematically exclude seronegative/HLA-negative individuals from the denominator. DQ8-only patients face compounding diagnostic disadvantage through dramatically lower serology sensitivity (OR 96.9 for DQ2 homozygous vs. markedly lower for DQ8-only), and the DQ2.2-alone genotype occupies a paradoxical category: HLA-positive on comprehensive panels but not associated with tTG2 positivity.","key_findings":[{"finding_id":"5.2.1","finding":"Standard DQ2.5/DQ8-only panels miss 5–10% of CD patients. Adding DQ2.2 captures another 3–6%. Adding half-DQ2 and DQ7.5 reduces the apparent HLA-negative rate to 0.4–0.9%. Anderson et al. 2013 showed 4 of 5 'gene-negative' patients were misdiagnoses on re-evaluation, suggesting the true rate approaches zero. Note: Polvi 1998's 9.2% figure represents patients lacking the DQ2 heterodimer specifically (not both DQ2.5 AND DQ8) — many in that 9.2% carried DQ8.","evidence_strength":"strong","quantitative_estimate":"0.4–0.9% truly HLA-negative with comprehensive typing; 5–10% false-negative with basic DQ2.5/DQ8-only panels","confidence_interval":null,"key_citations":["PMID:12651074","PMID:19027045","PMID:36858916","PMID:23981538","PMID:9548076"],"contradicts_guidelines":false,"affected_patient_population":"All CD patients, particularly Southern European populations where DQ2.2 and trans-DQ2.5 are more common"},{"finding_id":"5.2.2","finding":"The >99% NPV of HLA testing is the best available estimate but has never been validated by biopsying HLA-negative individuals at the same rate as HLA-positive. All estimates derive from typing already-diagnosed patients (sensitivity calculation, not true NPV validation). The Paris Consensus definition of seronegative CD requires HLA-DQ2/DQ8 positivity, making HLA-negative seronegative CD definitionally impossible — rendering the framework unfalsifiable for this subgroup. The strong biological argument (HLA-DQ is mechanistically required for gluten peptide presentation) supports the estimate but cannot substitute for unbiased validation.","evidence_strength":"moderate","quantitative_estimate":"Best estimate NPV >99% with comprehensive typing; structurally unvalidated lower bound","confidence_interval":null,"key_citations":["PMID:24705698","PMID:35676085","PMID:12651074"],"contradicts_guidelines":true,"affected_patient_population":"Any patient who is both seronegative and HLA-negative (impossible to diagnose under current criteria)"},{"finding_id":"5.2.3","finding":"DQ8-only patients have dramatically lower odds of tTG2-IgA positivity compared to DQ2.5 carriers (OR 96.9 for DQ2 homozygous vs. significantly lower for DQ8-only in 24,339-patient Mayo Clinic study). Vader et al. showed DQ2.5 homozygous APCs present a broader gluten peptide repertoire with greater T-cell stimulation than heterozygous cells (full-text data). Yet Airaksinen et al. found DQ2.5-negative patients are the MOST symptomatic at diagnosis (p=0.007) and most likely to remain symptomatic on GFD (p=0.002), consistent with diagnostic delay from serology-first algorithms filtering them out.","evidence_strength":"strong","quantitative_estimate":"OR 96.9 (95% CI: 58.3–147.9) for DQ2 homozygous; OR 36.8 for DQ2.5 heterozygous; OR 42.3 for DQ2.5/DQ8 compound heterozygous","confidence_interval":"95% CI: 58.3–147.9 for DQ2 homozygous","key_citations":["PMID:32005535","PMID:33317091","PMID:14530392"],"contradicts_guidelines":true,"affected_patient_population":"DQ8-only CD patients; DQ2.2-alone carriers"},{"finding_id":"5.2.4","finding":"DQ2.2 heterozygous alone (without DQ7.5 trans partner, without DQ2.5 or DQ8) was NOT associated with tTG2-IgA positivity in the largest study to date (Choung 2020, n=24,339). This creates a paradoxical diagnostic category: patients with DQ2.2-alone are classified as 'HLA-positive' by comprehensive panels, yet have near-zero odds of seropositivity. They cannot be ruled out by HLA (positive result) and cannot be ruled in by serology (negative result). When DQ2.2 co-occurs with DQ7.5 from the other chromosome, trans-DQ2.5 can form — but DQ2.2 alone without this partner may be effectively non-permissive.","evidence_strength":"moderate","quantitative_estimate":"DQ2.2 heterozygous alone: no significant association with tTG2-IgA positivity","confidence_interval":null,"key_citations":["PMID:32005535"],"contradicts_guidelines":true,"affected_patient_population":"DQ2.2-alone carriers (without DQ7.5 trans partner or DQ2.5/DQ8)"},{"finding_id":"5.2.5","finding":"44% of hospitals surveyed by ESPGHAN could not identify which HLA testing method was used, and only 6% could request rare risk alleles. Some commercial kits test only three alleles (DQA1*05, DQB1*02, DQB1*03:02) and may report patients as 'DQ2/DQ8-negative' when they carry DQ2.2 or half-DQ2. Only NICE NG20 explicitly lists DQ2.2 alongside DQ2.5. 11.5% of Spanish CD patients carry DQ2 in trans configuration, which would be missed by incomplete panels.","evidence_strength":"moderate","quantitative_estimate":"44% of hospitals uncertain of testing method; 11.5% trans-DQ2 in Spanish pediatric CD","confidence_interval":null,"key_citations":["PMID:36858916"],"contradicts_guidelines":true,"affected_patient_population":"Any CD patient typed with incomplete HLA panels"},{"finding_id":"5.2.6","finding":"Non-HLA genetic loci (~42–57 confirmed from GWAS) contribute ~14% of genetic variance with individual ORs of 1.12–1.36. Non-HLA genetics cannot substitute for HLA: absolute CD risk is near zero without HLA-DQ2/DQ8 regardless of non-HLA genotype (Génin 2022). However, non-HLA burden disproportionately modifies risk in low-HLA-risk individuals, potentially pushing marginal HLA carriers past a disease threshold. Polygenic risk scores (AUC 0.87–0.90) do not meaningfully improve on HLA-only models for rule-out.","evidence_strength":"strong","quantitative_estimate":"~14% of genetic variance from non-HLA loci; ~48–54% total explained heritability; ~46–52% missing heritability; strongest non-HLA locus 3q25-26 (IL12A/SCHIP1) OR ~1.36","confidence_interval":null,"key_citations":["PMID:22057235","PMID:24550740","PMC9409868"],"contradicts_guidelines":false,"affected_patient_population":"HLA-positive patients with marginal risk configurations"},{"finding_id":"5.2.7","finding":"Siniscalco et al. 2025 described sequential IgM→IgG1→IgA class switching in Peyer's patches as a major pathway for gut mucosal IgA production. This is a mechanistic hypothesis (not yet an established CD-specific pathway) for explaining seronegativity: IgG1 deficiency could impair the sequential pathway independently of HLA, reducing mucosal anti-tTG2 IgA production. Combined with DQ8-restricted epitope presentation, this creates a plausible 'double-hit' model. Current evidence is from mouse models with limited human validation; the link to CD-specific B-cell responses is inferred, not demonstrated.","evidence_strength":"emerging","quantitative_estimate":null,"confidence_interval":null,"key_citations":["PMID:41253159","PMID:16571636"],"contradicts_guidelines":false,"affected_patient_population":"Reference patient: DQ8, Marsh 3A, all serology <1, low IgG1, low secretory IgA"},{"finding_id":"5.2.8","finding":"DQ7.5 (DQA1*05:05-DQB1*03:01) as a sole risk allele is found in an estimated 0.3–2.1% of CD patients. Its primary role is as the trans partner for DQ2.2, enabling assembly of functional trans-DQ2.5. Alone without DQ2.2, its independent contribution to CD risk is uncertain but may explain some residual 'HLA-negative' cases when incomplete panels miss this allele.","evidence_strength":"weak","quantitative_estimate":"0.3–2.1% of CD patients","confidence_interval":null,"key_citations":["PMID:38594883"],"contradicts_guidelines":false,"affected_patient_population":"CD patients with DQ7.5 as sole identifiable risk allele"}],"biases_documented":[{"bias_type":"Circular validation of HLA NPV","description":"NPV = TN/(TN+FN). False negatives are CD patients who test HLA-negative. But CD patients are identified through positive serology → biopsy. A seronegative, HLA-negative patient would never be biopsied under standard algorithms, never diagnosed, and never appear in the FN column. The denominator systematically excludes the population most at risk of being missed. The Paris Consensus requires HLA positivity for seronegative CD diagnosis, making the framework unfalsifiable for HLA-negative patients. Counterargument: the biological requirement for HLA-DQ-mediated gluten presentation is mechanistically well-founded (Abadie 2020 mouse model requires both IL-15 and HLA-DQ8), which limits the plausible magnitude of this bias compared to the analogous serology verification bias.","magnitude_estimate":"Unquantifiable within current diagnostic frameworks. Biological constraints suggest the bias is likely small (true NPV probably near the reported >99%), but this cannot be confirmed without population-based biopsy studies independent of serology and HLA.","evidence_sources":["Structural analysis of diagnostic pathway","PMID:35676085","PMID:32051586"]},{"bias_type":"Incomplete HLA panel bias","description":"Testing only for DQ2.5 and DQ8 misclassifies 5–10% of CD patients as 'HLA-negative' when they carry DQ2.2, half-DQ2, DQ7.5, or trans-DQ2.5. 44% of hospitals cannot identify their testing method. Particularly affects Southern European populations where DQ2.2 and trans configurations are more common.","magnitude_estimate":"5–10% false-negative rate with basic panels vs. 0.4–0.9% with comprehensive panels","evidence_sources":["PMID:19027045","PMID:36858916","PMID:12651074"]},{"bias_type":"Serology-first ascertainment bias in HLA genetic studies","description":"All major HLA-CD cohort studies (Karell 2003, Megiorni 2009, Sánchez-Valverde 2023) identified CD patients through clinical referral pathways using positive serology as the gateway to biopsy. Seronegative CD patients are underrepresented. Since DQ8-only and DQ2.2-alone patients have lower serology rates (Choung 2020, Airaksinen 2020), these HLA configurations are depleted from study denominators.","magnitude_estimate":"Unknown; Airaksinen 2020 showed DQ2.5-negative patients were significantly less likely to be antibody-positive at diagnosis (p=0.021)","evidence_sources":["PMID:33317091","PMID:32005535"]}],"unproven_assumptions_identified":[{"assumption":"HLA-DQ2/DQ8 absence safely rules out CD with >99% NPV","evidence_against":"NPV calculation excludes seronegative/HLA-negative patients by design; Paris Consensus makes diagnosis definitionally impossible for this group; no population-based study has biopsied HLA-negative individuals at the same rate as HLA-positive","evidence_for":"Mechanistically, HLA-DQ2/DQ8 are required for deamidated gluten peptide presentation to CD4+ T cells; comprehensive typing reduces 'truly negative' rate to 0.4%; Anderson 2013 showed 4/5 gene-negative patients were misdiagnoses; Abadie 2020 mouse model requires both HLA and IL-15 for villous atrophy","clinical_impact":"For the vast majority of patients, comprehensive negative HLA result reliably excludes CD. For rare patients with villous atrophy, negative comprehensive HLA, and clinical gluten sensitivity, current criteria prevent CD diagnosis even if they respond to GFD."},{"assumption":"Serology sensitivity is uniform across HLA genotypes","evidence_against":"Choung 2020: DQ2 homozygous OR 96.9 for tTG2 positivity vs. dramatically lower for DQ8-only; DQ2.2-alone not associated; Airaksinen 2020: DQ2.5-negative patients least likely antibody-positive; Vader 2003: DQ2.5 presents broader peptide repertoire with greater T-cell stimulation than heterozygous","evidence_for":"Guidelines use single serology threshold regardless of HLA genotype; most large validation studies don't stratify by HLA","clinical_impact":"DQ8-only patients may have systematically lower tTG2 levels, causing false-negative serology at conventional thresholds. No guidelines incorporate HLA-stratified serology interpretation."},{"assumption":"DQ2.2 heterozygous alone confers meaningful CD risk","evidence_against":"Choung 2020: DQ2.2 heterozygous (without DQ8, without DQ2.5) was NOT associated with tTG2-IgA positivity","evidence_for":"DQ2.2 + DQ7.5 can form trans-DQ2.5 (functionally equivalent); some guidelines include DQ2.2 in risk panels","clinical_impact":"DQ2.2-alone patients are counted as 'HLA-positive' but may have near-zero CD risk and near-zero serology sensitivity — a paradoxical category that should be explicitly flagged in laboratory reports"}],"overlooked_populations":[{"population":"DQ8-only CD patients","estimated_size":"~5–10% of CD patients carry DQ8 without DQ2.5; ~5–10% population prevalence of DQ8","why_missed":"Lower tTG2 antibody production due to restricted epitope presentation → filtered out by serology-first algorithms → never biopsied → never diagnosed","proposed_solution":"HLA-stratified serology thresholds; lower biopsy threshold for symptomatic DQ8-positive patients with borderline or negative serology"},{"population":"DQ2.2-alone carriers with gluten-sensitive enteropathy","estimated_size":"Unknown; DQ2.2 alone not associated with tTG2 positivity per Choung 2020","why_missed":"Classified as HLA-positive but serology-unlikely; fall through both rule-out pathways","proposed_solution":"Acknowledge DQ2.2-alone as paradoxical category; require DQ7.5 trans partner assessment before using for rule-in; do not use isolated DQ2.2 for confident rule-in or rule-out"},{"population":"Non-European ancestry CD patients","estimated_size":"Billions globally; HLA-DQ frequencies vary dramatically (DQ2.5 <5% in East Asians vs. 20–30% in Northern Europeans)","why_missed":"Nearly all NPV data from European-ancestry populations; HLA risk gradient not validated cross-ethnically","proposed_solution":"Population-specific HLA-CD risk studies; caution extrapolating European NPV data to other populations"},{"population":"Patients with IgG1 subclass deficiency and CD","estimated_size":"IgG1 deficiency prevalence ~2–3% in general population","why_missed":"Siniscalco IgM→IgG1→IgA sequential class-switching pathway not yet connected to CD-specific serology in clinical literature; IgG subclass testing not standard in CD workup","proposed_solution":"Research study correlating IgG1 subclass levels with CD serology sensitivity; consider IgG subclass testing in seronegative villous atrophy"}],"diagnostic_step_sensitivity":{"step_name":"HLA-DQ2/DQ8 testing as CD rule-out","reported_sensitivity":">99% (% of diagnosed CD patients carrying DQ2/DQ8 on comprehensive panels; Pallav 2014: 98% NPV in 256 patients — 2 HLA-negative CD patients both carried half-DQ2.5-trans, PMID:24705698)","adjusted_sensitivity":"Best available estimate >99.5% with comprehensive typing; structurally unvalidated lower bound due to circular diagnostic pathways","false_negative_rate":"Reported: 0.4–0.9% with comprehensive typing (Karell 2003: 0.4%, Megiorni 2009: 0.9%, Sánchez-Valverde 2023: 0.8%). After diagnostic re-evaluation (Anderson 2013): approaches 0%. True population rate: unknowable because diagnostic framework prevents ascertainment of seronegative/HLA-negative CD.","key_limitations":["All estimates derive from typing already-diagnosed patients identified through serology-first pathways (sensitivity measure, not true NPV)","Paris Consensus requires HLA positivity for seronegative CD diagnosis, making framework unfalsifiable for HLA-negative patients","Incomplete HLA panels (DQ2.5/DQ8-only) have 5–10% false-negative rate from missed DQ2.2, half-DQ2, DQ7.5, and trans configurations","No population-based biopsy study has tested HLA-negative individuals at the same rate as HLA-positive","DQ2.2-alone paradox: counted as HLA-positive but not associated with tTG2 positivity (Choung 2020)","DQ8-only patients have dramatically lower serology sensitivity, compounding the serology-first ascertainment bias","Validation limited to European-ancestry populations"]},"contradictory_studies":[{"citation":"Choung et al. 2020, Hum Immunol","pmid":"32005535","finding":"DQ2.2 heterozygous alone (without DQ8/DQ2.5) was NOT associated with tTG2-IgA positivity in 24,339 patients","contradicts":"Guidelines that include DQ2.2 as a CD risk allele (NICE NG20, ESPGHAN comprehensive panels); creates paradoxical HLA-positive/serology-negative category"},{"citation":"Airaksinen et al. 2020, Nutrients","pmid":"33317091","finding":"DQ2.5-negative patients were the most symptomatic at diagnosis (p=0.007) and most likely to remain symptomatic on GFD (p=0.002), despite being least likely antibody-positive (p=0.021). Mucosal damage severity did not differ significantly between HLA groups.","contradicts":"Assumption that serology sensitivity is uniform across HLA genotypes; assumption that higher HLA risk = worse clinical outcomes"},{"citation":"Salmi et al. 2006, Gut","pmid":"16571636","finding":"TG2-targeted IgA autoantibodies deposited in small-bowel mucosa in all 22 seronegative CD patients tested, even when completely absent from serum","contradicts":"Use of serum serology as reliable indicator of mucosal immune response; assumption that negative serum tTG2 = absence of anti-tTG2 immune activity"},{"citation":"Anderson et al. 2013, BMC Medicine","pmid":"23981538","finding":"4 of 5 'gene-negative' CD patients were misdiagnoses on rigorous re-evaluation (2 normal histology on gluten challenge, 2 reclassified as Crohn's/CVID)","contradicts":"Claims that 1–2% of CD patients are truly HLA-negative; rate may approach zero with rigorous verification"},{"citation":"Maimaris et al. 2024, Int J Immunogenet (Letter)","pmid":"38594883","finding":"0.3–2.1% of CD patients carry DQ7.5 as sole identifiable risk allele; DQ7.5 role primarily as trans partner for DQ2.2 to form functional DQ2.5","contradicts":"HLA panels that omit DQ7.5 testing; supports the finding that most 'HLA-negative' cases are artifacts of incomplete panels"}],"research_gaps":[{"gap":"Population-based biopsy study with histology obtained independently of serology and HLA status","importance":"high","proposed_study_design":"Replicate Kalixanda cohort design (Walker et al. 2010, PMID:20398668) where all participants undergo endoscopy with duodenal biopsy regardless of serology or HLA. Add comprehensive HLA typing. Compare HLA distribution in biopsy-detected CD vs. serology-detected CD. This is the only design that can break the circular validation of HLA NPV."},{"gap":"Direct comparison of Marsh grade distributions and serology sensitivity between DQ8-only and DQ2.5-positive CD patients","importance":"high","proposed_study_design":"Large multicenter cohort (n>1000 CD patients) with systematic HLA fine-mapping and standardized Marsh grading by central pathologist. Stratify serology sensitivity by HLA genotype and Marsh grade."},{"gap":"HLA-stratified serology sensitivity with genotype-specific cutoffs","importance":"high","proposed_study_design":"Using large biobank data (UK Biobank, FinnGen), calculate tTG2-IgA sensitivity at standard cutoffs for DQ2.5 homozygous, DQ2.5 heterozygous, DQ2.5/DQ8, DQ8-only, DQ2.2-alone. Derive genotype-specific optimal cutoffs."},{"gap":"IgG1 subclass levels correlated with CD serology sensitivity","importance":"medium","proposed_study_design":"Prospective study measuring IgG1-4 subclasses at CD diagnosis; correlate with tTG2 levels, Marsh grade, and HLA genotype. Test whether IgG1 deficiency independently predicts seronegativity via Siniscalco sequential class-switching pathway."},{"gap":"Validation of HLA NPV in non-European populations","importance":"high","proposed_study_design":"Population-based screening studies in South Asian, East Asian, and African populations with comprehensive HLA typing and biopsy independent of serology"},{"gap":"Re-evaluation of all published 'truly HLA-negative' CD cases with modern methods","importance":"medium","proposed_study_design":"Systematic re-evaluation of Karell's 4, Polvi's 2, Megiorni's 4, and Sánchez-Valverde's 17 apparently HLA-negative cases with: (1) next-generation HLA sequencing, (2) exclusion of CVID/autoimmune enteropathy/drug-induced enteropathy, (3) gluten challenge with repeat biopsy"}],"differential_diagnoses_relevant":[{"condition":"CVID-associated enteropathy","overlap_with_cd":"Villous atrophy, increased IELs, can be HLA-DQ2/DQ8 positive (general population prevalence ~30–40%)","distinguishing_features":"Low total immunoglobulins, recurrent infections, absent plasma cells on biopsy, no response to GFD. Anderson 2013 reclassified 1 'HLA-negative CD' patient as CVID."},{"condition":"Autoimmune enteropathy","overlap_with_cd":"Villous atrophy, can present in adults, can have autoantibodies","distinguishing_features":"Anti-enterocyte antibodies, anti-goblet cell antibodies, no response to GFD, absence of TG2-specific mucosal deposits (Salmi 2006 method)"},{"condition":"Crohn's disease with duodenal involvement","overlap_with_cd":"Villous atrophy, can be seronegative, can have increased IELs","distinguishing_features":"Granulomas, skip lesions, transmural inflammation. Anderson 2013 reclassified 1 'HLA-negative CD' patient as Crohn's."},{"condition":"Olmesartan-induced enteropathy","overlap_with_cd":"Villous atrophy, increased IELs, diarrhea, weight loss, sprue-like histology","distinguishing_features":"Temporal relationship with olmesartan use, resolution on drug withdrawal, no response to GFD"},{"condition":"Seronegative CD (HLA-positive, per Paris Consensus)","overlap_with_cd":"By definition IS celiac disease; villous atrophy with negative serology but positive HLA","distinguishing_features":"Paris Consensus criteria: HLA-DQ2/DQ8 positive, Marsh 3 villous atrophy, alternative diagnoses excluded, clinical/histological response to GFD"},{"condition":"Tropical sprue","overlap_with_cd":"Villous atrophy, malabsorption, can affect proximal small bowel","distinguishing_features":"Travel/residence in endemic areas, response to antibiotics, megaloblastic anemia from B12/folate deficiency"},{"condition":"Giardiasis","overlap_with_cd":"Villous blunting, increased IELs, malabsorption","distinguishing_features":"Organisms visible on biopsy or stool antigen test, response to metronidazole"}],"recommendations":[{"recommendation":"All HLA panels for CD should type both DQA1 and DQB1 loci and explicitly report: DQ2.5 (cis and trans), DQ2.2, DQ8, half-DQ2, and DQ7.5 configurations. Laboratory reports should state which alleles were tested and which configurations were evaluated.","target":"guidelines, laboratories","evidence_basis":"44% of hospitals cannot identify testing method (ESPGHAN 2025 QoC survey); incomplete panels have 5–10% false-negative rate; 11.5% of Spanish CD patients carry DQ2 in trans (PMID:36858916)"},{"recommendation":"DQ8-positive symptomatic patients with borderline or negative serology should have a lower threshold for biopsy referral compared to DQ2.5-positive patients with the same serology results.","target":"clinicians, guidelines","evidence_basis":"Choung 2020: DQ8-only patients have dramatically lower tTG2 odds than DQ2.5; Airaksinen 2020: DQ2.5-negative patients most symptomatic but least likely antibody-positive (PMID:32005535, PMID:33317091)"},{"recommendation":"The DQ2.2-alone genotype (without DQ7.5 trans partner, DQ2.5, or DQ8) should be explicitly flagged in laboratory reports as a paradoxical category: HLA-positive on comprehensive panels but not associated with tTG2 positivity. Should not be used for confident rule-in or rule-out.","target":"guidelines, laboratories","evidence_basis":"Choung 2020: DQ2.2 heterozygous alone not associated with tTG2-IgA positivity (PMID:32005535)"},{"recommendation":"Population-based biopsy studies with histology independent of serology and HLA are needed to validate HLA NPV. The Kalixanda design (Walker 2010, PMID:20398668) should be replicated with comprehensive HLA typing.","target":"researchers","evidence_basis":"Current NPV estimates are the best available but structurally unvalidated due to circular diagnostic pathways"},{"recommendation":"For the reference patient profile (DQ8, Marsh 3A, all serology <1, low IgG1, low secretory IgA): HLA testing is NOT the diagnostic failure point (DQ8 is detected). The failure occurs at the serology step. This patient profile requires biopsy independent of serology for diagnosis, and the Siniscalco sequential class-switching pathway provides a mechanistic hypothesis for the seronegativity.","target":"clinicians","evidence_basis":"DQ8 confers recognized CD risk; serology sensitivity is HLA-genotype-dependent; IgG1 deficiency may impair mucosal IgA via sequential class-switching pathway (PMID:41253159); mucosal TG2-IgA deposits present even without serum antibodies (PMID:16571636)"},{"recommendation":"HLA rule-out remains one of the most powerful exclusion tests in clinical medicine. For the vast majority of patients, a comprehensive negative result reliably excludes CD. Clinicians should verify panel completeness rather than abandon HLA testing.","target":"clinicians, guidelines","evidence_basis":"Multiple large cohorts (total >29,000 patients) show 0.4–0.9% truly negative on comprehensive panels, approaching 0% after diagnostic re-evaluation (PMID:23981538)"}],"meta_analysis_summary":{"studies_reviewed":20,"total_patients":29520,"pooled_estimates":{"truly_HLA_negative_CD_rate_comprehensive_typing":"0.4–0.9% (Karell 0.4%, Polvi 0.7%, Megiorni 0.9%, Sánchez-Valverde 0.8%); approaches 0% after diagnostic re-evaluation (Anderson 2013)","HLA_negative_rate_basic_DQ2.5_DQ8_panels":"5–10% depending on population and panel completeness","DQ2_homozygous_OR_for_tTG2_positivity":"96.9 (95% CI: 58.3–147.9)","DQ2.5_heterozygous_OR_for_tTG2":"36.8 (from Choung 2020 full text)","DQ2.5_DQ8_compound_heterozygous_OR":"42.3","DQ2.2_alone_OR_for_tTG2":"Not significantly associated (Choung 2020)","non_HLA_genetic_variance":"~14% from ~42–57 loci","total_explained_heritability":"~48–54%","missing_heritability":"~46–52%","strongest_non_HLA_locus":"3q25-26 (IL12A/SCHIP1) OR ~1.36","PRS_AUC":"0.87–0.90 (Abraham 2014)"},"heterogeneity_notes":"Substantial heterogeneity in HLA panel completeness across studies — this is itself a key finding. Southern European populations show higher DQ2.2 and trans-DQ2.5 frequencies, affecting 'HLA-negative' rates. Studies span pediatric and adult populations. All studies subject to serology-first ascertainment bias. Risk gradient estimates (Choung 2020 ORs) are from a single large Mayo Clinic cohort and need replication in other populations."},"citation_corrections_from_peer_review":{"PMID_25170340_corrected_to":"PMID:24705698 (Pallav et al. 2014, Dig Dis Sci; DOI:10.1007/s10620-014-3143-1) — original PMID pointed to Chinese medicine paper","PMID_20398667_corrected_to":"PMID:20398668 (Walker et al. 2010, Gastroenterology; DOI:10.1053/j.gastro.2010.04.007) — off-by-one digit error","Maimaris_2024_status":"CONFIRMED REAL: PMID:38594883 (Maimaris et al. 2024, Int J Immunogenet; DOI:10.1111/iji.12671) — peer review incorrectly flagged as potentially hallucinated; it is a Letter, not a full article, which made it harder to find","Anderson_2013_PMID_added":"PMID:23981538 (Anderson et al. 2013, BMC Medicine; DOI:10.1186/1741-7015-11-188)"}}
