{"research_topic_id":"6.1","research_topic_title":"Celiac Disease: One T-Cell Disease with Variable Antibody Expression — Subtypes, Spectrum, and Diagnostic Implications","date_completed":"2026-02-09","executive_summary":"Celiac disease is fundamentally one T-cell mediated disease driven by gluten-specific CD4+ T cells and cytotoxic CD8+ intraepithelial lymphocytes, with IL-7 as the gluten-inducible pathogenic mediator necessary and sufficient for epithelial destruction (Santos et al. 2024, Nature). Anti-TG2 antibodies are a downstream, non-pathogenic consequence — injection into mice causes no enteropathy (Sollid group 2022) — and their levels reflect mucosal damage severity and individual antibody production capacity rather than disease presence. Clinical 'subtypes' (seronegative, ultrashort, potential) represent variable antibody expression of this same core disease, with RCD-II as the sole genuine exception (neoplastic T-cell transformation). Tissue-specific tTG autoimmunity (tTG2 gut, tTG3 skin, tTG6 brain) represents variable B-cell targeting driven by the same T-cell disease. Current serology-first diagnostics detect a downstream marker rather than the pathogenic mechanism, systematically missing patients whose antibody production is impaired by HLA genotype (DQ8/DQ2.2), Marsh grade (3a), immunoglobulin defects (IgG1, secretory IgA), or anatomical limitation (bulb-only disease). Verification-bias-corrected IgA-tTG2 sensitivity is 57.1% (95% CI 35.4–76.4%), far below the >90% widely cited.","key_findings":[{"finding_id":"6.1.1","finding":"CD pathogenesis is T-cell driven, with antibodies as non-pathogenic downstream markers. Gluten-specific CD4+ T cells recognizing deamidated gluten peptides on HLA-DQ2/DQ8 are the central pathogenic event. Cytotoxic CD8+ IELs execute epithelial destruction via NKG2C/D. IL-7, produced by lamina propria mesenchyme, is the gluten-inducible modulator that is both necessary and sufficient for epithelial destruction (Santos et al. 2024 Nature organoid model). Critically, anti-TG2 antibodies injected into immunocompetent mice caused NO enteropathy (Sollid group 2022, PLOS ONE), demonstrating secreted antibodies are not pathogenic. B cells matter primarily as antigen-presenting cells that amplify the T-cell response, not through their secreted antibodies. This means negative serology does not exclude the disease — it means the downstream marker is absent while the pathogenic mechanism may be fully active.","evidence_strength":"strong","quantitative_estimate":null,"confidence_interval":null,"key_citations":["PMID:38670280","PMID:39048815","PMID:36067801","DOI:10.1371/journal.pone.0266543"],"contradicts_guidelines":true,"affected_patient_population":"All CD patients — reframes the relationship between serology and disease"},{"finding_id":"6.1.2","finding":"Serology measures damage severity, not disease presence. IgA-tTG2 titers progressively correlate with Marsh grade (2024 meta-analysis). Endomysial antibody positivity is 77% in total villous atrophy but only 33% in partial atrophy (Marsh 3a). Verification-bias-corrected sensitivity drops from 92.6% to 57.1% (95% CI 35.4–76.4%) per Hujoel et al. 2021 — only 3.6% of tTG2-negative patients were referred for biopsy vs 79.2% of positives. These data collectively demonstrate that serology detects a quantitative correlate of mucosal damage, not a qualitative marker of disease presence.","evidence_strength":"strong","quantitative_estimate":"Adjusted sensitivity 57.1% (95% CI 35.4–76.4%); EMA positivity 33% at Marsh 3a vs 77% at total VA","confidence_interval":"95% CI 35.4–76.4%","key_citations":["PMID:32433257"],"contradicts_guidelines":true,"affected_patient_population":"Patients with Marsh 3a and milder mucosal disease"},{"finding_id":"6.1.3","finding":"Ultrashort CD (USCD) — villous atrophy confined to duodenal bulb — is the same T-cell disease with limited anatomical extent, producing lower antibody titers as a predicted consequence of less mucosal surface area generating antibodies. USCD constitutes 5–11% of CD diagnoses. A 2026 Spanish study (n=728) showed standardizing bulb biopsy compliance from 36% to 90% increased USCD detection SEVENFOLD (0.7% to 5.4%). USCD has lower tTG2 titers, less DQ2.5 (71% vs 95%), more seronegativity (28% vs 8%), and less NK cell suppression. The 2025 ESsCD guidelines (PMID:40999951) now mandate ≥2 bulb biopsies.","evidence_strength":"strong","quantitative_estimate":"5–11% of CD; 7x underdetection without standardized bulb biopsy; 28% seronegative; DQ2.5 only 71%","confidence_interval":null,"key_citations":["PMID:41608837","PMID:35489585","PMID:26836585","PMID:38286391","PMID:40999951"],"contradicts_guidelines":true,"affected_patient_population":"Patients with bulb-limited enteropathy, especially DQ8/DQ2.2 carriers"},{"finding_id":"6.1.4","finding":"Seronegative CD (SNCD) is the same T-cell disease with impaired antibody production, not a different entity. SNCD accounts for 2–5% of diagnosed CD per 2025 ESsCD guidelines (PMID:40999951), but this is a verification-bias minimum — only patients severe enough to warrant biopsy despite negative serology are detected. SNCD patients are older and have more severe symptoms (survival bias). Indian cohort (PMID:34712436, n=13 SNCD out of 312 CD — NOTE small sample): HLA-DQ2.5 only 46%, DQ2.2 38%, DQ8 15%. The DQ8/DQ2.2 overrepresentation is consistent with other data but these specific percentages must be interpreted cautiously given n=13. Seronegativity is mechanistically explained by insufficient mucosal antibody production due to genotype, damage severity, or immunological defects — not different biology.","evidence_strength":"moderate","quantitative_estimate":"2–5% of diagnosed CD (verification-bias minimum); HLA data from n=13 (low confidence)","confidence_interval":null,"key_citations":["PMID:40999951","PMID:38286391","PMID:34712436","PMID:41319369"],"contradicts_guidelines":true,"affected_patient_population":"Seronegative patients with villous atrophy, disproportionately DQ8 and DQ2.2 carriers"},{"finding_id":"6.1.5","finding":"Potential CD represents the same T-cell disease at an earlier stage where seroconversion has occurred but cytotoxic IEL-mediated destruction has not yet produced villous atrophy. Meta-analysis of 1010 patients (PMID:39153845): 33% progress to villous atrophy (95% CI 18–48%), 33% spontaneously normalize serology on gluten-containing diet, 88% of symptomatic patients improve on GFD. 43% cumulative progression at 12 years supports a disease continuum. Best predictors of progression: γδ IEL counts, age, HLA-DQB1*02 homozygosity (80% accuracy); 7-protein serum proteomic panel (>95% accuracy, PMID:37511994). The 2025 ESsCD guidelines classify potential CD as a distinct entity requiring structured follow-up.","evidence_strength":"strong","quantitative_estimate":"33% progression (95% CI 18–48%); 33% seroconversion (95% CI 17–48%); 43% cumulative at 12y","confidence_interval":"Progression: 95% CI 18–48%; seroconversion: 95% CI 17–48%","key_citations":["PMID:39153845","PMID:37511994","PMID:30764503","PMID:40999951"],"contradicts_guidelines":false,"affected_patient_population":"Seropositive individuals with architecturally normal mucosa"},{"finding_id":"6.1.6","finding":"Refractory CD Type I is likely the same T-cell disease that has become gluten-independent through chronic inflammatory self-perpetuation. IELs are polyclonal and phenotypically normal. Responds to corticosteroids. 5-year survival 80–96%. Type II IS a genuinely different disease — neoplastic transformation with monoclonal aberrant T cells (surface CD3−, intracytoplasmic CD3ε+, CD8−, CD103+), JAK-STAT pathway mutations (STAT3 78%, JAK1 44%), and progression to EATL in up to 50%. 5-year survival 44–58%. HLA-DQ2 homozygosity triples risk. RCD-II is the ONE 'subtype' that truly represents different biology.","evidence_strength":"strong","quantitative_estimate":"RCD-I: 5y survival 80–96%. RCD-II: 5y survival 44–58%, EATL progression up to 50%, STAT3 mutations 78%","confidence_interval":null,"key_citations":["PMID:41107015","PMID:38023263","PMID:36137844"],"contradicts_guidelines":false,"affected_patient_population":"CD patients non-responsive to strict GFD"},{"finding_id":"6.1.7","finding":"Tissue-specific transglutaminase autoimmunity (tTG2 gut, tTG3 skin, tTG6 brain) represents variable B-cell targeting driven by the SAME T-cell disease — not different diseases. Patient-derived monoclonal antibodies show isoform specificity without cross-reactivity (separate antibody populations), but all share the same gluten-specific CD4+ T-cell driver (hapten-carrier mechanism). Anti-tTG6 present in 40% of newly diagnosed CD (Hadjivassiliou, PMID:30885888, n=100 — NOTE primarily single-center Sheffield data requiring broader replication) with associated subcortical brain atrophy. MR spectroscopy abnormalities improved after 1 year GFD (early reversibility). Gluten ataxia patients may have tTG6 autoimmunity WITHOUT tTG2 autoimmunity — reflecting variable B-cell targeting, not absence of the T-cell disease. Dermatitis herpetiformis involves tTG3 with granular IgA deposits in dermal papillae.","evidence_strength":"strong for tTG model; moderate for tTG6 prevalence (single-center data)","quantitative_estimate":"Anti-tTG6 in 40% of new CD (single center); anti-tTG3 in ~33% of CD without DH","confidence_interval":null,"key_citations":["PMID:30885888","PMID:26676361","PMID:21278768","PMID:35328331"],"contradicts_guidelines":true,"affected_patient_population":"CD patients with extraintestinal manifestations; gluten ataxia patients"},{"finding_id":"6.1.8","finding":"Gluten ataxia classification remains genuinely unresolved. Rodrigo et al. (PMID:26676361, n=31 GA) found GA patients profile identically to NCGS: tTG2+ only 3.2%, HLA-DQ2+ 32.2%, Marsh 1 only 9.6%. However, Hadjivassiliou group (Sheffield) found 40% anti-tTG6 in newly diagnosed CD with brain atrophy. The most parsimonious resolution under the one-T-cell-disease model: GA represents tissue-specific tTG6 autoimmunity driven by the same gluten-specific T cells, with variable tTG2 antibody expression. GA patients may lack gut autoimmunity (no tTG2 antibodies) while having brain autoimmunity (tTG6 antibodies) — same T-cell driver, different B-cell target. This is a hypothesis, not established fact. Anti-tTG6 is NOT commercially available for routine testing.","evidence_strength":"moderate","quantitative_estimate":"tTG2+ 3.2% in GA vs 33.3% in CD (Rodrigo, n=31); tTG6 in 40% new CD (Hadjivassiliou, n=100)","confidence_interval":null,"key_citations":["PMID:26676361","PMID:30885888"],"contradicts_guidelines":true,"affected_patient_population":"Gluten-sensitive patients with predominant neurological features"},{"finding_id":"6.1.9","finding":"NCGS/NCWS is PROBABLY a genuinely different process from CD in the majority of cases, but the boundary is more porous than guidelines acknowledge. Evidence for separation: NCGS is dominated by innate immunity (TLR2), produces tolerogenic IgG2/IgG4 (vs pro-inflammatory IgG1/IgG3 in CD), has DECREASED intestinal permeability (opposite to CD), and shows only 16% gluten-specific response in DBPC trials (40% nocebo). Fructans produced worse symptoms than gluten in one study. Evidence for overlap: Uhde 2016 (PMID:27459152) demonstrated systemic immune activation in NCWS with elevated FABP2 (intestinal epithelial damage). Maglio 2017 (PMID:28934109) found intestinal anti-tTG2 deposits in 24% of seronegative non-CD patients, 41% of those with elevated TCRγδ/CD3 ratios. This suggests subclinical mucosal gluten-directed autoimmunity in some patients not meeting CD criteria. Some NCGS patients may harbor undetected tissue-specific tTG autoimmunity or early/pre-celiac disease.","evidence_strength":"strong for separation in majority; moderate for overlap zone","quantitative_estimate":"16% gluten-specific response in DBPC; 40% nocebo; 24% seronegative non-CD with mucosal anti-tTG2 deposits","confidence_interval":null,"key_citations":["PMID:27459152","PMID:32702369","PMID:21392369","PMID:29102613","PMID:28934109"],"contradicts_guidelines":false,"affected_patient_population":"Self-reported gluten-sensitive without CD criteria; possible CD-NCGS overlap population"},{"finding_id":"6.1.10","finding":"IEL flow cytometry (lymphogram) is a validated serology-independent diagnostic that directly measures the T-cell/IEL compartment changes that ARE the disease. Validated in 768 adults (PMID:38674808): 79% sensitivity, 98% specificity, LR+ 36.2. Complete celiac lymphogram: ≥14% TCRγδ IELs + ≤4% sCD3− IELs. OUTPERFORMED both mucosal anti-tTG2 deposits AND serology for CD diagnosis in lymphocytic enteritis. Can detect seronegative cases. Not widely available. Mucosal anti-tTG2 deposits (found in 65–100% of potential seronegative CD) represent the earliest detectable autoimmune marker but still measure antibody deposition rather than T-cell activation.","evidence_strength":"strong","quantitative_estimate":"79% sensitivity, 98% specificity, LR+ 36.2; validated in 768 adults","confidence_interval":null,"key_citations":["PMID:38674808","PMID:25010214","PMID:20409763"],"contradicts_guidelines":false,"affected_patient_population":"All suspected CD, especially seronegative and ambiguous cases"},{"finding_id":"6.1.11","finding":"Emerging T-cell based diagnostics bypass the antibody problem entirely by detecting the pathogenic mechanism rather than a downstream correlate. IL-2 whole blood assay: 90% sensitivity, 95% specificity in DQ2.5+ patients, works on GFD without gluten challenge (PMID:40499737). HLA-DQ:gluten tetramers: 97% sensitivity, 95% specificity regardless of dietary status (PMID:29146521). CRITICAL LIMITATION: IL-2 assay validated only in DQ2.5+ patients — performance in DQ8 carriers is unknown. Tetramers require specialized flow cytometry. Neither is commercially available for routine clinical use. These represent theoretically optimal diagnostics because they detect gluten-specific T cells (the pathogenic mechanism) rather than antibodies (a variable downstream consequence).","evidence_strength":"moderate","quantitative_estimate":"IL-2 assay: 90% sensitivity, 95% specificity (DQ2.5+ only); tetramers: 97%/95%","confidence_interval":null,"key_citations":["PMID:40499737","PMID:29146521"],"contradicts_guidelines":true,"affected_patient_population":"Seronegative CD; patients already on GFD; diagnostic confirmation cases"},{"finding_id":"6.1.12","finding":"The 2025 ESsCD guidelines (PMID:40999951) acknowledge important diagnostic gaps but do not adopt the T-cell disease framing. Guidelines state SNCD is rare (2–5%) but acknowledge ascertainment bias. Conditionally include bulb biopsies. Introduce no-biopsy pathway for adults with IgA-tTG2 ≥10× ULN. Define NCWS as separate from CD. Explicitly do not address: IgG subclass deficiency as cause of seronegativity, T-cell based diagnostics for seronegative cases, genotype-stratified diagnostic thresholds, or the non-pathogenic nature of anti-tTG2 antibodies.","evidence_strength":"strong","quantitative_estimate":null,"confidence_interval":null,"key_citations":["PMID:40999951"],"contradicts_guidelines":false,"affected_patient_population":"All CD patients, particularly atypical presentations"}],"biases_documented":[{"bias_type":"verification bias in serology sensitivity estimates","description":"Only 3.6% of IgA-tTG2-negative individuals referred for biopsy vs 79.2% of positives (Hujoel 2021). This inflates apparent serology sensitivity from ~57% (adjusted) to >92% (unadjusted). The verified-only populations that generate the >90% sensitivity figures are dominated by seropositive patients with classic disease. The true sensitivity in unselected populations is dramatically lower.","magnitude_estimate":"Sensitivity inflation from 57% to 92% — a 35 percentage point overestimate. Published >90% sensitivity figures cannot be used to counsel patients that negative serology excludes CD.","evidence_sources":["PMID:32433257"]},{"bias_type":"procedural bias in USCD detection (bulb biopsy omission)","description":"Before protocol standardization, only 36% of endoscopies included duodenal bulb biopsies. Standardizing to 90% compliance increased USCD detection 7-fold (0.7% to 5.4%). This is not biological variation — it is procedural non-compliance creating apparent disease rarity. The 2025 ESsCD guidelines now mandate ≥2 bulb biopsies, but real-world compliance remains unknown.","magnitude_estimate":"7x underdetection (0.7% → 5.4% USCD prevalence). True prevalence of USCD is impossible to know without universal standardized protocols.","evidence_sources":["PMID:41608837"]},{"bias_type":"serology-first cohort selection bias","description":"Virtually all characterized CD cohorts are identified through serology-first algorithms. The clinical phenotype, HLA distribution, Marsh grade spectrum, comorbidity profiles, and prognosis data for CD all derive from seropositive patients. Seronegative patients are characterized only when they are severe enough to warrant biopsy despite negative serology (survival bias), creating the paradox that diagnosed SNCD patients appear older and sicker than seropositive CD.","magnitude_estimate":"Unknown — all published natural history, phenotype, and outcome data for CD is contaminated by seropositive selection. The 'typical' CD patient described in textbooks is the typical SEROPOSITIVE CD patient.","evidence_sources":["PMID:38286391","PMID:40999951"]},{"bias_type":"conceptual bias: treating a downstream marker as disease-defining","description":"Guidelines and most studies treat positive serology as evidence FOR CD and negative serology as evidence AGAINST CD. Given that antibodies are not pathogenic (Sollid mouse injection study) and reflect damage severity / immune output capacity, this is equivalent to using fever to diagnose bacterial infection — a correlate, not the thing itself. The antibody is a downstream consequence of the T-cell response, not the response itself. This conceptual error propagates through diagnostic algorithms, prevalence estimates, clinical phenotyping, and the very definition of CD subtypes.","magnitude_estimate":"Affects all serology-dependent diagnostic pathways and prevalence estimates globally.","evidence_sources":["PMID:38670280","PMID:39048815","DOI:10.1371/journal.pone.0266543"]},{"bias_type":"HLA genotype calibration bias","description":"Diagnostic algorithms developed primarily from DQ2.5-predominant European cohorts with classic presentations. No published data exist on IgA-tTG2 sensitivity stratified by HLA genotype. USCD shows DQ2.5 in only 71% (vs 95% in conventional CD). SNCD shows DQ2.5 in only 46% (Indian cohort, n=13 — small sample, non-European population). DQ8 and DQ2.2 carriers may generate systematically lower antibody titers due to weaker immune response magnitude, but this has never been quantified.","magnitude_estimate":"Unknown — no genotype-stratified sensitivity data exist in the published literature. The entire diagnostic framework is calibrated for DQ2.5 carriers.","evidence_sources":["PMID:35489585","PMID:34712436"]},{"bias_type":"classification bias in NCGS (exclusion-based definition)","description":"NCGS/NCWS is defined by exclusion of CD and wheat allergy. If serology-first algorithms miss seronegative, ultrashort, or tissue-specific tTG autoimmunity, then the NCGS category captures an unknown proportion of patients with undetected CD subtypes. The 24% rate of mucosal anti-tTG2 deposits in seronegative non-CD patients (PMID:28934109) suggests subclinical gluten-directed autoimmunity in some patients classified as 'not CD.'","magnitude_estimate":"Unknown proportion of NCGS cohorts. NCGS prevalence estimated 0.6–13% (far exceeds CD 1%).","evidence_sources":["PMID:28934109","PMID:26676361"]}],"unproven_assumptions_identified":[{"assumption":"Negative IgA-tTG2 serology is evidence against celiac disease","evidence_against":"Antibodies are not pathogenic (mouse injection study). Antibody levels correlate with damage severity, not disease presence. Verification-bias-corrected sensitivity is 57%. EMA positivity is only 33% at Marsh 3a. Multiple mechanisms cause seronegativity in genuine CD: IgG1 deficiency affecting class switching, low secretory IgA, DQ8/DQ2.2 genotype producing lower titers, bulb-limited disease with insufficient mucosal surface area.","evidence_for":"In large screening studies, most (>90%) patients with villous atrophy have positive serology. Specificity of IgA-tTG2 is high (>95% with modern validated assays). Negative serology correctly excludes CD in the majority of tested individuals. Counterargument: the >90% figure itself is subject to verification bias.","clinical_impact":"Patients with genuine gluten-mediated T-cell enteropathy are told 'celiac unlikely' at the first diagnostic step and never reach biopsy. The entire diagnostic cascade fails at step one."},{"assumption":"CD subtypes represent distinct pathophysiological entities","evidence_against":"Core T-cell mechanism (gluten-specific CD4+ T cells + IL-7 → CD8+ IEL NKG2C/D → epithelial destruction) is conserved across seronegative, ultrashort, potential, and seropositive CD. Anti-TG2 antibodies are not pathogenic. Antibody variation is downstream. HLA genotype differences reflect quantitative variation in immune response magnitude. Natural history of potential CD (43% progression) supports a continuum. USCD's lower titers are predicted by less mucosal surface area producing antibodies.","evidence_for":"RCD-II has genuinely different biology (monoclonal T cells, JAK-STAT mutations, neoplastic transformation). USCD has statistically different HLA distribution. Some potential CD never progresses (32% seroconvert back to normal). Counterargument: the non-progression in potential CD could represent spontaneous immune tolerance rather than 'different disease.'","clinical_impact":"Framing subtypes as different diseases may delay diagnosis of seronegative patients who have the same pathogenic process. If the disease IS the T-cell response and antibodies are just a variable readout, diagnostics should target T cells, not antibodies."},{"assumption":"The 2–5% prevalence of SNCD among diagnosed CD reflects the true rate of seronegative disease","evidence_against":"This figure derives from clinically detected SNCD — patients severe enough to warrant biopsy despite negative serology. No population-based serology-independent biopsy study exists. USCD (5–11% of CD) has 28% seronegativity, suggesting an additional seronegative pool of ~1.5–3% of all CD. Verification bias means only 3.6% of seronegative patients are biopsied.","evidence_for":"Multiple clinical series consistently report SNCD at 2–5%. The 2025 ESsCD guidelines adopt this figure. Even the Hujoel verification-bias correction (57% sensitivity) implies ~43% seronegative, which is higher than 2–5% — but includes all Marsh grades, and many mild cases may not meet the VA threshold required for SNCD diagnosis.","clinical_impact":"True SNCD prevalence may be substantially higher than 2–5%, meaning CD population prevalence is underestimated and a significant pool of patients is undiagnosed."},{"assumption":"IgG subclass deficiency is not relevant to CD serology sensitivity","evidence_against":"Siniscalco (Immunity, 2025) demonstrated sequential IgM→IgG1→IgA class switching for mucosal IgA production. IgG1 deficiency can therefore impair mucosal IgA production independently of total serum IgA levels. No guideline addresses IgG subclass testing in seronegative enteropathy.","evidence_for":"No published study has directly examined IgG subclass levels in SNCD patients. The mechanism is biologically plausible but unproven in the CD context specifically. NOTE: Evidence strength is 'emerging' — mechanism demonstrated in general B-cell biology, not yet validated in CD.","clinical_impact":"A subset of SNCD may have an identifiable cause of seronegativity (IgG1 deficiency) that is never investigated, with normal total IgA masking the deficiency."},{"assumption":"Sharp categorical separation between CD and NCGS/NCWS","evidence_against":"Gluten ataxia profiles as NCGS on standard tests but may have tissue-specific tTG6 autoimmunity. 24% of seronegative non-CD have mucosal anti-tTG2 deposits. NCWS patients show objective intestinal barrier dysfunction with microbial translocation markers (Uhde 2016).","evidence_for":"NCGS has distinct innate immune dominance (TLR2), tolerogenic IgG2/IgG4, DECREASED permeability (opposite CD), only 16% gluten-specific response in DBPC. FODMAP/ATI components explain many symptoms. 40% nocebo rate. Weak HLA association. Strong evidence that the MAJORITY of NCGS is genuinely different from CD.","clinical_impact":"Risk of misclassifying borderland cases — some NCGS patients may have undetected seronegative CD or tissue-specific tTG autoimmunity and would benefit from monitoring or strict GFD."}],"overlooked_populations":[{"population":"Seronegative ultrashort CD (bulb-limited disease + negative serology)","estimated_size":"USCD is 5–11% of CD with 28% seronegativity → ~1.5–3% of all CD. Completely invisible without BOTH routine bulb biopsy AND serology-independent biopsy indication.","why_missed":"Requires two simultaneous protocol deviations from standard practice: (1) taking bulb biopsies (only 36% compliance pre-standardization), (2) biopsying despite negative serology (only 3.6% referral rate). Neither is routine.","proposed_solution":"Mandatory bulb biopsy (≥2 specimens) in all upper endoscopies; low threshold for biopsy in symptomatic patients with compatible HLA regardless of serology."},{"population":"DQ8 and DQ2.2 carriers with low-titer or seronegative CD","estimated_size":"DQ8 is 5–10% of general CD but 15% of SNCD (Indian data, n=13) and ~29% of USCD is non-DQ2.5. These genotypes may preferentially develop milder, harder-to-detect forms.","why_missed":"Diagnostic algorithms calibrated for DQ2.5-driven high-titer disease. No genotype-stratified sensitivity data exist. DQ8 patients may produce systematically lower tTG2 titers due to weaker immune response magnitude.","proposed_solution":"Genotype-stratified diagnostic thresholds; lower tTG2 cutoffs for DQ8/DQ2.2; routine biopsy in symptomatic non-DQ2.5 carriers regardless of titer."},{"population":"Patients with IgG1 subclass deficiency affecting mucosal IgA production","estimated_size":"Unknown — IgG1 subclass profiling is not part of CD workup anywhere","why_missed":"Sequential class-switching pathway (IgM→IgG1→IgA, Siniscalco 2025) means IgG1 deficiency impairs mucosal IgA independently of total serum IgA. These patients have normal total IgA but deficient mucosal IgA anti-tTG2. Standard IgA deficiency screening (total serum IgA) would miss them entirely.","proposed_solution":"IgG subclass testing in seronegative enteropathy; secretory IgA measurement; investigation of B-cell class switching in SNCD populations."},{"population":"Patients with isolated neurological gluten autoimmunity (anti-tTG6+, anti-tTG2−)","estimated_size":"Gluten ataxia is ~15% of all ataxias in some series (Sheffield data); <10% have GI symptoms","why_missed":"Anti-tTG6 not commercially available. Neurological symptoms outside gastroenterology paradigm. Standard CD screening uses tTG2 only. If GA is driven by tTG6 autoimmunity with absent tTG2 response, current CD screening is irrelevant.","proposed_solution":"Commercial tTG6 assay development; routine testing in idiopathic ataxia/neuropathy; neurological screening in newly diagnosed CD (40% have anti-tTG6)."},{"population":"NCGS patients harboring undetected tissue-specific gluten autoimmunity or seronegative CD","estimated_size":"NCGS prevalence 0.6–13% (far exceeds CD). 24% of seronegative non-CD have mucosal anti-tTG2 deposits. Unknown fraction represents missed CD subtypes.","why_missed":"NCGS is diagnosed by exclusion using serology-first algorithms. Patients with negative serology and no VA on standard (non-bulb) biopsies are classified as NCGS without IEL flow cytometry, mucosal tTG2 deposits, bulb biopsies, or tTG6 testing.","proposed_solution":"Comprehensive workup in NCGS patients: HLA typing, IEL lymphogram, bulb biopsy, mucosal anti-tTG2 deposits, tTG6 testing, 5+ year follow-up."},{"population":"Patients whose T-cell response is active but antibody production is impaired by any mechanism","estimated_size":"Unknown — this is the aggregate population encompassing all causes of seronegativity in the presence of active T-cell disease","why_missed":"Current diagnosis gates entirely on antibody detection. If antibodies are downstream markers and not pathogenic, then ANY condition impairing antibody production creates a diagnostic blind spot without affecting the actual disease.","proposed_solution":"T-cell based diagnostics (IL-2 assay, HLA-DQ:gluten tetramers) that bypass the antibody step entirely."}],"diagnostic_step_sensitivity":{"step_name":"IgA-tTG2 serology as proxy for T-cell mediated celiac disease","reported_sensitivity":"90.7% overall (population average dominated by classic seropositive CD with DQ2.5 and Marsh 3b–3c)","adjusted_sensitivity":"57.1% (95% CI 35.4–76.4%) after verification bias correction (Hujoel 2021). By subtype: classic DQ2.5 Marsh 3b–3c likely >95%; USCD ~72% (28% seronegative); SNCD 0% by definition; neurological gluten sensitivity (tTG2 only) ~3.2%. EMA sensitivity at Marsh 3a: 33% vs 77% at total VA. No data exist stratified by HLA genotype.","false_negative_rate":"Classic: <5%. USCD: ~28% serology false-negative + additional cases missed by absent bulb biopsy. SNCD: 100% serology false-negative. Neurological: >96% if using tTG2 only. Compound: a DQ8 patient with bulb-limited Marsh 3a, low IgG1, and low secretory IgA has near-100% probability of false-negative serology while having fully active T-cell disease.","key_limitations":["Detects a downstream marker (antibodies), not the pathogenic mechanism (T-cell response). Antibodies are not pathogenic (Sollid mouse injection study).","Sensitivity varies dramatically by Marsh grade: 33% at Marsh 3a vs 77% at total VA for EMA","No sensitivity data stratified by HLA genotype (DQ2.5 vs DQ8 vs DQ2.2) — this is a critical unmeasured variable","Verification bias inflates apparent sensitivity: only 3.6% of seronegative patients referred for biopsy","Bulb biopsy omission (64% non-compliance pre-standardization) adds additional false-negative channel for bulb-limited disease","IgG1 subclass deficiency can impair mucosal IgA production independently of total serum IgA — not screened for","Specificity depends on assay generation: 87.4% with older mixed assays (PMID:35043426) vs 97% with modern CLIA (PMID:39125307)","T-cell based alternatives exist but are not in clinical use: IL-2 assay 90%/95% (DQ2.5+ only), tetramers 97%/95%","IEL lymphogram validated (79% sensitivity, 98% specificity, LR+ 36.2) but not widely available"]},"contradictory_studies":[{"citation":"Sollid group: Injection of prototypic celiac anti-TG2 antibodies causes no enteropathy in immunocompetent mice (PLOS ONE 2022)","pmid":null,"finding":"Secreted anti-TG2 antibodies do not play a major role in enteropathy development. B cells may matter as antigen-presenting cells amplifying T-cell response, but their secreted antibodies are not pathogenic.","contradicts":"All diagnostic frameworks using antibody presence/absence as evidence for/against CD. If antibodies are not pathogenic, negative serology cannot exclude the disease — it can only indicate the downstream marker is absent."},{"citation":"Santos et al. 2024 — IL-7 as the pathogenic mediator in Nature organoid model","pmid":"39048815","finding":"IL-7 produced by lamina propria mesenchyme is the gluten-inducible modulator necessary and sufficient for epithelial destruction via NKG2C/D on CD8+ T cells. The damage pathway is IL-7 → CD8+ T cell NKG2C/D → epithelial destruction, with antibody production as a parallel but non-pathogenic output.","contradicts":"Any model placing antibody production in the pathogenic cascade or using antibody levels to gauge disease severity."},{"citation":"Moreira González et al. 2026 — Standardized bulb biopsy increases USCD detection sevenfold","pmid":"41608837","finding":"Standardizing bulb biopsy compliance from 36% to 90% increased USCD detection from 0.7% to 5.4% — a 7-fold increase entirely attributable to procedural compliance, not biological variation.","contradicts":"Assumption that current endoscopic protocols adequately detect CD. USCD prevalence is an artifact of biopsy compliance."},{"citation":"Rodrigo et al. 2016 — Gluten ataxia profiles as NCGS rather than CD","pmid":"26676361","finding":"GA patients (n=31): tTG2+ 3.2%, DQ2+ 32.2%, Marsh 1 only 9.6% — profiles identical to NCGS, not CD. Contested by Sheffield group (Hadjivassiliou) who finds GA is autoimmune (tTG6-mediated).","contradicts":"Classification of GA as autoimmune CD manifestation (Sapone 2012 consensus, ESsCD guidelines). Under one-T-cell-disease model, GA may have same T-cell driver with different B-cell target (tTG6 instead of tTG2)."},{"citation":"Maglio et al. 2017 — Intestinal anti-tTG2 in non-CD patients","pmid":"28934109","finding":"24% of seronegative non-CD patients produced intestinal anti-tTG2 antibodies; 41% of those had elevated TCRγδ/CD3 ratios suggesting T-cell activation.","contradicts":"Binary CD/not-CD classification. Suggests continuum of mucosal gluten-directed immune response — though may represent non-specific inflammation rather than pre-celiac autoimmunity."},{"citation":"Hujoel et al. 2021 — Verification bias correction for tTG2 sensitivity","pmid":"32433257","finding":"Verification-bias-corrected IgA-tTG2 sensitivity is 57.1% (95% CI 35.4–76.4%), dramatically lower than the >90% widely cited. Only 3.6% of seronegative patients were referred for biopsy.","contradicts":"All guidelines and clinical teaching citing >90% sensitivity for IgA-tTG2. The widely quoted figure is inflated by verification bias."}],"research_gaps":[{"gap":"No study has compared T-cell responses (IL-2 assay, HLA-DQ:gluten tetramer counts) between seropositive CD, seronegative CD, and NCGS to confirm whether the T-cell disease is identical across serostatus","importance":"high","proposed_study_design":"Prospective comparison of gluten-specific CD4+ T-cell frequencies (tetramers) and IL-2 release (whole blood assay) in matched seropositive CD, SNCD, potential CD, USCD, and NCGS cohorts. Would definitively confirm or refute the one-T-cell-disease hypothesis. Include DQ8 carriers specifically."},{"gap":"No population-based serology-independent biopsy study to determine true CD prevalence and true serology sensitivity","importance":"high","proposed_study_design":"Large cohort (>5000) with universal upper endoscopy + systematic D1 bulb (≥2 biopsies) and D2 (≥4 biopsies) + complete serology + HLA typing, regardless of symptoms or serology. Finnish/Swedish screening cohorts could be extended. Would provide the first unbiased denominator for sensitivity calculations."},{"gap":"No published data on IgA-tTG2 sensitivity stratified by HLA genotype (DQ2.5 vs DQ8 vs DQ2.2)","importance":"high","proposed_study_design":"Retrospective analysis of large CD biobanks (CeD-Lasso, PreventCD, others) correlating HLA genotype with tTG2 titer at diagnosis, Marsh grade, and anatomical distribution. Would reveal whether DQ8 carriers have systematically lower titers."},{"gap":"IgG1 subclass deficiency as a mechanism for CD seronegativity has never been investigated","importance":"high","proposed_study_design":"Cross-sectional IgG subclass profiling in SNCD vs seropositive CD, with correlation to secretory IgA levels and mucosal anti-tTG2 deposits. Functional B-cell class switching analysis in SNCD patients."},{"gap":"Anti-tTG6 testing not commercially available despite 40% prevalence in newly diagnosed CD","importance":"high","proposed_study_design":"Commercial tTG6 ELISA development and standardization; prospective tTG6 screening in all new CD with neurological assessment; population-based tTG6 in idiopathic ataxia cohorts across multiple centers (not just Sheffield)."},{"gap":"Overlap between NCGS and seronegative/subthreshold CD subtypes has not been systematically studied","importance":"high","proposed_study_design":"Prospective study of well-characterized NCGS patients (DBPC-confirmed gluten sensitivity) with HLA typing, IEL flow cytometry, mucosal anti-tTG2 deposits, anti-tTG6, mandatory bulb biopsies, and 5+ year follow-up for CD development."},{"gap":"Clinical implementation and cost-effectiveness of T-cell based diagnostics vs serology-first algorithms","importance":"high","proposed_study_design":"Real-world diagnostic accuracy trials comparing IL-2/tetramer-first vs serology-first algorithms in symptomatic populations, with full biopsy follow-up regardless of test results. Must include DQ8 carriers (IL-2 assay currently validated only for DQ2.5+)."}],"differential_diagnoses_relevant":[{"condition":"Non-celiac wheat sensitivity (NCWS/NCGS)","overlap_with_cd":"Symptom overlap extensive. 24% seronegative non-CD have mucosal anti-tTG2 deposits. Gluten ataxia profiles as NCGS on standard tests. Some NCGS may harbor undetected mild/seronegative CD or tissue-specific tTG autoimmunity. NCGS prevalence 0.6–13% (far exceeds CD).","distinguishing_features":"NCGS: innate immune dominance (TLR2), tolerogenic IgG2/IgG4, decreased permeability, 16% gluten-specific in DBPC (40% nocebo), FODMAP/ATI components, no villous atrophy. CD: adaptive T-cell immunity, IL-7 mediated, IgG1/IgG3, increased permeability, villous atrophy. IEL lymphogram may distinguish (79% sensitivity CD, negative in NCGS)."},{"condition":"Selective IgA deficiency","overlap_with_cd":"False-negative IgA-tTG2. Affects 2–3% of CD patients vs 0.2% general population (10-fold enrichment).","distinguishing_features":"Total IgA <7 mg/dL. Requires IgG-based serology (IgG-DGP, IgG-tTG2). Partial IgA deficiency (7–70 mg/dL) is a grey zone not addressed by most guidelines."},{"condition":"Common variable immunodeficiency (CVID)","overlap_with_cd":"Villous atrophy histologically indistinguishable from CD. Impaired antibody production → seronegative. 8% of CVID patients have VA.","distinguishing_features":"Low immunoglobulins across multiple classes. Absent or reduced plasma cells on biopsy (a key discriminator). Recurrent sinopulmonary infections. Does not respond to GFD."},{"condition":"Drug-induced enteropathy (olmesartan, mycophenolate, others)","overlap_with_cd":"Villous atrophy identical to CD. Seronegative. Can have increased IELs.","distinguishing_features":"Temporal relationship with drug initiation. Resolution after drug withdrawal (weeks to months). No HLA-DQ2/DQ8 requirement. No response to GFD."},{"condition":"Autoimmune enteropathy","overlap_with_cd":"Villous atrophy, seronegative for CD markers. Can be severe.","distinguishing_features":"Anti-enterocyte antibodies (75 kDa antigen). Anti-goblet cell antibodies. Often more severe, refractory course. May respond to immunosuppression."},{"condition":"Tropical sprue","overlap_with_cd":"Villous atrophy + malabsorption. Can mimic CD histologically.","distinguishing_features":"Tropical exposure history. Responds to antibiotics (tetracycline). Folate/B12 deficiency prominent. No HLA association."},{"condition":"Giardiasis","overlap_with_cd":"Can cause villous atrophy and increased IELs. Seronegative for CD markers.","distinguishing_features":"Giardia trophozoites/cysts on stool or biopsy. Responds to metronidazole. Travel history."}],"recommendations":[{"recommendation":"Reframe CD as one T-cell mediated disease with variable antibody expression. Stop treating negative serology as evidence against CD in symptomatic patients with compatible HLA genotype. Exception: RCD-II is genuinely different (neoplastic transformation).","target":"guidelines","evidence_basis":"Antibodies are not pathogenic (Sollid group mouse injection study 2022). IL-7/T-cell axis is the pathogenic mechanism (Santos et al. 2024 Nature). Serology detects a downstream correlate, not the disease itself. Subtypes share the same core pathogenic T-cell process."},{"recommendation":"Prioritize development and clinical implementation of T-cell based diagnostics (IL-2 whole blood assay, HLA-DQ:gluten tetramers) as they detect the pathogenic mechanism rather than a variable downstream marker. Ensure validation includes DQ8 carriers.","target":"researchers, diagnostics industry, guidelines","evidence_basis":"IL-2 assay: 90% sensitivity, 95% specificity, works on GFD (PMID:40499737). Tetramers: 97%/95% (PMID:29146521). These bypass the antibody production bottleneck entirely. Currently validated only for DQ2.5+ (IL-2 assay) — DQ8 validation is critical."},{"recommendation":"Mandatory standardized duodenal bulb biopsy (≥2 specimens from 9- and 12-o'clock positions) in all upper endoscopies, not only when CD is suspected.","target":"clinicians, guidelines, endoscopy units","evidence_basis":"2026 Spanish study (PMID:41608837): standardizing protocol increased USCD detection 7-fold. 2025 ESsCD guidelines conditionally include bulb biopsies. USCD is 5–11% of CD and invisible without bulb sampling."},{"recommendation":"Adopt IEL flow cytometry (lymphogram) as second-line diagnostic for seronegative and ambiguous cases.","target":"clinicians, guidelines","evidence_basis":"Validated in 768 adults: 79% sensitivity, 98% specificity, LR+ 36.2 (PMID:38674808). Directly measures T-cell/IEL changes that ARE the disease rather than antibody production. Outperformed serology and mucosal deposits in lymphocytic enteritis."},{"recommendation":"Investigate IgG subclass deficiency in all seronegative enteropathy patients. Include secretory IgA measurement in stool.","target":"clinicians, researchers","evidence_basis":"Sequential class switching (IgM→IgG1→IgA, Siniscalco 2025 Immunity) means IgG1 deficiency impairs mucosal IgA independently of total serum IgA. No guideline currently addresses this mechanism."},{"recommendation":"Develop genotype-stratified diagnostic thresholds for IgA-tTG2, particularly lower cutoffs for DQ8 and DQ2.2 carriers.","target":"researchers","evidence_basis":"No published sensitivity data by genotype exist. USCD has more DQ8/DQ2.2 and lower titers. SNCD has shifted HLA distribution (Indian data, n=13). DQ8 carriers may need different diagnostic thresholds."},{"recommendation":"Develop commercial anti-tTG6 assay and include in workup for neurological symptoms and idiopathic ataxia. Conduct multi-center validation (not only Sheffield).","target":"researchers, diagnostics industry","evidence_basis":"40% of new CD has anti-tTG6 with subcortical brain atrophy (PMID:30885888). Gluten ataxia is ~15% of all ataxias. Anti-tTG6 not commercially available. Existing data primarily from single center."},{"recommendation":"Comprehensively investigate NCGS cohorts for occult CD subtypes using IEL lymphogram, mucosal anti-tTG2 deposits, bulb biopsies, tTG6 testing, and long-term follow-up.","target":"researchers","evidence_basis":"24% of seronegative non-CD have mucosal anti-tTG2 deposits (PMID:28934109). NCGS is an exclusion diagnosis dependent on the sensitivity of the CD tests used. Gluten ataxia profiles as NCGS on standard screening."},{"recommendation":"For the reference patient (DQ8, Marsh 3A, all serology <1, low IgG1, low secretory IgA): this patient has the SAME T-cell disease as seropositive CD patients but cannot produce the diagnostic antibody signal. Recommended workup: IEL flow cytometry (lymphogram), mucosal anti-tTG2 deposits on biopsy, IgG subclass panel, secretory IgA quantification, confirm bulb biopsies were taken, GFD trial with follow-up biopsy at 12 months. If available: IL-2 whole blood assay or HLA-DQ:gluten tetramers.","target":"clinicians","evidence_basis":"Patient represents compound diagnostic failure: DQ8 (lower response magnitude) + IgG1 deficiency (impaired class switching per Siniscalco 2025) + Marsh 3a (EMA sensitivity only 33% at this grade) + possible bulb-limited component. Every layer of failure is independently documented; combined probability of false-negative serology approaches 100%. T-cell based tests would bypass all these failure modes."}],"meta_analysis_summary":{"studies_reviewed":50,"total_patients":null,"pooled_estimates":{"IgA_tTG2_unadjusted_sensitivity":"90.7%","IgA_tTG2_verification_bias_adjusted_sensitivity":"57.1% (95% CI 35.4–76.4%)","IgA_tTG2_specificity_older_mixed_assays":"87.4% (95% CI 84.4–90.0%, Sheppard 2022, 5 studies)","IgA_tTG2_specificity_modern_CLIA":"97% (95% CI 94–99%, 2024 meta-analysis)","EMA_sensitivity_at_Marsh_3a":"33%","EMA_sensitivity_at_total_VA":"77%","USCD_prevalence_among_CD":"5–11%","USCD_detection_increase_with_bulb_standardization":"7-fold (0.7% → 5.4%)","USCD_seronegativity_rate":"28%","USCD_DQ2_5_prevalence":"71% (vs 95% conventional CD)","SNCD_prevalence_among_diagnosed_CD":"2–5% (verification-bias minimum)","SNCD_HLA_DQ2_5_Indian_cohort":"46% (n=13, low confidence)","potential_CD_progression_to_VA":"33% (95% CI 18–48%)","potential_CD_seroconversion_to_normal":"33% (95% CI 17–48%)","potential_CD_cumulative_progression_12y":"43%","RCD_II_5y_survival":"44–58%","RCD_II_EATL_progression":"up to 50%","RCD_II_STAT3_mutations":"78%","anti_tTG6_prevalence_in_new_CD":"40% (single center)","IEL_lymphogram_sensitivity":"79%","IEL_lymphogram_specificity":"98%","IEL_lymphogram_LR_positive":"36.2","IL2_assay_sensitivity":"90% (DQ2.5+ only)","IL2_assay_specificity":"95%","tetramer_sensitivity":"97%","tetramer_specificity":"95%","NCGS_gluten_specific_response_DBPC":"16%","NCGS_nocebo_rate":"40%","mucosal_anti_tTG2_in_seronegative_non_CD":"24%"},"heterogeneity_notes":"Very high heterogeneity for potential CD outcomes (I² 93–96%). USCD prevalence varies dramatically with biopsy protocol compliance. SNCD prevalence confounded by varying exclusion criteria and verification bias. Anti-tTG6 data primarily from single center (Sheffield, UK) — multi-center replication needed. IEL lymphogram validated in one large Spanish cohort (n=768). IL-2 assay validated only in DQ2.5+ patients — DQ8 performance unknown. Indian SNCD HLA data from n=13 (high uncertainty). Specificity figures depend on assay generation (87% older vs 97% modern CLIA). Hujoel verification-bias correction is from a single US center — replication in other settings needed."}}
