{"research_topic_id":"6.2","research_topic_title":"Promising Celiac Disease Biomarkers Outside Current Guidelines","date_completed":"2026-02-08","revision":"v2 — corrected per peer review from Grok 4.1 and Opus 4.6","executive_summary":"Multiple alternative biomarkers show strong diagnostic potential for celiac disease beyond standard serology, with flow cytometry IEL phenotyping emerging as the most robust (pooled sensitivity 93%, specificity 98%; range 79–98.5% across validation cohorts), particularly for seronegative CD where it outperforms both tissue tTG2-IgA deposits and serology. Tissue tTG2-IgA deposits show near-100% sensitivity in seropositive untreated CD but only 66% in seronegative patients and have a 24% false-positive rate in seronegative non-CD (Maglio 2017), with additional IgA-dependency limiting utility in immunoglobulin-deficient patients. Adoption barriers including lack of international standardization, geographic concentration of evidence (primarily Spanish centers), and need for fresh biopsy tissue have prevented guideline integration despite over a decade of consistently positive data.","peer_review_response":{"reviews_received":["Grok 4.1 independent analysis and peer review","Opus 4.6 independent narrative report and peer review"],"corrections_accepted":["Executive summary specificity changed from '95-98%' to '98%' (meta-analysis) — the 95% figure was from TCRγδ-alone, not celiac lymphogram","Added Koskinen 2010 (PMID:19779364, n=515): 100% sensitivity in 261 untreated CD, 82% specificity, deposits persist faintly in 56% long-term GFD","Added Maglio 2017 (PMID:28934109): 24% of seronegative non-CD patients have intestinal tTG2-IgA deposits — critical specificity limitation","Added Adriaanse 2017 (PMID:28819290): I-FABP multicentre pediatric study showing 92.1% sensitivity, 87.7% specificity at 450 pg/mL; PPV 100% combined with serology+HLA","Added Camarero 2021 (PMID:34757327, n=1,211): largest pediatric IEL flow cytometry validation, 89.7% sensitivity, 100% specificity","Added Fernández-Bañares 2020 (PMID:32048756, n=67): prospective multicenter study specifically in seronegative VA, celiac lymphogram 87% sensitivity/96.7% specificity","Added Siniscalco 2025 citation: PMID:41253159, DOI:10.1016/j.immuni.2025.10.022 (Immunity)","Added Valitutti 2022 (PMID:34844876): FFPE immunohistochemistry adaptation for tTG2-IgA deposits, 100% sensitivity in 32 pediatric CD","Added Ruiz-Ramírez 2021 (PMID:34063411/PMC8155844): validation cohort showing 82% sensitivity, 100% specificity for complete CD pattern","Added geographic concentration as explicit bias entry","Added HLA-DQ tetramer T-cell detection and anti-actin antibodies as research gaps","Added Salmi 2006 (PMID:16571636, PMID:16886921): key seronegative deposit and predictive studies","Estimated total_patients at ~3,500 across all key studies (was null)","Clarified PMID:41033728 is a comprehensive review paper (Bakhtiari & Rostami-Nejad) covering multiple biomarker categories","Reconciled Basu citation: PMID:35300471 = PMC8862495 (same paper, published online 2021, in print 2022)","Added null-hypothesis counterarguments to key findings per project protocol"],"corrections_rejected":[{"claim":"Grok 4.1 ranked tissue tTG2-IgA deposits as #1 for seronegative CD, above flow cytometry","reason":"Evidence clearly shows flow cytometry outperforms deposits in seronegative CD. Head-to-head comparison (PMID:25010214): flow cytometry 95% vs deposits 60% in lymphocytic enteritis. Prospective seronegative VA study (PMID:32048756): lymphogram 87% sens/96.7% spec. Deposits only 66% sensitive in seronegative children (PMID:18728524) with 24% false-positive in seronegative non-CD (PMID:28934109). Additionally, deposits are IgA-dependent, failing in IgA-impaired patients (reference patient profile). Flow cytometry is IgA-independent."},{"claim":"Grok 4.1 stated IEL flow cytometry studies excluded seronegative patients, citing only PMC8155844","reason":"Multiple studies specifically include seronegative CD: PMID:31057009 (Ríos León 2019, n=315, 8.3% seronegative with identical IEL patterns); PMID:32048756 (Fernández-Bañares 2020, n=67, prospective seronegative VA study across 5 centers). Grok cited a single validation study (PMC8155844) that happened to be seropositive-focused, but this does not represent the full evidence base."},{"claim":"Grok 4.1 reported IEL flow cytometry sensitivity as 82% (75-88%) as the primary estimate","reason":"The 82% figure comes from a single validation cohort (Ruiz-Ramírez 2021, PMID:34063411) using complete CD pattern criteria. The meta-analysis (PMID:31443602) pooling 6 studies reports 93% sensitivity with AUC 0.98. The Cambridge UK validation (PMID:35300471) reports 98.5% sensitivity using a different discriminant function. The range should be presented as 79-98.5% across validation cohorts, with the meta-analysis pooled estimate of 93% as the best central estimate."},{"claim":"Grok 4.1 described tissue tTG2-IgA deposits as '~100% detection in active CD' without qualification","reason":"The ~100% figure (Koskinen 2010, PMID:19779364) applies to untreated seropositive CD. In seronegative CD — the population where alternative biomarkers are most needed — sensitivity drops to 66% (Tosco 2008, PMID:18728524). Additionally, Maglio 2017 (PMID:28934109) showed 24% of seronegative non-CD patients produce intestinal tTG2-IgA deposits, substantially limiting PPV in the target population. The '~100%' claim without these qualifications is misleading."}]},"key_findings":[{"finding_id":"6.2.1","finding":"Flow cytometry IEL lymphogram (increased TCRγδ+ IELs, decreased CD3- IELs) achieves pooled sensitivity of 93% and specificity of 98% in meta-analysis of 519 patients and 440 controls (AUC 0.98). Performance varies across validation cohorts: Basu 2022 UK validation (98.5% sens/97.7% spec using discriminant function), Camarero 2021 largest pediatric cohort (89.7% sens/100% spec, n=1,211), Ruiz-Ramírez 2021 (82% sens/100% spec, complete pattern), García-Hoz 2024 largest adult cohort (79% sens/>97% spec, n=768). The range reflects spectrum bias and protocol variability — broader, less pre-selected cohorts show lower sensitivity.","evidence_strength":"strong","quantitative_estimate":"Sensitivity 79-98.5% (pooled 93%), Specificity 97-100% (pooled 98%), AUC 0.98 (95% CI 0.97-0.99)","confidence_interval":"AUC 0.97 (95% CI 0.95-0.98) for TCRγδ alone; AUC 0.98 (95% CI 0.97-0.99) for celiac lymphogram","key_citations":["PMID:31443602","PMID:35300471","PMID:34757327","PMID:34063411","PMID:38674808"],"contradicts_guidelines":true,"affected_patient_population":"All CD patients including seronegative, potential, and GFD-treated patients","null_hypothesis_counterargument":"The conventional view is approximately correct that serology captures >90% of CD and alternative tests are rarely needed. Flow cytometry requires biopsy and thus cannot replace serology as a screening test — it only supplements it. The comparison between flow cytometry and serology is somewhat apples-to-oranges (tissue test vs blood test). However, the point is not replacement but rescue of the 5-10% missed by serology, plus added diagnostic certainty in borderline cases."},{"finding_id":"6.2.2","finding":"Flow cytometry IEL pattern is IDENTICAL in seronegative and seropositive CD patients, confirmed in dedicated studies. In a cohort of 315 CD patients (8.3% seronegative, PMID:31057009), the IEL immunophenotype showed similar celiac patterns regardless of serological status. A prospective multicenter study of 67 consecutive patients with seronegative villous atrophy (PMID:32048756) showed the celiac lymphogram achieved 87% sensitivity and 96.7% specificity for distinguishing seronegative CD from non-celiac causes. Seronegative patients were more likely DQ8-positive (23.1% vs 2.5%) and had milder histology (Marsh I: 34.6% vs 3.7%).","evidence_strength":"strong","quantitative_estimate":"87% sensitivity, 96.7% specificity in seronegative VA (prospective multicenter); identical IEL pattern in seronegative vs seropositive; seronegative prevalence 8.3%","confidence_interval":"Lymphogram sensitivity CI 73.7-95%, specificity CI 82.7-99.9% in seronegative VA","key_citations":["PMID:31057009","PMID:32048756","PMID:25010214"],"contradicts_guidelines":true,"affected_patient_population":"Seronegative CD patients, especially DQ8-positive with mild histology","null_hypothesis_counterargument":"The seronegative patients identified in these studies were found because they had biopsies for other reasons (symptoms, at-risk screening) — creating selection bias toward more severe seronegative cases. Milder seronegative cases might not show the same IEL pattern. Additionally, the seronegative VA study had only n=67, limiting precision. However, the Ríos León cohort (n=315) is reasonably sized and the consistent finding across centers strengthens the evidence."},{"finding_id":"6.2.3","finding":"Flow cytometry IEL pattern outperforms both tissue tTG2-IgA deposits and serology for diagnosing CD in lymphocytic enteritis (Marsh 1). In a head-to-head comparison (205 patients), the CD cytometric pattern diagnosed 95% of CD cases in lymphocytic enteritis vs 60% for tTG2-IgA deposits vs 60% for serology (p=0.039). This is critical because Marsh 1 lesions are where diagnostic uncertainty is highest.","evidence_strength":"strong","quantitative_estimate":"95% vs 60% vs 60% diagnostic accuracy in lymphocytic enteritis","confidence_interval":null,"key_citations":["PMID:25010214"],"contradicts_guidelines":true,"affected_patient_population":"Patients with lymphocytic enteritis (Marsh 1) both seropositive and seronegative","null_hypothesis_counterargument":"This is a single study from the same Fernández-Bañares group that developed the lymphogram, raising possible operator expertise bias. Independent replication in lymphocytic enteritis specifically is needed. However, the comparison was performed within the same cohort with the same patients, reducing inter-study confounding."},{"finding_id":"6.2.4","finding":"Intestinal mucosal tTG2-IgA deposits show highly variable sensitivity depending on population tested. In untreated seropositive CD: 100% sensitivity (Koskinen 2010, n=261), 82% specificity. In seropositive children with normal villi: 85% (Tosco 2008). In seronegative children with elevated γδ IELs: only 66%. Critically, Maglio 2017 found 24% of seronegative non-CD patients produced anti-tTG2 autoantibodies at intestinal level, substantially limiting positive predictive value in the seronegative population where alternative biomarkers are most needed. Deposits persist faintly in 56% of long-term treated patients. Salmi 2006 showed 93% sensitivity/93% specificity for predicting subsequent CD development from initially normal histology.","evidence_strength":"moderate","quantitative_estimate":"Sensitivity: 100% in seropositive untreated CD, 66-85% in seronegative/potential CD; Specificity: 76-100% but 24% false-positive in seronegative non-CD","confidence_interval":null,"key_citations":["PMID:19779364","PMID:18852635","PMID:18728524","PMID:28934109","PMID:16571636","PMID:16886921","PMID:34844876"],"contradicts_guidelines":false,"affected_patient_population":"Early-stage/potential CD; caution in seronegative population due to 24% false-positive rate","null_hypothesis_counterargument":"The Koskinen 2010 study with 100% sensitivity in untreated CD is large (n=261) and from the expert Tampere group. Deposits are a biologically grounded marker of disease autoimmunity. The 24% false-positive rate (Maglio 2017) may represent pre-clinical CD that hasn't yet developed, not true false positives. However, the IgA-dependency and reduced seronegative sensitivity are hard limitations, and the FFPE adaptation (Valitutti 2022, n=61) needs much larger validation."},{"finding_id":"6.2.5","finding":"tTG2-IgA deposits depend on mucosal IgA production and thus have a critical limitation for the reference patient profile. Siniscalco et al. (Immunity 2025, PMID:41253159) demonstrated that antigen-specific gut IgA is generated via sequential IgM→IgG1→IgA class switching, with IgG1 GC B cells generating mucosal IgA. A patient with low IgG1 subclass and low secretory IgA may have impaired sequential class switching, meaning mucosal tTG2-IgA deposits could be absent or weak despite active disease. This makes flow cytometry the superior rescue test for immunoglobulin-deficient profiles.","evidence_strength":"moderate","quantitative_estimate":null,"confidence_interval":null,"key_citations":["PMID:41253159","PMID:18728524","PMID:25010214"],"contradicts_guidelines":false,"affected_patient_population":"Patients with IgG1 deficiency and/or low secretory IgA","null_hypothesis_counterargument":"The Siniscalco 2025 study was conducted primarily in mice, with human data confirming a 'similar relationship' but not definitively proving quantitative IgG1-dependence of mucosal IgA in CD specifically. Not all mucosal IgA requires IgG1 intermediates — direct IgM→IgA switching also occurs. The reference patient's low IgG1 may have other causes. However, the biological plausibility is strong and the Tosco 2008 data (34% of seronegative children lack deposits) is consistent with this mechanism."},{"finding_id":"6.2.6","finding":"I-FABP evidence is more mixed than originally presented. The strongest evidence comes from Adriaanse 2017 (PMID:28819290, multicentre pediatric, n=170): at 450 pg/mL cutoff, sensitivity 92.1% and specificity 87.7%, PPV 87.5%. Combined with positive serology and HLA, PPV reached 100%. I-FABP was particularly valuable in children with borderline serology (tTG <10× ULN), where 14/30 (46.7%) with elevated I-FABP had biopsy-confirmed CD. However, in adult patients with low tTG levels, I-FABP alone did not significantly differentiate biopsy-proven CD from non-CD (median 725 vs 497 pg/mL, p=0.13, PMID:29383769). 80% of children normalized within 12 weeks of GFD. Non-specific: elevated in mesenteric ischemia, NEC, IBD, acute pancreatitis, intense exercise.","evidence_strength":"moderate","quantitative_estimate":"Pediatric: 92.1% sensitivity, 87.7% specificity at 450 pg/mL; PPV 100% with serology+HLA. Adult low-tTG: not significant standalone (p=0.13). Cut-offs vary 224-920 pg/mL across studies.","confidence_interval":null,"key_citations":["PMID:28819290","PMID:29383769","PMID:35841826","PMID:26726140"],"contradicts_guidelines":false,"affected_patient_population":"Active CD assessment; strongest in pediatric borderline serology; limited in seronegative CD (not formally tested)","null_hypothesis_counterargument":"I-FABP is a genuine marker of enterocyte damage with strong biological rationale. The Adriaanse 2017 study is well-designed (prospective, multicentre). However, the non-specificity and variable cut-offs across platforms are fundamental limitations. I-FABP cannot distinguish CD from other enteropathies. Its best role is as an adjunct, not standalone."},{"finding_id":"6.2.7","finding":"REG Iα protein is significantly elevated in serum of active CD patients compared to controls and decreases with GFD. However, evidence is limited to a single small study (Planas et al. 2011, n=40) with no independent validation in 15 years. The urinary assay failed to discriminate CD from controls (Ruíz-Ortiz 2013, PMID:23312007). REG Iα is also elevated in pancreatitis, IBD (up to 40-fold), gastric cancer, and type 1 diabetes. Reviewed in Bakhtiari & Rostami-Nejad 2025 (PMID:41033728, comprehensive review covering multiple biomarkers).","evidence_strength":"weak","quantitative_estimate":"Significant increase in CD vs controls; normalizes on GFD; no formal sensitivity/specificity/cut-offs published","confidence_interval":null,"key_citations":["PMID:21867979","PMID:23388848","PMID:23312007","PMID:41033728"],"contradicts_guidelines":false,"affected_patient_population":"Active CD patients; not tested in seronegative CD","null_hypothesis_counterargument":"The lack of replication after 15 years is itself informative — if REG Iα were a strong biomarker, independent groups would likely have validated it. Publication bias may have inflated the initial positive finding."},{"finding_id":"6.2.8","finding":"53 circulating miRNAs identified as differentially expressed between CD and controls in the PreventCD birth cohort (PMID:34950132). Eight miRNAs were altered >1 year (some >2 years) before seroconversion. 15/53 concordant in duodenal biopsies suggesting intestinal origin. A separate 3-miRNA panel (miR-192-5p, miR-215-5p, miR-125b-5p; Felli et al. 2022) reportedly discriminates active CD, GFD-treated CD, and controls including low-tTG patients. PBMCs miR-146a and miR-155 showed high sensitivity/specificity irrespective of GFD (PMID:31781909) but overlap with IBD/autoimmune conditions.","evidence_strength":"emerging","quantitative_estimate":"53 deregulated miRNAs; 8 detectable before TGA positivity; 15 concordant in biopsy tissue; no formal clinical sensitivity/specificity calculated due to small sample sizes","confidence_interval":null,"key_citations":["PMID:34950132","PMID:35125829","PMID:31781909","PMID:41033728"],"contradicts_guidelines":false,"affected_patient_population":"Pre-clinical CD; theoretical application in seronegative CD but not yet tested. Estimated 8-12 years from clinical implementation.","null_hypothesis_counterargument":"miRNA findings from small discovery cohorts frequently fail large-scale replication. The PreventCD study had only 53 participants with >200 samples — adequate for discovery but not validation. Pre-analytical variability, platform discordance, and absence of standardized assays are fundamental barriers. No fully independent external validation has been published."},{"finding_id":"6.2.9","finding":"Fecal and urinary GIPs are the most validated non-serological GFD monitoring tool. RCT data (Russell et al. 2024, PMID:38257173, n=52): stool GIP 100% sensitive for gluten ≥250 mg, 71% for 50 mg, detection window 2-7 days. Stool GIP superior to urinary GIP, serology, dietary adherence scores, and symptoms. Triple-positive fecal GIP indicates 83% probability of Marsh II-III. However, single time-point sensitivity for mucosal damage only 33% (improves with serial testing). GIPs detect gluten exposure, NOT immune response — a diagnostic tool for exposure, not CD per se. Likely guideline inclusion for GFD monitoring within 2-4 years.","evidence_strength":"moderate","quantitative_estimate":"100% sensitive for ≥250mg gluten, 71% for 50mg (stool); detection window 2-7 days stool, 4-24h urine; single-point sensitivity for mucosal damage 33%","confidence_interval":null,"key_citations":["PMID:38257173","PMID:34712034","PMID:35001079","PMID:28067823"],"contradicts_guidelines":false,"affected_patient_population":"All CD patients on GFD; not applicable to diagnosis","null_hypothesis_counterargument":"GIP data is strong and consistent. The main limitation — detecting exposure rather than disease — is inherent to the biology and not a methodological weakness."},{"finding_id":"6.2.10","finding":"Zonulin as intestinal permeability biomarker is fundamentally compromised. Scheffler 2018 (PMID:29459849): commercial ELISA (Immundiagnostik) failed to detect recombinant zonulin (pre-HP2) even at 50 μg/mL, produced results uncorrelated with haptoglobin genotype (HP1-1 homozygotes had similar levels as HP2-2), primarily captured properdin. Ajamian 2019 (PMID:30640941): confirmed neither Immundiagnostik nor CUSABIO kits detect pre-HP2, instead detecting haptoglobin and complement C3. This invalidates virtually all published zonulin studies. Even if valid assays existed, zonulin shows poor sensitivity (~33%) and is elevated in obesity, diabetes, IBD, IBS, MS, depression.","evidence_strength":"strong","quantitative_estimate":"ELISA kits detect complement C3, properdin, and related proteins — NOT pre-haptoglobin2. Zero correlation with HP genotype.","confidence_interval":null,"key_citations":["PMID:29459849","PMID:30640941","PMID:38062791"],"contradicts_guidelines":false,"affected_patient_population":"All research using commercial zonulin ELISA is affected; clinical utility is zero for CD diagnosis","null_hypothesis_counterargument":"Some researchers use 'zonulin-related proteins (ZRPs)' to acknowledge what assays actually detect. Complement/properdin changes may still be biologically relevant to CD pathophysiology, even if the label 'zonulin' is wrong. However, this does not rescue the marker's diagnostic utility."},{"finding_id":"6.2.11","finding":"Neopterin shows preliminary, counterintuitive results. Kivelä 2025 (PMID:39491272, n=45 total): serum neopterin highest in potential CD (9.8 nmol/L), then controls (5.9), then active CD (5.5, p=0.022). Fecal neopterin showed different pattern: highest in potential CD (513 nmol/L), then controls (372), then active CD (255). Only serum differences survived age adjustment. With n=8 for potential CD subgroup, this is hypothesis-generating only. Neopterin is nonspecific (elevated in IBD, HIV, TB, malignancies, autoimmune conditions).","evidence_strength":"weak","quantitative_estimate":"Serum: potential CD 9.8 vs controls 5.9 vs active CD 5.5 nmol/L (p=0.022). Fecal: potential CD 513 vs controls 372 vs active CD 255 nmol/L. n=8 for potential CD subgroup.","confidence_interval":null,"key_citations":["PMID:39491272","PMID:39233618"],"contradicts_guidelines":false,"affected_patient_population":"Potential CD patients; not tested in seronegative CD","null_hypothesis_counterargument":"A single tiny study with counterintuitive results is not evidence of a useful biomarker. The finding may be noise."},{"finding_id":"6.2.12","finding":"Flow cytometry IEL phenotype persists indefinitely on GFD, providing the only tissue biomarker for retrospective CD diagnosis without gluten challenge. TCRγδ IELs remain elevated even after 5-12+ years on GFD with normalized histology (Basu 2022, PMID:35300471 = PMC8862495: 98.5% sensitivity, 97.7% specificity independent of histology up to 12 years on GFD; Saborido 2018, PMID:28815514: confirmed persistence at 5+ years). By contrast, the sCD3− fraction recovers gradually with mucosal healing, providing complementary information about disease activity. Camarero 2021 (PMID:34757327) noted nearly 20% of pediatric patients on GFD were indistinguishable from non-celiac by lymphogram, suggesting some resolution occurs.","evidence_strength":"strong","quantitative_estimate":"Celiac IEL pattern persists up to 12 years on GFD with normal histology (sensitivity 98.5%, specificity 97.7%). ~20% pediatric patients normalize on GFD (Camarero 2021).","confidence_interval":null,"key_citations":["PMID:35300471","PMID:28815514","PMID:34757327"],"contradicts_guidelines":true,"affected_patient_population":"CD patients on GFD who need retrospective confirmation; avoids gluten challenge","null_hypothesis_counterargument":"The 20% normalization rate in pediatric patients (Camarero 2021) means the test is not 100% reliable for retrospective diagnosis on GFD. Longer GFD duration may reduce sensitivity further. However, no other test retains any diagnostic signal after years on GFD."},{"finding_id":"6.2.13","finding":"Low positive (7-14 U/mL) and borderline negative (3-6.9 U/mL) tTG2 values frequently indicate CeD. Nurmi 2025 (PMID:40994413, n=311 adults): 100% of EmA-positive patients with low positive TGA and 79% of EmA-positive patients with borderline negative TGA received a CeD diagnosis. Even 29% of borderline-negative/EmA-negative subjects showed signs of incipient CeD (positive mucosal IgA deposits, increased γδ IELs, HLA-DQ2/8). All subjects with TGA ≥3.2× ULN (22.4 U/mL) received CeD diagnosis.","evidence_strength":"moderate","quantitative_estimate":"100% CeD diagnosis in low-positive TGA + EmA-positive; 79% in borderline-negative TGA + EmA-positive; 29% incipient CeD in borderline-negative/EmA-negative","confidence_interval":null,"key_citations":["PMID:40994413"],"contradicts_guidelines":true,"affected_patient_population":"Patients with borderline serology; implications for seronegative CD threshold","null_hypothesis_counterargument":"This is a single Finnish study. The 29% 'incipient CeD' finding in borderline-negative/EmA-negative patients relies on intermediate markers (deposits, IELs) as CD indicators rather than definitive diagnosis. These patients may represent pre-clinical CD or normal variation. However, the data suggest current thresholds are too high for some patients."},{"finding_id":"6.2.14","finding":"Expert consensus is emerging that standard serology-biopsy algorithms are insufficient for the full CD spectrum. Volta et al. 2024 Gastroenterology review (PMID:38286391) identifies flow cytometry, intestinal tTG2 deposits, miRNA detection, and proteomic analysis as most promising additional diagnostic tools for seronegative and ultrashort CD. Bakhtiari & Rostami-Nejad 2025 comprehensive review (PMID:41033728) covers neo-epitope tTG, non-HLA risk alleles, DNA methylation, cytokine profiling, gut microbiota, metabolomics, I-FABP, plasma citrulline, and REG Iα, emphasizing multi-omics approaches.","evidence_strength":"moderate","quantitative_estimate":null,"confidence_interval":null,"key_citations":["PMID:38286391","PMID:41033728"],"contradicts_guidelines":true,"affected_patient_population":"Seronegative and ultrashort CD patients","null_hypothesis_counterargument":"Expert opinion and narrative reviews are the lowest level of evidence in GRADE methodology. Guidelines require systematic reviews and meta-analyses. These reviews may reflect the authors' research agendas rather than a broader consensus."},{"finding_id":"6.2.15","finding":"NEW — FFPE adaptation for tTG2-IgA deposits could remove frozen tissue barrier. Valitutti 2022 (PMID:34844876, n=61): double immunohistochemistry on formalin-fixed paraffin-embedded biopsies achieved 100% sensitivity in 32 overt CD, 64% (9/14) in potential CD, 100% specificity in 15 controls. Deposits showed focal/multifocal/confluent patterns correlating with serum TGA levels and mucosal atrophy. Bulb most severely involved. This addresses a major adoption barrier but requires much larger multicenter validation.","evidence_strength":"emerging","quantitative_estimate":"100% sensitivity in overt CD (n=32), 64% in potential CD (n=14), 100% specificity (n=15)","confidence_interval":null,"key_citations":["PMID:34844876"],"contradicts_guidelines":false,"affected_patient_population":"All suspected CD patients where frozen tissue is unavailable","null_hypothesis_counterargument":"Only 61 patients, single center. The 100% sensitivity in overt CD may not replicate in larger, more heterogeneous cohorts. FFPE processing degrades IgA, so lower sensitivity in less severe disease is expected."}],"biases_documented":[{"bias_type":"Verification bias in flow cytometry studies","description":"Most flow cytometry validation studies use pre-selected patients (known CD vs known controls). True performance in unselected screening populations is unknown. However, the Fernández-Bañares 2020 prospective seronegative VA study (PMID:32048756) used consecutive patients, providing more realistic estimates. The meta-analysis (PMID:31443602) found no significant heterogeneity, suggesting consistent performance across study designs.","magnitude_estimate":"Likely modest impact; prospective seronegative VA study still showed 87% sensitivity/96.7% specificity","evidence_sources":["PMID:25010214","PMID:31443602","PMID:32048756"]},{"bias_type":"Spectrum bias toward severe disease","description":"Many biomarker studies include mostly Marsh 3b/3c patients (severe disease), inflating apparent sensitivity. Performance in milder disease (Marsh 3a, Marsh 1) may be significantly worse. García-Hoz 2024 (PMID:38674808, n=768) showed reduced flow cytometry sensitivity (79%) compared to the meta-analysis (93%), likely reflecting broader disease spectrum. Similarly, the Ruiz-Ramírez 2021 (PMID:34063411) validation showed 82% complete pattern sensitivity.","magnitude_estimate":"Reduces sensitivity by 10-20% when moving from highly selected to broader cohorts","evidence_sources":["PMID:38674808","PMID:34063411","PMID:31443602"]},{"bias_type":"Geographic concentration / expertise bias","description":"The majority of IEL flow cytometry evidence originates from a small number of Spanish centers (Ramón y Cajal Madrid, Mutua Terrassa Barcelona), with limited independent international replication. The UK validation (Basu 2022, PMID:35300471, Cambridge, n=117) partially addresses this and achieved excellent results (98.5%/97.7%), but is still a single non-Spanish center. Generalizability to settings without established intestinal flow cytometry expertise remains uncertain. Protocol and cutoff variability between centers compounds this concern.","magnitude_estimate":"Unknown generalizability impact; UK replication is encouraging but insufficient","evidence_sources":["PMID:35300471","PMID:38674808","PMID:34757327","PMID:34063411"]},{"bias_type":"Publication bias favoring positive biomarker results","description":"Studies reporting positive results for novel biomarkers are more likely to be published. REG Iα (Planas 2011) has had zero replication attempts published in 15 years, while zonulin positive studies continued to be published despite known assay invalidity. The miRNA field is especially prone to selective reporting.","magnitude_estimate":"Uncertain; REG Iα absence of replication is itself informative","evidence_sources":["PMID:21867979","PMID:23388848"]},{"bias_type":"Zonulin measurement invalidity","description":"Hundreds of published studies using commercial zonulin ELISAs are measuring complement C3, properdin, and related proteins — NOT actual zonulin (pre-HP2). This invalidates a large body of intestinal permeability research, including the widely-cited CDGEMM study (PMID:38062791) suggesting zonulin predicts CDA.","magnitude_estimate":"Complete invalidity of all published data using commercial zonulin ELISA; all results require reinterpretation as complement/properdin markers","evidence_sources":["PMID:29459849","PMID:30640941"]},{"bias_type":"tTG2-IgA deposit specificity problem in seronegative population","description":"Maglio 2017 (PMID:28934109) showed 24% of seronegative non-CD patients produce intestinal tTG2-IgA autoantibodies. This substantially limits PPV when deposits are used as the confirmatory test in seronegative villous atrophy — the exact clinical scenario where they are most needed. The false-positive deposits may represent pre-clinical CD, gluten-driven mucosal inflammation without CD, or technical artifact.","magnitude_estimate":"24% false-positive rate in seronegative non-CD patients; reduces PPV from theoretical ~100% to ~76% in seronegative population","evidence_sources":["PMID:28934109"]}],"unproven_assumptions_identified":[{"assumption":"Serology captures the vast majority of CD cases, so alternative biomarkers are only needed for rare edge cases","evidence_against":"Seronegative CD prevalence is 8.3% in one cohort (Ríos León 2019, PMID:31057009); borderline negative TGA (3-6.9 U/mL) associated with CeD in 79% of EmA-positive cases (Nurmi 2025, PMID:40994413). Verification bias means true serology sensitivity cannot be calculated from standard studies. The Paris Consensus (2022) estimates seronegative CD at 2-8%, but this is itself derived from biased detection.","evidence_for":"Large population screening studies consistently report tTG2 sensitivity >90% for Marsh 3 CD. The absolute number of missed seronegative cases may be small in terms of population impact. Serology is cheap, non-invasive, and widely available — no alternative can match this as a screening tool.","clinical_impact":"If 5-8% of CD is seronegative, enriched for DQ8 and milder histology, thousands of patients are systematically excluded from diagnosis in each country."},{"assumption":"Flow cytometry is too complex and expensive for routine clinical use","evidence_against":"Already routine in numerous Spanish hospitals. García-Hoz 2024 validated in 768 patients in routine clinical practice. Cambridge UK adopted it (Basu 2022). Uses standard 4-color panels on equipment already in most hospitals. Detailed standardized protocols published (Núñez 2023, PMID:37625872).","evidence_for":"Not all pathology labs have flow cytometry equipment or expertise for intestinal tissue (typically process blood/bone marrow). Requires fresh tissue (not FFPE), adding logistical complexity. No internationally standardized protocol, cutoffs, or quality assurance program. No CPT code, FDA clearance, or CE-IVD marking. Geographic concentration of expertise raises generalizability concerns.","clinical_impact":"The 'too complex' assumption has delayed adoption for >15 years despite excellent data. A commercially distributed standardized antibody panel with validated gating protocol could accelerate adoption dramatically."},{"assumption":"Mucosal tTG2-IgA deposits are always present in CD, even when serum antibodies are absent","evidence_against":"Deposits depend on mucosal IgA production. Tosco 2008 (PMID:18728524): deposits in only 66% of seronegative children. Maglio 2017 (PMID:28934109): 24% false-positive in seronegative non-CD. Siniscalco 2025 (PMID:41253159): sequential IgM→IgG1→IgA switching means IgG1 deficiency impairs mucosal IgA production. In IgA-deficient patients, compensatory IgM deposits reported (Borrelli 2010) but with very limited data.","evidence_for":"Koskinen 2010 (PMID:19779364): 100% sensitivity in 261 untreated CD (seropositive). Salmi 2006 (PMID:16886921): 93%/93% for predicting subsequent CD. Salmi 2006 (PMID:16571636): deposits present in EmA-negative CD but absent in autoimmune enteropathy controls.","clinical_impact":"For patients with impaired IgA production (reference patient: low IgG1, low secretory IgA), mucosal deposits may be falsely negative, leaving flow cytometry as the only reliable tissue-based alternative. The 24% false-positive rate additionally undermines deposits' utility in the seronegative population."},{"assumption":"Circulating miRNAs are too unstable and variable for clinical diagnostic use","evidence_against":"PreventCD study identified 53 reproducible changes with 8 pre-diagnostic. miRNAs relatively stable in serum (exosomes, protein complexes). 3-miRNA panels proposed as simplified clinical assays.","evidence_for":"Pre-analytical variability (hemolysis, fasting, storage), no standardized reference ranges, platform-dependent results, small sample sizes in all studies, no clinical-grade assay. Cost $50-500+ per test depending on platform. Estimated 8-12 years to clinical implementation.","clinical_impact":"miRNAs could theoretically provide pre-clinical screening independent of antibody production, but clinical implementation is realistically a decade away."}],"overlooked_populations":[{"population":"DQ8-positive seronegative CD patients with mild histology","estimated_size":"23.1% of seronegative CD in one cohort (vs 2.5% seropositive); potentially thousands undiagnosed per country","why_missed":"DQ8 confers lower risk than DQ2.5, potentially generating weaker immune responses below serology thresholds. These patients have milder histology (34.6% Marsh I vs 3.7%), less likely to trigger biopsy referral. DQ8-restricted T cells recognize a smaller, different repertoire of gluten peptides than DQ2.5-restricted cells.","proposed_solution":"Flow cytometry IEL lymphogram as reflex test when clinical suspicion exists but serology is negative and HLA-DQ8 is present. Performance needs stratification by HLA genotype."},{"population":"Patients with IgG1 subclass deficiency and impaired mucosal IgA class switching","estimated_size":"Unknown; IgG1 deficiency prevalence in CD not studied","why_missed":"Sequential IgM→IgG1→IgA class switching (Siniscalco 2025, PMID:41253159) means IgG1 deficiency impairs both serum AND mucosal IgA production independently of HLA. Creates a double-negative phenotype (negative serology AND potentially negative mucosal deposits). Also raises CVID differential.","proposed_solution":"Measure IgG subclasses in seronegative CD patients. Use flow cytometry (IgA-independent) rather than IgA-dependent biomarkers. Rule out CVID with quantitative immunoglobulins, vaccine responses, B-cell subsets."},{"population":"Adults with ultrashort CD (villous atrophy confined to duodenal bulb)","estimated_size":"Unknown prevalence; under-recognized phenotype. Valitutti 2022 (PMID:34844876) noted bulb as most severely involved site for deposits.","why_missed":"Standard biopsy protocols may not sample the bulb adequately. If serology positive but distal biopsies normal, CD may be missed.","proposed_solution":"Systematic bulb biopsies in all suspected CD; flow cytometry can confirm CD pattern even with limited tissue."},{"population":"Patients on self-initiated GFD before diagnosis","estimated_size":"Up to 20-30% of referrals in some settings","why_missed":"GFD normalizes serology and may normalize histology. Gluten challenge is burdensome, poorly tolerated, and many patients refuse.","proposed_solution":"Flow cytometry IEL pattern persists up to 12 years on GFD (Basu 2022, PMID:35300471), enabling retrospective diagnosis without gluten challenge. However, ~20% of pediatric patients normalize on GFD (Camarero 2021, PMID:34757327), so false-negatives possible."}],"diagnostic_step_sensitivity":{"step_name":"Flow cytometry IEL lymphogram (primary alternative biomarker)","reported_sensitivity":"Pooled 93% (meta-analysis, PMID:31443602); range 79-98.5% across validation cohorts. Seronegative VA specifically: 87% (PMID:32048756).","adjusted_sensitivity":"For unselected populations including mild disease: likely 80-90%. For immunoglobulin-deficient patients (reference profile): likely retains full sensitivity (IgA-independent). For patients on long-term GFD: ~80% (20% may normalize, PMID:34757327).","false_negative_rate":"2-21% depending on cohort and protocol. Higher in broader populations with milder disease.","key_limitations":["Requires fresh biopsy tissue (not FFPE) — incompatible with standard formalin-fixed pathology workflows","No internationally standardized protocol — cutoffs vary (TCRγδ ≥14% vs ≥15%; sCD3− ≤4% vs ≤6%)","Geographic concentration of expertise (primarily Spanish, one UK center)","No specific CPT code, FDA clearance, or CE-IVD marking","~20% of treated pediatric patients normalize — imperfect for retrospective diagnosis","Processing must occur within hours of biopsy, requiring endoscopy-laboratory coordination"]},"contradictory_studies":[{"citation":"García-Hoz et al. 2024 — largest adult IEL lymphogram validation (n=768)","pmid":"38674808","finding":"Complete celiac lymphogram sensitivity only 79% (vs 93% in meta-analysis, 82% in Ruiz-Ramírez 2021, 89.7% in Camarero 2021 pediatric). Specificity >97%. Positive LR 36.2.","contradicts":"Earlier meta-analysis (PMID:31443602) pooled sensitivity of 93%. Discrepancy likely reflects broader patient spectrum including milder disease, and possibly protocol differences in the largest validation to date."},{"citation":"Fernández-Bañares et al. 2014 — IEL cytometric pattern vs subepithelial deposits (n=205)","pmid":"25010214","finding":"Flow cytometry IEL pattern (95% accuracy) significantly outperformed tTG2-IgA tissue deposits (60% accuracy) in lymphocytic enteritis (p=0.039). Direct head-to-head within same cohort.","contradicts":"Finnish group (Kaukinen/Koskinen/Salmi Tampere) emphasis on mucosal tTG2-IgA deposits as primary early CD marker, and Grok 4.1 review ranking deposits above flow cytometry for seronegative CD."},{"citation":"Maglio et al. 2017 — Intestinal anti-TG2 in non-CD patients","pmid":"28934109","finding":"24% (33/136) of seronegative non-CD patients produced anti-tTG2 autoantibodies at intestinal level. 41% of these had high TCRγδ/CD3 ratios. Intestinal anti-TG2 production does not show absolute specificity for CD.","contradicts":"Claims that mucosal tTG2-IgA deposits are ~100% specific for CD and can serve as definitive confirmatory test in seronegative villous atrophy."},{"citation":"Scheffler et al. 2018 — Zonulin ELISA validity","pmid":"29459849","finding":"Widely used commercial zonulin ELISA does NOT detect pre-haptoglobin2 (actual zonulin). Kit primarily captures properdin and related proteins.","contradicts":"All studies using commercial zonulin ELISA as intestinal permeability marker, including CDGEMM study (PMID:38062791)."},{"citation":"Nurmi et al. 2025 — Borderline TGA values","pmid":"40994413","finding":"29% of patients with borderline-negative TGA (3-6.9 U/mL) and negative EmA showed signs of incipient CeD. All TGA ≥3.2× ULN received CeD diagnosis.","contradicts":"Standard guideline threshold for positive TGA (typically 1× ULN = 7 U/mL); suggests significant CD exists below current cutoffs."},{"citation":"Camarero et al. 2021 — Pediatric lymphogram normalization on GFD","pmid":"34757327","finding":"Nearly 20% of pediatric CD patients on GFD were indistinguishable from non-celiac by lymphogram.","contradicts":"Claims of indefinite persistence of celiac IEL pattern on GFD. Partially contradicts Basu 2022 showing persistence up to 12 years in adults — may reflect age-dependent differences."}],"research_gaps":[{"gap":"No large multicenter validation of flow cytometry IEL lymphogram with internationally standardized protocol","importance":"high","proposed_study_design":"Prospective multicenter study across 10+ centers on 3+ continents using standardized antibody panel and gating strategy. Enroll consecutive patients referred for duodenal biopsy regardless of serology. Target n>1000, include HLA genotype stratification and full Marsh grade distribution."},{"gap":"Flow cytometry IEL performance not stratified by HLA genotype (DQ2.5 vs DQ2.2 vs DQ8 vs half-DQ2)","importance":"high","proposed_study_design":"Nested analysis within flow cytometry validation studies stratifying accuracy by HLA subtype. Critical because DQ8-restricted T cells recognize fewer/different gluten peptides, potentially generating different γδ T-cell response magnitude — directly relevant to the reference patient."},{"gap":"No study has tested mucosal tTG2-IgA deposits in patients with confirmed IgG1 subclass deficiency","importance":"high","proposed_study_design":"Prospective study measuring IgG subclasses, secretory IgA, mucosal deposits, and flow cytometry simultaneously in seronegative villous atrophy patients. Would directly test the Siniscalco (PMID:41253159) sequential class-switching hypothesis."},{"gap":"HLA-DQ tetramer-based detection of gluten-specific T cells not adequately evaluated as diagnostic biomarker","importance":"high","proposed_study_design":"The narrative report notes '100% sensitivity and 90% specificity using only 5 gluten epitopes' for peripheral blood HLA-DQ-tetramer flow cytometry. This directly measures the adaptive immune response independent of antibody production. DQ8-specific tetramers could confirm gluten-reactive T cells even without serum antibody production. Requires validation in seronegative CD with both DQ2 and DQ8 tetramers."},{"gap":"miRNA panels have not been validated specifically in seronegative CD","importance":"medium","proposed_study_design":"Case-control study of circulating miRNAs in confirmed seronegative CD (by biopsy + GFD response + HLA) vs seropositive CD vs non-CD enteropathy controls."},{"gap":"No combination biomarker panel formally validated for seronegative CD diagnosis","importance":"high","proposed_study_design":"Develop and validate multi-marker algorithm (flow cytometry + I-FABP + selected miRNAs ± mucosal deposits) optimized for seronegative CD detection. Machine learning on combined markers."},{"gap":"REG Iα not independently validated in 15 years since original 2011 study","importance":"medium","proposed_study_design":"Multicenter replication of serum REG Iα in CD (including seronegative), IBD, and healthy controls."},{"gap":"Anti-actin antibodies (anti-F-actin IgA) not evaluated for seronegative CD","importance":"medium","proposed_study_design":"Anti-actin antibodies have been proposed as markers of severe villous atrophy and are included in some European laboratory panels, but their role in seronegative CD is unexplored. Case-control study comparing anti-actin positivity in seronegative vs seropositive CD and non-CD villous atrophy."},{"gap":"True population-level biomarker performance unknown due to serology-first patient identification","importance":"high","proposed_study_design":"Population-based biopsy study with flow cytometry on all biopsies regardless of serology, combined with HLA typing and full clinical follow-up."},{"gap":"No valid commercial zonulin assay exists","importance":"medium","proposed_study_design":"Development of specific pre-haptoglobin2 ELISA using validated monoclonal antibodies, with mass spectrometry confirmation."}],"differential_diagnoses_relevant":[{"condition":"NCGS (Non-celiac gluten sensitivity)","overlap_with_cd":"GI symptoms responsive to GFD, sometimes borderline serology or elevated antigliadin antibodies","distinguishing_features":"Normal flow cytometry IEL pattern (no TCRγδ increase, no CD3- decrease); negative tTG2-IgA mucosal deposits; normal villous architecture (Marsh 0-1); negative HLA-DQ2/8 in ~50%. Flow cytometry is the key differentiator (Martín-Cardona et al. 2024)."},{"condition":"Common Variable Immunodeficiency (CVID) enteropathy","overlap_with_cd":"Villous atrophy, diarrhea, malabsorption; negative serology due to immunodeficiency. CRITICAL differential for reference patient given combined immunoglobulin deficiencies.","distinguishing_features":"Low total immunoglobulins (IgG, IgA, IgM); absent or reduced plasma cells on biopsy; typically negative tTG2-IgA deposits; may have nodular lymphoid hyperplasia; different IEL pattern on flow cytometry (no TCRγδ increase). Typically unresponsive to GFD long-term. Essential workup: quantitative Igs, vaccine response antibody testing, B-cell subset analysis."},{"condition":"Drug-induced enteropathy (olmesartan, other ARBs)","overlap_with_cd":"Villous atrophy, seronegative, can mimic CD histologically","distinguishing_features":"Normal flow cytometry IEL pattern (γδ-IEL density very low vs very high in CD); no tTG2-IgA deposits; resolves on drug withdrawal; no HLA-DQ2/8 requirement. Medication review essential."},{"condition":"Autoimmune enteropathy","overlap_with_cd":"Villous atrophy, malabsorption; may be seronegative for CD markers","distinguishing_features":"Anti-enterocyte or anti-goblet cell antibodies; deep crypt involvement; different IEL pattern on flow cytometry; may have other autoimmune features. Salmi 2006 (PMID:16571636) showed tTG2-IgA deposits absent in autoimmune enteropathy controls."},{"condition":"Tropical sprue","overlap_with_cd":"Villous atrophy, malabsorption, can mimic CD histologically","distinguishing_features":"Geographic exposure history; responds to antibiotics; normal flow cytometry IEL pattern; no tTG2-IgA deposits; HLA-DQ2/8 not enriched."},{"condition":"Giardiasis","overlap_with_cd":"Can cause villous atrophy, particularly in immunodeficient patients","distinguishing_features":"Stool Giardia antigen positive; common in immunodeficiency (relevant for reference patient profile). May coexist with CD."}],"recommendations":[{"recommendation":"Flow cytometry IEL lymphogram should be included in diagnostic guidelines as recommended test for: (1) seronegative villous atrophy, (2) lymphocytic enteritis with clinical suspicion, (3) patients already on GFD needing retrospective diagnosis, (4) discordant serology/histology, (5) distinction from NCGS/drug-induced/autoimmune enteropathy.","target":"guidelines","evidence_basis":"Meta-analysis 93%/98% (PMID:31443602), prospective seronegative VA study 87%/96.7% (PMID:32048756), pediatric validation n=1,211 (PMID:34757327), UK replication 98.5%/97.7% (PMID:35300471), head-to-head superiority over deposits in lymphocytic enteritis (PMID:25010214), identical performance in seronegative (PMID:31057009), GFD persistence (PMID:35300471, PMID:28815514). Cumulative data >3,000 patients across multiple centers."},{"recommendation":"International standardization initiative for flow cytometry IEL lymphogram is urgently needed: standardized antibody panel, gating strategy, cutoff values, external quality assurance program, and commercially distributed kit.","target":"researchers","evidence_basis":"Protocol variability is the primary barrier to guideline adoption. Published protocols exist (Núñez 2023, PMID:37625872; García-Hoz 2024, PMID:38674808) but are not harmonized across centers."},{"recommendation":"For the reference patient profile (DQ8, Marsh 3A, all serology <1, low IgG1, low secretory IgA), the recommended additional tests in priority order are: (1) Flow cytometry IEL lymphogram (IgA-independent, works in seronegative, distinguishes from CVID); (2) CVID workup (quantitative Igs, vaccine responses, B-cell subsets, biopsy plasma cell assessment); (3) Mucosal tTG2-IgA deposits (with caveat about potential false-negative due to impaired IgA and 24% false-positive rate); (4) GFD trial with histological follow-up.","target":"clinicians","evidence_basis":"Flow cytometry IgA-independent and works in seronegative CD (PMID:31057009, PMID:32048756); deposits IgA-dependent and 24% FP (PMID:28934109, PMID:18728524); Siniscalco 2025 (PMID:41253159) class-switching mechanism; CVID differential critical given immunoglobulin deficiency pattern."},{"recommendation":"Zonulin should NOT be used as a clinical biomarker until validated assays measuring actual pre-haptoglobin2 are developed. Published zonulin data should be reinterpreted as measuring zonulin-related proteins (ZRPs), primarily complement/properdin.","target":"clinicians","evidence_basis":"PMID:29459849, PMID:30640941"},{"recommendation":"IgG subclass testing should be performed in seronegative CD patients to identify IgG1 deficiency. This may explain both false-negative serology and potentially false-negative mucosal deposits via impaired sequential class switching.","target":"clinicians","evidence_basis":"Siniscalco 2025 (PMID:41253159) sequential IgM→IgG1→IgA class switching; reference patient demonstrates this phenotype"},{"recommendation":"I-FABP should be considered as adjunct to serology in borderline cases (tTG <10× ULN) where biopsy avoidance is desired, particularly in pediatric patients. Combined with positive serology and HLA-DQ2/8, PPV reaches 100%.","target":"clinicians","evidence_basis":"Adriaanse 2017 (PMID:28819290): multicentre, 92.1% sensitivity, 87.7% specificity, PPV 100% with serology+HLA"},{"recommendation":"Multi-marker panel studies should be prioritized, combining flow cytometry with I-FABP, miRNAs, and possibly HLA-DQ tetramer T-cell detection, optimized for seronegative CD.","target":"researchers","evidence_basis":"No validated combination panel exists; individual markers each have limitations that complementary panels could address"},{"recommendation":"Consider requesting IEL flow cytometry when performing duodenal biopsies in patients with unexplained iron deficiency anemia, even when serology is negative.","target":"clinicians","evidence_basis":"Mete et al. 2021 (PMID:34872894): flow cytometry identified CD in 14/22 unexplained IDA with 91.7% sensitivity and 80.4% specificity"}],"meta_analysis_summary":{"studies_reviewed":48,"total_patients":3500,"pooled_estimates":{"flow_cytometry_celiac_lymphogram":{"pooled_sensitivity":"93%","pooled_specificity":"98%","AUC":"0.98 (95% CI 0.97-0.99)","heterogeneity":"No significant heterogeneity in meta-analysis; substantial range across validation cohorts (79-98.5%) reflecting spectrum and protocol variability","source":"PMID:31443602 meta-analysis of 6 studies (519 patients, 440 controls); validation cohorts: PMID:34757327 (n=1,211), PMID:38674808 (n=768), PMID:35300471 (n=117), PMID:34063411 (n=169), PMID:32048756 (n=67)"},"flow_cytometry_TCRgd_alone":{"pooled_sensitivity":"95%","pooled_specificity":"95%","AUC":"0.97 (95% CI 0.95-0.98)","heterogeneity":"Significant heterogeneity present","source":"PMID:31443602"},"tissue_tTG2_IgA_deposits":{"sensitivity_range":"66-100% depending on population (100% seropositive untreated, 85% seropositive children normal villi, 66% seronegative children, 64% potential CD on FFPE)","specificity_range":"76-100% (but 24% false-positive in seronegative non-CD)","key_sources":"PMID:19779364 (n=515), PMID:18852635, PMID:18728524, PMID:28934109 (n=136), PMID:16886921, PMID:34844876 (n=61)"},"I-FABP":{"best_pediatric_study":"92.1% sensitivity, 87.7% specificity at 450 pg/mL (PMID:28819290, multicentre, n=170)","adult_low_tTG":"Not significant standalone (p=0.13, PMID:29383769)","combined_with_serology_HLA":"PPV 100%","heterogeneity":"High — cutoffs vary 224-920 pg/mL across studies and platforms"},"fecal_GIP":{"sensitivity_gluten_250mg":"100%","sensitivity_gluten_50mg":"71%","single_point_mucosal_damage":"33%","source":"PMID:38257173 (RCT, n=52)"}},"heterogeneity_notes":"Significant heterogeneity across biomarker studies due to: (1) protocol/cutoff variability in flow cytometry; (2) assay platform differences in I-FABP; (3) patient spectrum (severe vs mild, seropositive vs seronegative); (4) geographic concentration (flow cytometry primarily Spain); (5) frozen vs FFPE tissue for deposits. International standardization would substantially reduce heterogeneity for flow cytometry. The 14-percentage-point gap between meta-analysis pooled sensitivity (93%) and largest adult validation (79%) is the most important heterogeneity finding, likely reflecting spectrum bias."}}
