{"research_topic_id":"6.3","research_topic_title":"No-Biopsy Celiac Disease Diagnosis in Adults: Evidence, Limitations, and Diagnostic Cascade Consequences","date_completed":"2026-02-11","version":"5.0 — final synthesis. Integrates original Opus 4.6 research, peer reviews from Grok 4.1 (×2) and Opus 4.6 twin, twin's consolidated v4.0, plus my editorial corrections. All PMIDs verified against PubMed.","editorial_notes":{"methodology":"Four documents reviewed: (1) Grok 4.1 peer review, (2) Grok 4.1 findings JSON, (3) Opus 4.6 twin narrative peer review, (4) twin's consolidated v4.0 JSON. I accept most critiques but correct several points where reviewers overcorrected or mischaracterized evidence.","key_editorial_decisions":["ACCEPTED: Siniscalco 2025 omission was a genuine gap — now integrated with appropriate caveats about pathway being 'major' not 'obligate'","ACCEPTED: DQ8 stratification was insufficiently developed — now integrates project topics 8.1 and 3.6 evidence","ACCEPTED: Paradox effect (no-biopsy worsening seronegative detection) deserves elevation — but reclassified from 'moderate' to 'emerging' evidence since no direct data exists","ACCEPTED: Explicit counterargument section was missing — now included in unproven_assumptions with balanced evidence_for","CORRECTED: Enache 2025 (PMID:40181998) is a PEDIATRIC study (n=63 children), not adult. Twin v4.0 overstated its relevance to adult no-biopsy outcomes. Retained but properly contextualized.","CORRECTED: 'Actively harms this patient' (twin v4.0 reference_patient_impact) is rhetorical overcorrection. The pathway doesn't harm seronegative patients — it's orthogonal to their diagnostic problem. Softened to 'irrelevant to and does not address.'","CORRECTED: Resource allocation bias claim (research investment in no-biopsy competes with seronegative CD) flagged as editorial opinion, not evidence-based finding","CORRECTED: Vivas 2009 '26% adults with Marsh 3' flagged as potentially from screening cohort — most clinical series report 60-80% Marsh 3 in biopsied adults","RETAINED from my original: EMA discussion is more nuanced than either Grok or twin acknowledged. EMA failed as safety net at ≥10×ULN in Penny (all 5 false positives were EMA+), but retains value at lower titers. ESsCD dropping EMA requirement may be premature.","RETAINED from my original: The conventional view retains considerable force for the qualifying subset. No-biopsy is genuinely safe for ~30% of European adults who meet criteria. The problem is reach and framing, not safety."]},"executive_summary":"IgA-tTG2 ≥10×ULN achieves near-100% specificity and 95–100% PPV for Marsh 3 villous atrophy in adults, supporting the 2025 ESsCD conditional no-biopsy pathway for adults <45. For this qualifying subset, the pathway is genuinely safe and well-validated. However, only 8–32% of adult CD patients reach this threshold (8–10% in broad US practice), yielding a pathway sensitivity of just 51%. The no-biopsy debate is structurally misframed: it optimizes diagnosis for the minority the system already handles well (high-titer, severe disease) while offering nothing for the majority who still need biopsy, the 5–15% who are seronegative, or the unknown fraction with DQ8/IgG1-deficiency profiles rendering all serology uninformative. Verification bias pervades the evidence base (22-fold differential biopsy referral), assay variability makes '10×ULN' a moving target across platforms, and no-biopsy expansion may paradoxically reduce overall biopsy rates — though this last concern remains theoretical.","key_findings":[{"finding_id":"6.3.1","finding":"IgA-tTG2 ≥10×ULN has pooled specificity of 100% (95% CI 98–100%) and PPV of 95–100% for Marsh 3 villous atrophy in adults across 18 studies (Shiha et al. 2024 meta-analysis). For the qualifying subset, this is robust evidence supporting no-biopsy safety.","evidence_strength":"strong","quantitative_estimate":"Specificity 100% (95% CI 98–100%); PPV 95–100% depending on pretest probability and setting","confidence_interval":"95% CI 98–100% for specificity","key_citations":["PMID:38176661"],"contradicts_guidelines":true,"affected_patient_population":"Adults with IgA-tTG2 ≥10×ULN in secondary care settings"},{"finding_id":"6.3.2","finding":"Only 8–32% of adult CD patients reach ≥10×ULN, with extreme heterogeneity (I² = 99.3%). The pooled 32% is driven by European tertiary cohorts; in broad US multicenter data (Jansson-Knodell, n=11,282), only 8.2% qualify. The no-biopsy pathway has a sensitivity of just 51% (95% CI 42–60%) — it misses approximately half of all adult CD.","evidence_strength":"strong","quantitative_estimate":"Pooled qualifying proportion 32% (95% CI 24–40%); US multicenter 8.2%; pathway sensitivity 51% (42–60%)","confidence_interval":"95% CI 24–40% for proportion; 42–60% for sensitivity","key_citations":["PMID:38176661","Jansson-Knodell DDW 2025"],"contradicts_guidelines":false,"affected_patient_population":"All adults with CD; 68–92% remain biopsy-dependent"},{"finding_id":"6.3.3","finding":"The 2025 ESsCD guidelines are the first major adult gastroenterology guideline to formally recommend conditional no-biopsy diagnosis: adults <45, IgA-tTG2 ≥10×ULN confirmed on second blood sample, no red flags, secondary care assessment, shared decision-making. EMA is NOT required (departing from ESPGHAN/BSG). Evidence certainty graded as 'low'; recommendation classified as 'ungraded expert opinion' with 95% Delphi agreement.","evidence_strength":"strong","quantitative_estimate":null,"confidence_interval":null,"key_citations":["ESsCD 2025 Guidelines"],"contradicts_guidelines":true,"affected_patient_population":"Adults <45 without alarm symptoms; ACG 2023 still mandates biopsy"},{"finding_id":"6.3.4","finding":"The ≥10×ULN threshold selectively captures Marsh 3b–3c (severe villous atrophy). Adults with Marsh 3a — where IgA-tTG2 sensitivity is only 33–70% (Abrams 2004, Rostami 1999) — are systematically excluded from no-biopsy diagnosis. This creates spectrum bias: the pathway works best for patients with the most severe disease.","evidence_strength":"strong","quantitative_estimate":"Marsh 3a tTG2 sensitivity 33–70% vs Marsh 3c ~96%; mean tTG2 fold-rise 2.6× at Marsh ≤2 vs 11.8× at Marsh 3c (Qureshi 2023)","confidence_interval":null,"key_citations":["PMID:15185855","PMID:10201452","PMID:12590232"],"contradicts_guidelines":false,"affected_patient_population":"Adults with Marsh 3a histology — the diagnostic gray zone where the reference patient sits"},{"finding_id":"6.3.5","finding":"No-biopsy pathway expansion may paradoxically worsen verification bias by reducing overall biopsy rates. If 30% of seropositive adults exit the biopsy pipeline, endoscopy demand for CD decreases, institutional experience declines, and the already-minimal 3.6% biopsy referral rate for seronegative patients has no mechanism to improve. This is a logical inference from known mechanisms, not a demonstrated effect — no study has monitored this downstream consequence.","evidence_strength":"emerging","quantitative_estimate":"3.6% of seronegative patients currently receive biopsy (Hujoel 2021); effect of no-biopsy adoption on this rate is unmodeled","confidence_interval":null,"key_citations":["PMID:32433257","PMID:38176661","Project topic 1.1"],"contradicts_guidelines":false,"affected_patient_population":"Seronegative CD patients — estimated 5–15% of all CD","editorial_note":"Upgraded from not-discussed (my original) to key finding per twin review critique. Downgraded from 'moderate' (twin v4.0) to 'emerging' since no direct evidence exists — this is theoretical modeling of a plausible but unmeasured effect."},{"finding_id":"6.3.6","finding":"Inter-assay variability makes '10×ULN' a moving target. The proportion qualifying ranges from 41% to 61% depending on assay brand (Bossuyt 2013). UK NEQAS showed Euroimmun and INOVA frequently exceed 10×ULN in moderately positive samples while Orgentec and Varelisa almost never do. 24% of US tTG2 results are not titrated to a definitive number (reported as '>100'), making ≥10×ULN calculation impossible. The same patient may or may not qualify depending on which laboratory processes their sample.","evidence_strength":"strong","quantitative_estimate":"41–61% qualifying range between assays; 4-fold difference in optimal cutoffs between platforms (Efthymakis 2017: 14.3× vs 3.7×); 24% US results untitrated","confidence_interval":null,"key_citations":["Bossuyt 2013","Efthymakis 2017","Beltran 2014","Project topic 1.3"],"contradicts_guidelines":false,"affected_patient_population":"All adults being evaluated via no-biopsy pathway"},{"finding_id":"6.3.7","finding":"EMA adds marginal value at ≥10×ULN but may paradoxically provide false reassurance. In Penny et al. Cohort 1, all 5 'false positives' at ≥10×ULN were EMA-positive — EMA failed as safety net at very high titers. ESsCD 2025 dropped EMA requirement; ESPGHAN retains it. Scottish data (Hoyle 2023) shows 17.7% tTG2+/EMA- discordance, suggesting EMA retains value at lower titers. The ESsCD decision to drop EMA at ≥10×ULN is defensible at that threshold but should not be extrapolated to lower thresholds.","evidence_strength":"moderate","quantitative_estimate":"5/5 false positives at ≥10×ULN were EMA+; 17.7% discordance at lower titers","confidence_interval":null,"key_citations":["PMID:33139268","Hoyle 2023","ESsCD 2025"],"contradicts_guidelines":false,"affected_patient_population":"Adults being evaluated for no-biopsy; impacts algorithm design","editorial_note":"My original analysis noted this nuance. Neither Grok nor twin fully engaged with the implication that EMA FAILED at high titers — this challenges the assumption that EMA is always a reliable confirmatory step."},{"finding_id":"6.3.8","finding":"No study has reported the proportion of DQ8-only patients reaching ≥10×ULN. Given that DQ8 confers systematically weaker T-cell help (3–6 vs 14–17 DQ2.5 epitopes), lower antibody titers, and OR <1 for both tTG-IgG and DGP-IgG (Liu 2024), the qualifying proportion in DQ8-only patients is predicted to be well below 8%. This genotype represents 5–10% of CD but ~15% of seronegative CD — disproportionately excluded from any serology-based pathway.","evidence_strength":"moderate","quantitative_estimate":"DQ8: 3–6 T-cell epitopes vs 14–17 DQ2.5; OR <1 for tTG-IgG and DGP-IgG (Liu 2024); ~15% of SNCD vs 5–10% of total CD. Predicted <5% qualifying at ≥10×ULN but this is inference, not measurement.","confidence_interval":null,"key_citations":["DOI:10.1093/clinchem/hvae106.414","PMID:14530392","Project topics 8.1, 3.6"],"contradicts_guidelines":false,"affected_patient_population":"DQ8-only CD patients (~5–10% of all CD)","editorial_note":"My original called DQ8 data 'limited.' Twin correctly noted this understates a structural absence of data. Now properly contextualized with project knowledge from topics 8.1 and 3.6."},{"finding_id":"6.3.9","finding":"IgG1 subclass deficiency independently impairs mucosal IgA production via the Siniscalco 2025 sequential class-switching pathway (IgM→IgG1→IgA in Peyer's patches), AND directly reduces IgG-based backup test sensitivity since anti-tTG2 IgG is 56.6% IgG1 (Agardh 2005). This creates a dual-pathway failure invisible to standard IgA deficiency screening (which measures total serum IgA, not mucosal IgA or IgG subclasses). The reference patient's combined low IgG1 + low secretory IgA is consistent with this mechanism.","evidence_strength":"emerging","quantitative_estimate":"Anti-tTG2 IgG is 56.6% IgG1 (Agardh 2005). Direct IgM→IgA switching accounts for >90% of total mucosal IgA switch junctions (Lin 2013), so the Siniscalco pathway is 'major' but not 'obligate' — IgG1 deficiency would impair antigen-specific high-affinity IgA rather than total IgA quantity.","confidence_interval":null,"key_citations":["PMID:41253159","PMID:15683458","PMID:24064668","Project topics 8.2, 61c"],"contradicts_guidelines":false,"affected_patient_population":"Patients with IgG1 subclass deficiency — prevalence in CD unknown; standard diagnostic algorithms do not screen for this","editorial_note":"Absent from my original synthesis. All four reviewers flagged this. Integrated with the critical caveat from project topic 8.2: the pathway is 'major but not obligate' — direct IgM→IgA switching is the dominant route for total mucosal IgA. The Siniscalco pathway likely affects antibody quality/affinity rather than total quantity, analogous to IgG1→IgE switching for high-affinity IgE (Xiong 2012)."},{"finding_id":"6.3.10","finding":"Follow-up data from Finland and Romania show worse outcomes in no-biopsy diagnosed patients: less frequent dietitian follow-up, more persistent symptoms, greater dietary-related stress, and worse clinical/laboratory healing. ESsCD 2025 cites this as reinforcing structured gastroenterology follow-up rather than as evidence against no-biopsy per se.","evidence_strength":"moderate","quantitative_estimate":null,"confidence_interval":null,"key_citations":["PMID:40181998","ESsCD 2025","Finnish follow-up data"],"contradicts_guidelines":false,"affected_patient_population":"Patients diagnosed via no-biopsy pathway","editorial_note":"Enache 2025 (PMID:40181998) is a PEDIATRIC study (n=33 no-biopsy vs 30 biopsy children), not adult. The twin v4.0 described it as showing 'broader evidence of worse long-term outcomes' in adults, which overstates its scope. It supports the Finnish findings directionally but is small, pediatric, and single-center."},{"finding_id":"6.3.11","finding":"Lowering the threshold to ≥5×ULN with EMA could expand eligibility to ~40–55% of seropositive adults while maintaining specificity >99% (Jansson-Knodell: PPV >93% at ≥5×; Penny: ROC-optimal 5.9×ULN; Di Tola: ~75% at >3.6×ULN). No prospective validation exists. Autoimmune comorbidity significantly predicts false positives at lower thresholds (Jansson-Knodell: p=0.024). Adding HLA-DQ2/DQ8 testing at lower thresholds is theoretically appealing but this combined algorithm is entirely unvalidated.","evidence_strength":"emerging","quantitative_estimate":"≥5×ULN: specificity >99%, PPV >93%; could expand eligibility from ~32% to ~40–55%","confidence_interval":null,"key_citations":["PMID:33139268","Jansson-Knodell DDW 2025","Di Tola"],"contradicts_guidelines":false,"affected_patient_population":"Adults with moderate tTG2 elevations (5–10×ULN)"},{"finding_id":"6.3.12","finding":"Adult differential diagnoses that mimic CD (olmesartan enteropathy, CVID, intestinal lymphoma, autoimmune enteropathy, tropical sprue) are universally seronegative — they do NOT produce IgA-tTG2 ≥10×ULN with positive EMA. The no-biopsy pathway effectively excludes these mimics. The exception is autoimmune enteropathy where 33% may have elevated tTG2 (Mayo: 5/15), but EMA positivity has not been documented in AIE. This strengthens the safety case at high titers.","evidence_strength":"strong","quantitative_estimate":null,"confidence_interval":null,"key_citations":["Rubio-Tapia 2009","Project topic 3.1"],"contradicts_guidelines":false,"affected_patient_population":"Adults being evaluated for villous atrophy with alternative diagnoses"},{"finding_id":"6.3.13","finding":"The age-45 cutoff in ESsCD 2025 is a consensus compromise, not evidence-derived. BSG used <55. Lebwohl's Swedish data shows no increased lymphoma risk in patients diagnosed <40, but the threshold was set at 45. Peak EATL risk is 5th–6th decade. No study has directly compared no-biopsy outcomes in <45 vs 45–54. Adults 45–55 may be safely eligible but are excluded by current guidelines.","evidence_strength":"moderate","quantitative_estimate":"EATL 5-year survival 8–20%; cancer risk HR 1.22 for diagnosis >60; no increased risk <40; persistent VA annual rate 102.4 vs 31.5 per 100,000 for healed mucosa","confidence_interval":null,"key_citations":["Lebwohl Swedish population study","ESsCD 2025","BSG 2020 interim"],"contradicts_guidelines":false,"affected_patient_population":"Adults 45–60, ~30–40% of adult CD diagnoses"},{"finding_id":"6.3.14","finding":"North American pediatric multicenter data (Chang 2025, n=4,019) shows PPV of 94.9% at ≥10×ULN — lower than European ProCeDE (99.75%). 5% at ≥10×ULN lacked histologic CD, including 2% with completely normal histology. T1DM patients: PPV 89%. Assay PPV varied 89.3–97.3%. While pediatric, this challenges the assumption of near-universal PPV at ≥10×ULN and demonstrates North American assay/population performance is systematically lower than European.","evidence_strength":"strong","quantitative_estimate":"PPV 94.9% overall at ≥10×ULN; T1DM PPV 89%; assay range 89.3–97.3%","confidence_interval":"95% CI 93.8–95.9%","key_citations":["PMID:40774665"],"contradicts_guidelines":false,"affected_patient_population":"North American populations; patients with autoimmune comorbidities"}],"biases_documented":[{"bias_type":"verification bias (compounded by no-biopsy expansion)","description":"The no-biopsy evidence base suffers from the same circular validation affecting all CD serology research: patients are identified through serology-first algorithms, so only seropositive patients enter the confirmatory pathway. 79.2% of seropositive vs 3.6% of seronegative patients receive biopsy (22-fold differential). No-biopsy expansion may theoretically worsen this by reducing overall biopsy rates, but this downstream effect is unmonitored and unmeasured.","magnitude_estimate":"22-fold differential biopsy referral; no-biopsy removes ~30% of seropositive patients from biopsy pipeline; effect on seronegative detection rate is a theoretical concern, not measured","evidence_sources":["PMID:32433257","PMID:38176661","Project topic 1.1"]},{"bias_type":"spectrum bias (severity-dependent qualification)","description":"The ≥10×ULN threshold selectively identifies patients with Marsh 3b–3c where IgA-tTG2 sensitivity is ~96%. Marsh 3a patients (sensitivity 33–70%) and Marsh 1–2 patients (sensitivity <10%) are structurally excluded. Validation cohorts are enriched for severe disease, inflating PPV relative to the full CD spectrum.","magnitude_estimate":"Sensitivity gradient: 96% Marsh 3c → 33–70% Marsh 3a → 7.7% Marsh 1; qualifying proportion is a function of Marsh distribution in the cohort","evidence_sources":["PMID:15185855","PMID:12590232","PMID:10201452"]},{"bias_type":"referral/selection bias in validation cohorts","description":"European tertiary cohorts (Penny, Fuchs, Ciacci) enrich for severe disease and higher titers, yielding qualifying proportions of 30–47%. Broad US practice (Jansson-Knodell, n=11,282) shows only 8.2%. The pooled 32% from Shiha meta-analysis (I² = 99.3%) is dominated by European tertiary data and does not reflect real-world community gastroenterology settings.","magnitude_estimate":"Qualifying proportion 8–10% (US community) vs 30–47% (European tertiary); 3–5× inflation from referral bias","evidence_sources":["PMID:38176661","Jansson-Knodell DDW 2025"]},{"bias_type":"assay heterogeneity bias","description":"10×ULN is not standardized across platforms. The proportion qualifying varies 41–61% between assays (Bossuyt 2013). Optimal cutoffs range from 3.7× to 14.3× (Efthymakis 2017). 24% of US labs report '>100' without definitive titer. A patient may qualify or not depending solely on which laboratory processes their blood.","magnitude_estimate":"20-percentage-point range in qualifying proportion between assays; 4-fold difference in optimal cutoffs; 24% US results uncalculable","evidence_sources":["Bossuyt 2013","Efthymakis 2017","Beltran 2014","Project topic 1.3"]},{"bias_type":"HLA-genotype confounding (unquantified)","description":"No validation study reports ≥10×ULN qualifying proportion stratified by HLA genotype. DQ2.5 homozygotes produce the highest titers; DQ8-only patients produce systematically lower titers. The pooled 32% likely reflects DQ2.5-enriched cohorts. DQ8-specific qualifying proportion is unknown but predicted to be substantially lower based on indirect evidence from project topics 8.1 and 3.6.","magnitude_estimate":"Unknown — no HLA-stratified data exist; DQ8 confers OR <1 for high-titer serology (Liu 2024); predicted <5% qualifying but this is inference not measurement","evidence_sources":["DOI:10.1093/clinchem/hvae106.414","PMID:14530392","Project topic 8.1"]}],"unproven_assumptions_identified":[{"assumption":"High-titer seropositivity (≥10×ULN) reliably indicates disease presence across the full CD spectrum, justifying diagnosis without tissue confirmation.","evidence_against":"Strong titer-Marsh correlation means ≥10×ULN selects for severe mucosal damage. Adults with clinically significant Marsh 3a are excluded (sensitivity 33–70%). The threshold captures ~30% of CD; 70% requires tissue confirmation. Autoimmune comorbidity predicts false positives at ≥10×ULN (Jansson-Knodell: p=0.024).","evidence_for":"Near-100% PPV in validated secondary care cohorts. Differential diagnoses that mimic CD are seronegative and cannot produce this serological pattern. For the qualifying subset, the pathway is genuinely safe — this is not an artifact of bias.","clinical_impact":"The assumption is approximately correct for the high-titer subpopulation. The problem is framing no-biopsy as a solution to the overall diagnostic burden, when it applies to 8–32% of adult CD."},{"assumption":"No-biopsy adoption will improve overall diagnostic rates by reducing endoscopy burden and waiting times.","evidence_against":"Finnish and Romanian follow-up data show worse outcomes in no-biopsy patients (less dietitian follow-up, more persistent symptoms). The referral bottleneck — one-third of seropositive patients never referred for biopsy (UK/US data) — is not addressed by no-biopsy pathways. If no-biopsy becomes 'no-referral,' it worsens diagnostic completion.","evidence_for":"NHS estimates >£2.5 million/year saved and ~3,000 endoscopies/year avoided. Reduced waiting times could theoretically benefit the 68% still needing biopsy. Patient preference data shows the process is less burdensome without endoscopy.","clinical_impact":"Valid in narrow cost-effectiveness terms but ignores downstream effects on the diagnostic ecosystem."},{"assumption":"Seronegative CD is rare enough (2–5%) that the no-biopsy pathway's inherent inability to detect it is clinically acceptable.","evidence_against":"The 2–5% prevalence derives from serology-first cohorts where 96.4% of seronegative patients are never biopsied (Hujoel 2021). Verification bias correction suggests true prevalence could be substantially higher. Biagi et al. found 15.2% seronegative on all standard tests. The true prevalence is structurally unknowable within current algorithms.","evidence_for":"In optimally biopsied tertiary cohorts, seronegative CD is consistently 2–10%. Some proportion may be non-CD villous atrophy misclassified. Hopper 2008 biopsy-all study found 9.1% seronegative CD.","clinical_impact":"If true seronegative CD is 10–20% rather than 2–5%, no-biopsy pathway expansion creates a growing invisible population. But the null hypothesis — that seronegative CD is genuinely uncommon — cannot be dismissed."},{"assumption":"The age-45 threshold adequately separates low-risk from high-risk populations for no-biopsy safety.","evidence_against":"No study directly compares no-biopsy outcomes <45 vs 45–54. Lebwohl Swedish data shows no increased lymphoma risk <40, but ESsCD chose 45. BSG used <55. Peak EATL risk is 5th–6th decade.","evidence_for":"Older adults have broader differential diagnoses, higher complication rates. Conservative threshold is appropriate given ESsCD's own 'low certainty of evidence' grading.","clinical_impact":"Adults 45–55 may be denied a safe pathway; but without outcome data in this age range, conservatism is defensible."}],"overlooked_populations":[{"population":"Seronegative adults with Marsh 3 histology","estimated_size":"Estimated 5–15% of all CD (higher after verification bias correction). Hopper 2008 biopsy-all: 9.1%. Biagi 2006: 15.2% seronegative on all tests.","why_missed":"Invisible by design to any serology-based pathway including no-biopsy. Only 3.6% of seronegative patients receive biopsy.","proposed_solution":"Mandate opportunistic duodenal biopsy during all upper endoscopies for compatible indications regardless of serology. Monitor seronegative detection rate as sentinel indicator after no-biopsy adoption."},{"population":"DQ8-only CD patients (no DQ2.5)","estimated_size":"5–10% of all CD; ~15% of seronegative CD; predicted <5% qualifying at ≥10×ULN (unmeasured)","why_missed":"Systematically lower tTG2 titers due to fewer T-cell epitopes (3–6 vs 14–17 DQ2.5), weaker T-B cooperation, OR <1 for both tTG-IgG and DGP-IgG (Liu 2024). No validation study reports HLA-stratified qualifying proportions.","proposed_solution":"Require HLA-stratified reporting in future validation studies. Develop genotype-informed diagnostic thresholds. Lower biopsy threshold for symptomatic DQ8 carriers."},{"population":"Adults with IgG1 subclass deficiency affecting both IgG backup tests and mucosal IgA production","estimated_size":"IgG1 deficiency is the most common IgG subclass deficiency; prevalence in CD unknown. Siniscalco 2025 IgM→IgG1→IgA pathway means IgG1 deficiency impairs antigen-specific mucosal IgA even with normal total serum IgA.","why_missed":"Not screened in any CD diagnostic algorithm. Total serum IgA (standard screen) is normal. Anti-tTG2 IgG is 56.6% IgG1 (Agardh 2005), so IgG backup tests also underperform.","proposed_solution":"IgG subclass testing in seronegative suspected CD. Research into IgG1 deficiency as a mechanism of seronegativity."},{"population":"Adults in primary care / low-prevalence settings","estimated_size":"Majority of all CD testing occurs in primary care; at 1% prevalence, PPV of ≥10×ULN drops to 65%","why_missed":"Virtually all validation is from secondary/tertiary centers with 10–40% pretest probability.","proposed_solution":"Restrict no-biopsy to secondary care (per ESsCD 2025). Conduct primary-care validation with mandatory biopsy."},{"population":"Adults with autoimmune comorbidities (T1DM, autoimmune thyroiditis, autoimmune hepatitis)","estimated_size":"Significant fraction of adult CD has autoimmune comorbidity","why_missed":"Jansson-Knodell: autoimmune comorbidity predicts false-positive high-titer tTG2 (p=0.024). Chang 2025 (PMID:40774665): PPV at ≥10×ULN drops to 89% in T1DM children. Transient gluten autoimmunity may resolve without CD.","proposed_solution":"Mandate biopsy for patients with known autoimmune comorbidities regardless of titer."},{"population":"Adults ≥45 excluded by ESsCD threshold who may be safely eligible","estimated_size":"~30–40% of adult CD diagnoses occur in patients ≥45","why_missed":"ESsCD age cutoff is consensus-derived. Lymphoma risk concentrated >60, not >45. BSG used <55.","proposed_solution":"Risk-stratified approach based on alarm symptoms and clinical risk rather than arbitrary age cutoff."}],"diagnostic_step_sensitivity":{"step_name":"IgA-tTG2 ≥10×ULN as no-biopsy eligibility criterion in adults","reported_sensitivity":"51% (95% CI 42–60%) per Shiha 2024 meta-analysis","adjusted_sensitivity":"8–10% in broad US practice (Jansson-Knodell); predicted <5% for DQ8-only patients (unmeasured); 0% for seronegative CD by definition","false_negative_rate":"49% overall (require biopsy); 90–92% in US community practice; ~100% for Marsh 3a with DQ8 genotype; 100% for seronegative CD","key_limitations":["Extreme heterogeneity (I² = 99.3%) in qualifying proportion driven by referral patterns, assays, prevalence, and unmeasured HLA distribution","Selects for Marsh 3b–3c; excludes Marsh 3a where tTG2 sensitivity is 33–70%","Seronegative CD (5–15%+) invisible by design","No HLA-stratified qualifying data: DQ8-specific threshold performance unknown","Assay-dependent: qualifying proportion varies 41–61% between platforms; 24% US results not titrated","PPV is prevalence-dependent: 65% at 1% prevalence, 95% at 10%, 99% at 40%","No primary-care validation studies exist","Patients with IgG1 subclass deficiency have an independent mechanism for seronegativity (Siniscalco 2025) rendering all serology-based pathways uninformative","Follow-up biopsy omission means lost baseline histology for RCD/lymphoma monitoring"]},"contradictory_studies":[{"citation":"ACG Clinical Guidelines: Diagnosis and Management of Celiac Disease (2023)","pmid":"36602836","finding":"Mandates duodenal biopsy confirmation in all adults with positive serology; permits 'likely CD' only for patients unwilling/unable to undergo endoscopy","contradicts":"2025 ESsCD conditional no-biopsy recommendation, 2024 Shiha meta-analysis supporting no-biopsy safety, and Finnish/BSG interim practice"},{"citation":"Jansson-Knodell et al. DDW 2025 — US multicenter analysis (n=11,282)","pmid":null,"finding":"Only 8.2% reached ≥10×ULN; PPV 95.5%; autoimmune comorbidity predicted false positives (p=0.024). Concluded 'biopsy still needed for ~90% of patients.'","contradicts":"Pooled 32% qualifying proportion from Shiha meta-analysis; real-world applicability far more limited than meta-analytic estimates"},{"citation":"Chang et al. 2025 — North American pediatric multicenter (n=4,019)","pmid":"40774665","finding":"PPV 94.9% at ≥10×ULN — lower than European ProCeDE (99.75%). 5% lacked histologic CD. T1DM: PPV 89%. Assay range 89.3–97.3%.","contradicts":"Assumption that ≥10×ULN uniformly approaches 100% PPV; North American performance systematically lower than European"},{"citation":"Hujoel et al. 2021 — Verification bias correction","pmid":"32433257","finding":"IgA-tTG2 sensitivity drops from 92.6% to 57.1% after Begg-Greenes correction. Only 3.6% of seronegative patients receive biopsy.","contradicts":"All guideline claims of ≥90% tTG2 sensitivity; the entire evidence base for serology as a reliable rule-out test"},{"citation":"Enache et al. 2025 — No-biopsy outcomes in children","pmid":"40181998","finding":"Worse clinical/laboratory healing and lower follow-up attendance in 33 serology-diagnosed vs 30 biopsy-proven CHILDREN. Note: this is a pediatric study (n=63), small and single-center.","contradicts":"Assumption that no-biopsy and biopsy pathways produce equivalent outcomes. Directionally consistent with Finnish adult follow-up data but limited by pediatric scope and small sample."}],"research_gaps":[{"gap":"Prospective validation of ≥5×ULN + EMA + repeat tTG2 in adults across diverse settings","importance":"high","proposed_study_design":"Multicenter prospective cohort with mandatory biopsy regardless of titer. Include primary care, community GI, and tertiary sites. Report PPV, sensitivity, and qualifying proportion stratified by setting, assay, age, and HLA genotype. Minimum n=2,000 biopsy-proven CD."},{"gap":"HLA-stratified qualifying proportions and PPV at ≥10×ULN and ≥5×ULN","importance":"high","proposed_study_design":"Retrospective analysis of existing validation cohorts (Penny, Fuchs, Bi.A.CeD) with linked HLA data. Report separately for DQ2.5 homozygous, DQ2.5 heterozygous, DQ2.2, DQ8, and DQB1*02-only."},{"gap":"Long-term outcomes (complications, lymphoma, RCD, adherence, mortality) in no-biopsy vs biopsy-confirmed adults with ≥5-year follow-up","importance":"high","proposed_study_design":"Registry-based matched comparative follow-up. Finnish national data (since 2018) provides longest available cohort."},{"gap":"Impact of no-biopsy pathway adoption on seronegative CD detection rates (paradox effect)","importance":"high","proposed_study_design":"Before-after analysis of biopsy rates, overall CD diagnosis rates, and seronegative CD detection rates at institutions adopting no-biopsy vs matched controls."},{"gap":"Primary-care validation where pretest probability is 1–5%","importance":"high","proposed_study_design":"Population-based prospective study with mandatory biopsy for all tTG2-positive patients regardless of titer."},{"gap":"Inter-assay standardization of ≥10×ULN threshold — prerequisite for universal implementation","importance":"high","proposed_study_design":"WHO International Reference Standard for IgA-tTG2 (in development). Multi-assay comparative study testing classification concordance across ≥10 commercial platforms with identical patient samples."},{"gap":"Performance of no-biopsy pathway in patients with autoimmune comorbidities","importance":"medium","proposed_study_design":"Subgroup analysis of existing cohorts for T1DM, autoimmune thyroiditis, autoimmune hepatitis. Chang 2025 pediatric data (PPV 89% in T1DM) suggests non-negligible false-positive rate."}],"differential_diagnoses_relevant":[{"condition":"Olmesartan-induced enteropathy","overlap_with_cd":"Histologically identical villous atrophy; 61–81% carry HLA-DQ2/DQ8","distinguishing_features":"Consistently seronegative. Cannot produce ≥10×ULN. Resolves on drug withdrawal. No false-positive risk for no-biopsy pathway."},{"condition":"Autoimmune enteropathy (AIE)","overlap_with_cd":"Severe villous atrophy; 33% may have elevated tTG2 (Mayo: 5/15)","distinguishing_features":"EMA positivity not documented in AIE. Anti-enterocyte antibodies. Poor GFD response. Very low probability of mimicking ≥10×ULN + EMA."},{"condition":"CVID with enteropathy","overlap_with_cd":"Villous atrophy, increased IELs, low immunoglobulins","distinguishing_features":"Total IgG <5 g/L and/or IgA <0.07 g/L. Cannot produce IgA-tTG2. Detected by total IgA screening."},{"condition":"De novo small bowel lymphoma / EATL","overlap_with_cd":"If arising from pre-existing CD, patient would have positive serology from underlying disease","distinguishing_features":"De novo lymphoma is seronegative. Synchronous EATL primarily >50 — the strongest argument for endoscopic visualization in older adults."},{"condition":"False-positive tTG2 from autoimmune comorbidity","overlap_with_cd":"Elevated IgA-tTG2 without villous atrophy","distinguishing_features":"T1DM, autoimmune hepatitis can produce persistent tTG2 elevation, occasionally ≥10×ULN. Autoimmune comorbidity predicted false positives in Jansson-Knodell (p=0.024). EMA was positive in all 5 false positives in Penny's high-titer cohort, limiting its utility as safety net."}],"recommendations":[{"recommendation":"Adopt ESsCD 2025 conditional no-biopsy criteria for adults <45 with IgA-tTG2 ≥10×ULN confirmed on second sample, no alarm symptoms, no significant autoimmune comorbidity, and structured gastroenterology follow-up. This is safe and well-validated for this subset. Consider BSG <55 threshold for low-risk patients pending outcome data.","target":"guidelines/clinicians","evidence_basis":"Shiha 2024 meta-analysis (PPV 95–100%); ESsCD 2025; Penny 2021; Fuchs/Ylönen 2019–2020"},{"recommendation":"Mandate biopsy for adults with any of: ≥45 years, alarm symptoms, autoimmune comorbidity, IgA-tTG2 <10×ULN, IgA deficiency, or features suggesting alternative diagnosis. This applies to 68–92% of adult CD patients.","target":"clinicians","evidence_basis":"Low qualifying proportion; prevalence-dependent PPV; autoimmune false-positive risk; lymphoma/RCD monitoring needs"},{"recommendation":"Require local assay validation before implementing no-biopsy. Ensure the tTG2 assay has a calibration curve where 10×ULN falls within the measurement range and is not reported as a ceiling value ('>100'). Audit concordance with at least one reference assay.","target":"institutions/laboratories","evidence_basis":"41–61% qualifying variation between assays; 4-fold cutoff difference; 24% US results uncalculable"},{"recommendation":"Monitor seronegative CD detection rates as a sentinel indicator after no-biopsy adoption. Implement before-after analysis of total CD diagnosis rates and biopsy referral rates.","target":"institutions/researchers","evidence_basis":"Theoretical concern that no-biopsy expansion may reduce overall biopsy rates (no direct evidence yet)"},{"recommendation":"Consider mandatory follow-up biopsy at 18–24 months for no-biopsy-diagnosed patients. This retroactively establishes baseline histology, confirms diagnosis, and screens for persistent villous atrophy.","target":"guidelines/clinicians","evidence_basis":"Finnish follow-up data; Enache 2025 (pediatric); RCD evaluation requires baseline comparison"},{"recommendation":"Explicitly frame no-biopsy as a rule-in tool for a qualifying minority, NOT a replacement for endoscopy. Guidelines should state that no-biopsy pathways provide zero diagnostic access for seronegative CD and do not reduce the need for biopsy-based pathways.","target":"guidelines/education","evidence_basis":"No-biopsy pathway sensitivity 51%; seronegative CD invisible by design"},{"recommendation":"Require HLA-stratified subgroup reporting in all future no-biopsy validation studies. Report qualifying proportion and PPV separately for DQ2.5 homozygous, DQ2.5 heterozygous, DQ2.2, DQ8, and DQB1*02-only genotypes.","target":"researchers/journal editors","evidence_basis":"No existing study provides HLA-stratified data despite known genotype-dependent titer gradients"}],"meta_analysis_summary":{"studies_reviewed":18,"total_patients":12103,"pooled_estimates":{"specificity_at_10x_ULN":"100% (95% CI 98–100%)","proportion_qualifying_at_10x_ULN":"32% pooled (95% CI 24–40%); 8–10% US broad practice; range 8–47%","sensitivity_of_pathway":"51% (95% CI 42–60%)","PPV_at_1_percent_prevalence":"65%","PPV_at_10_percent_prevalence":"95%","PPV_at_40_percent_prevalence":"99%","positive_LR":"183.4 (95% CI 30.1–1114.6)"},"heterogeneity_notes":"I² = 99.3% for qualifying proportion — extreme heterogeneity driven by referral patterns, assay platforms, geographic variation, and unmeasured HLA distribution. Low heterogeneity for specificity. Only 1/18 studies had low risk of bias across all QUADAS-2 domains."},"counterargument_for_conventional_view":{"statement":"The conventional view — that biopsy should remain the gold standard for adult CD diagnosis — retains considerable force.","supporting_evidence":["For the qualifying subset (≥10×ULN, <45, no alarm features), no-biopsy is genuinely safe with PPV 95–100%. The problem is not that it's wrong but that it's incomplete.","Seronegative CD may indeed be rare (2–10% in well-biopsied cohorts). While verification bias correction suggests higher rates, the Hopper 2008 biopsy-all study found 9.1% — consistent with the lower end of estimates.","Baseline histology has real clinical value for monitoring (mucosal healing, RCD assessment, lymphoma surveillance) that is permanently lost without biopsy.","The cost of endoscopy may be justified by the information gained — particularly in adults >40 where cancer risk begins to accumulate.","The Finnish follow-up signal (worse outcomes in no-biopsy patients) may reflect implementation problems rather than inherent pathway deficiency, but the signal exists."],"editorial_assessment":"The conventional view is approximately correct for the majority of patients. No-biopsy is a useful tool for a minority, not a paradigm shift. The main contribution of this analysis is quantifying how small that minority is (8–32%) and identifying the populations it systematically excludes."},"reference_patient_impact":{"patient_profile":"DQ8, Marsh 3A, IgA-tTG2 <1, DGP-IgG <1, low IgG1 subclass, low fecal secretory IgA","no_biopsy_pathway_relevance":"Zero. This patient is invisible to all serology-based pathways by definition. No tTG2 threshold (10×, 5×, or any value) can detect a patient with serology <1.","diagnostic_failure_modes_revealed":["The no-biopsy debate presupposes serology as gateway — structurally excludes seronegative CD","DQ8 genotype produces fewer T-cell epitopes (3–6 vs 14–17 DQ2.5) → weaker antibody response → unable to reach any threshold","IgG1 deficiency impairs both mucosal IgA production (via Siniscalco 2025 sequential class switching) AND IgG backup testing (anti-tTG2 IgG is 56.6% IgG1). This is a dual-pathway failure mechanism.","Low secretory IgA confirms mucosal antibody compartment failure — consistent with Siniscalco pathway disruption","Marsh 3a histology means even if this patient were seropositive, tTG2 sensitivity would be 33–70%","The combination of DQ8 + IgG1 deficiency produces a multiplicative reduction estimated at <2% of DQ2.5 baseline antibody response (project topic 3.6 model)"],"what_would_help_this_patient":["Opportunistic biopsy during any upper endoscopy for compatible indications regardless of serology","HLA-DQ8 positivity with compatible symptoms should lower biopsy threshold","IgG subclass testing in seronegative suspected CD","Intestinal TG2-IgA deposit immunofluorescence (fresh frozen tissue)","T-cell based diagnostics (gluten-specific tetramer assays) — not yet clinically available","GIP testing for monitoring if on GFD"],"framing_note":"The no-biopsy pathway is irrelevant to this patient's diagnostic problem — it neither helps nor directly harms them. The indirect concern is that no-biopsy adoption may redirect clinical attention and research investment toward high-titer patients, further marginalizing the diagnostic needs of seronegative populations. This is a plausible concern but remains speculative and unquantified."}}
