{"research_topic_id":"7.1","research_topic_title":"Cumulative Diagnostic Cascade Sensitivity in Celiac Disease — First Formal Multiplicative Analysis","date_completed":"2026-02-11","version":"FINAL v1.0","executive_summary":"The standard celiac disease diagnostic pathway delivers a cumulative sensitivity of only 40% under best-case conditions and 5.4% per primary care encounter in typical mixed-presentation settings — a finding never previously modeled through multiplicative cascade analysis. By multiplying evidence-based sensitivity estimates across nine sequential steps (clinical recognition, testing decision, IgA deficiency identification, serological detection, referral, endoscopy, biopsy adequacy, orientation, pathologist interpretation), this analysis demonstrates that the ~83% US undiagnosed rate is a mathematically predictable structural outcome, not a system failure. For vulnerable subgroups — Marsh 3A (6.6–18.4%), elderly (4.6%), Black patients (0.2%), and the reference patient profile (0.6%) — the cascade is effectively non-functional. The single largest bottleneck is pre-testing attrition (Steps 1–2), not serology sensitivity.","key_findings":[{"finding_id":"7.1-F1","finding":"No published study has previously calculated the cumulative multiplicative product of step-wise diagnostic sensitivities for celiac disease. Individual step performance is well-documented but the compound effect of serial filtering has been overlooked. This is the first formal cascade sensitivity model for CD.","evidence_strength":"strong","quantitative_estimate":"9 sequential steps at 80–95% each yield 19–64% cumulative sensitivity (baseline); 0.7–18.2% (real-world primary care)","confidence_interval":"Wide ranges reflect step-level uncertainty propagated through multiplication","key_citations":["Novel synthesis"],"contradicts_guidelines":true,"affected_patient_population":"All celiac disease patients"},{"finding_id":"7.1-F2","finding":"Baseline cascade (classical symptomatic adult, informed clinical setting): optimistic 63.5%, realistic 40.2%, pessimistic 19.2% cumulative sensitivity. The pessimistic estimate (19.2%) closely matches the observed ~17% US diagnosis rate (Rubio-Tapia 2012). No single step is catastrophically poor, yet nine steps at 80–95% each compound into a system that misses the majority of patients.","evidence_strength":"strong","quantitative_estimate":"Optimistic 63.5%; Realistic 40.2%; Pessimistic 19.2%","confidence_interval":"Range reflects uncertainty in individual step estimates","key_citations":["PMID:22850429","PMID:18328437","PMID:32433257","PMID:21601201","PMID:22081783"],"contradicts_guidelines":true,"affected_patient_population":"Classical symptomatic adults with diarrhea/malabsorption"},{"finding_id":"7.1-F3","finding":"Real-world cascade (typical primary care, mixed presentations): optimistic 18.2%, realistic 5.4%, pessimistic 0.7% per clinical encounter. Steps 1–2 (clinical recognition + decision to test) are the dominant bottleneck: only 24–27% of modern CD patients have diarrhea at diagnosis, and non-GI presentations experience 18-fold longer diagnostic delays (42 vs 2.3 months). With estimated annual testing probability ~0.9%/year, lifetime probability of ever being tested reaches ~31% over 40 adult years, yielding ~17% lifetime diagnosis rate — precisely matching observed US data.","evidence_strength":"strong","quantitative_estimate":"5.4% per encounter (realistic); ~17% lifetime detection; annual testing probability ~0.9%","confidence_interval":null,"key_citations":["PMID:22850429","PMID:28931034","PMID:17944736","PMID:36682923"],"contradicts_guidelines":true,"affected_patient_population":"All CD patients in primary care settings"},{"finding_id":"7.1-F4","finding":"The pre-testing bottleneck (Steps 1–2) accounts for more lost patients than all post-serology steps combined. Only 35% of US PCPs have ever diagnosed CD; 70% consider it rare. Recognition rates: 90% for diarrhea, 45% for anemia/osteoporosis, 24% for depression, 13% for T1D association. Since only 13–34% of modern CD presents classically and 63–66% presents non-classically, the recognition gap is the dominant source of patient loss.","evidence_strength":"strong","quantitative_estimate":"Steps 1–2 combined: 17.5% realistic sensitivity (real-world); largest improvement opportunity in cascade","confidence_interval":null,"key_citations":["PMID:28931034","PMID:39123100","DOI:10.3390/nu16142292"],"contradicts_guidelines":true,"affected_patient_population":"All CD patients, especially non-classical presentations"},{"finding_id":"7.1-F5","finding":"Marsh 3A patients face a double penalty: serology sensitivity drops to 42–85% (vs ~100% for Marsh 3C) AND community pathologists misclassify 41% as normal (κ=0.30–0.33). Using Hopper's 85% serology figure, cumulative sensitivity is 18.4%; using Abrams' real-world 42.3% from US commercial labs, it drops to 6.6%. Partial villous atrophy is effectively undiagnosable through standard clinical pathways in community settings.","evidence_strength":"strong","quantitative_estimate":"Hopper-based: 18.4% cumulative; Abrams-based: 6.6% cumulative; pathologist misclassification 41% for Marsh 3A","confidence_interval":null,"key_citations":["PMID:18328437","PMID:16630760","PMID:22081783","PMID:17544877"],"contradicts_guidelines":true,"affected_patient_population":"CD patients with Marsh 3A (partial villous atrophy) — approximately 38% of celiac histology"},{"finding_id":"7.1-F6","finding":"Elderly patients (≥70) encounter compounding barriers: OR 0.51 for duodenal biopsy (PMID:22732871), only 18% PCP testing rate for elderly male with IDA vs 61% for young male (PMID:28931034), OR 0.67 for ≥4 biopsy specimens in >80. Diagnostic delay 17–51.5 months longer than younger adults. Calculated cumulative sensitivity 4.6%.","evidence_strength":"strong","quantitative_estimate":"4.6% cumulative sensitivity; OR 0.51 for biopsy; 18% testing rate for elderly IDA","confidence_interval":null,"key_citations":["PMID:22732871","PMID:28931034","PMID:21601201"],"contradicts_guidelines":true,"affected_patient_population":"Elderly CD patients ≥70 years; ~28% of new CD diagnoses are in >60"},{"finding_id":"7.1-F7","finding":"Black patients face the most extreme cascade failure. Cartee et al. found 80% of Black patients with biopsy-confirmed CD had tTG-IgA below ULN (vs ~9% white patients). Combined with OR 0.55 for biopsy and low CD awareness (63% of Black Americans report no awareness of CD), calculated cumulative sensitivity is 0.2%. CRITICAL CAVEAT: 80% seronegativity from small registry (n=42 Black patients), requires replication in larger cohorts.","evidence_strength":"moderate","quantitative_estimate":"0.2% cumulative sensitivity; 80% seronegativity (n=42, preliminary)","confidence_interval":"Very wide — 80% seronegativity figure unreplicated","key_citations":["Cartee 2024 Gastro Hep Advances","PMID:22732871"],"contradicts_guidelines":true,"affected_patient_population":"Black Americans with celiac disease"},{"finding_id":"7.1-F8","finding":"Reference patient (DQ8-only, Marsh 3A, all serology <1, low IgG1, low secretory IgA) has calculated cumulative sensitivity of 0.6%. With zero serology sensitivity by definition, the only pathway is the 3.6% seronegative rescue biopsy rate (Hujoel 2021). This profile is not hypothetical: DQ8 comprises 5–10% of CD, Marsh 3A accounts for 38% of celiac histology, and seronegative CD represents 6–22% of biopsy-confirmed cases.","evidence_strength":"moderate","quantitative_estimate":"0.6% cumulative sensitivity; seronegative rescue biopsy rate 3.6%","confidence_interval":null,"key_citations":["PMID:32433257","PMID:18328437","PMID:23190627"],"contradicts_guidelines":true,"affected_patient_population":"Seronegative CD patients with DQ8-only genotype and Marsh 3A"},{"finding_id":"7.1-F9","finding":"Childhood screening at a single time point provides false reassurance. CiPiS study: 1.0% of HLA-risk children who tested negative at both ages 3 and 9 developed CD by age 15; five of ten age-15 CD cases had been negative at both prior screenings. TEDDY: 46% of children with celiac autoimmunity resolved spontaneously. Mäkinen et al. model: optimal single screening age 11 years, optimal repeated at ages 4 and 11. Screening captures prevalence, not future incidence — with 50–80% of CD diagnosed in adulthood, even perfect childhood screening cannot address the lifetime burden.","evidence_strength":"strong","quantitative_estimate":"Single screen age 2: 27.9% capture; age 5: 60.5%; age 10: 79.1%; triple 2+5+10: 83.4%; optimal ages 4+11: ~85%","confidence_interval":null,"key_citations":["PMID:38477348","PMID:31408136","PMID:41407089","PMID:36682923"],"contradicts_guidelines":false,"affected_patient_population":"Children eligible for celiac screening"},{"finding_id":"7.1-F10","finding":"Lifetime detection modeling: (1) Symptom-triggered only (current): ~17% lifetime detection. (2) Symptom-triggered + one childhood screen age 10: ~40–50% lifetime detection — roughly tripling current rate. (3) Universal screening ages 5, 18, 40: ~65–75% lifetime detection. Even the most aggressive strategy leaves 25–35% undetected — primarily late adult-onset cases and the structurally seronegative subset.","evidence_strength":"moderate","quantitative_estimate":"Current: 17%; +childhood screen: 40–50%; triple lifespan screening: 65–75%","confidence_interval":"Model-dependent; sensitivity to screening compliance and test sensitivity assumptions","key_citations":["PMID:22850429","PMID:41407089"],"contradicts_guidelines":true,"affected_patient_population":"General population"},{"finding_id":"7.1-F11","finding":"Subgroup vulnerability is multiplicative, not additive. A Marsh 3A patient who is also elderly doesn't face double disadvantage but the PRODUCT of both disadvantage ratios, yielding cumulative sensitivities in low single digits. The same biological feature (mild atrophy) simultaneously degrades serology sensitivity (Step 4), orientation impact (Step 8), and pathologist accuracy (Step 9) — violating the independence assumption in the direction of WORSE outcomes than the product suggests.","evidence_strength":"strong","quantitative_estimate":"Correlated step failures may make true sensitivity worse than product for mild-disease subgroups","confidence_interval":null,"key_citations":["PMID:18328437","PMID:17544877","DOI:10.1136/bmjgast-2023-001252"],"contradicts_guidelines":true,"affected_patient_population":"Patients with multiple compounding risk factors (age, ethnicity, Marsh grade, HLA type)"},{"finding_id":"7.1-F12","finding":"Post-serology cascade efficiency is only ~55% even using optimistic estimates: referral (0.85) × endoscopy (0.92) × adequate biopsy (0.90) × orientation (0.93) × pathology (0.90) = 0.553. Thus Hopper's 91% serology sensitivity becomes ~50% after full cascade. The no-biopsy pathway (tTG ≥10× ULN) bypasses Steps 6–9 for ~50% of seropositive patients, yielding blended post-serology sensitivity of ~77.5% — still meaning ~23% of tested, seropositive patients never receive diagnosis.","evidence_strength":"strong","quantitative_estimate":"Post-serology cascade: 55.3%; blended with no-biopsy: 77.5%; 23% loss among tested seropositive","confidence_interval":null,"key_citations":["PMID:18328437","PMID:38176661","PMID:21601201","PMID:22081783"],"contradicts_guidelines":true,"affected_patient_population":"All seropositive CD patients navigating confirmatory pathway"},{"finding_id":"7.1-F13","finding":"Finland (world's best case-finding) still diagnoses only ~25% of CD cases; Italy mass pediatric screening found 60% of celiac children remained undiagnosed despite ongoing medical care. These international benchmarks confirm cascade structural limitations transcend individual healthcare systems.","evidence_strength":"strong","quantitative_estimate":"Finland ~25% detection; Italy pediatric screening 40% detection despite active effort","confidence_interval":null,"key_citations":["PMID:17944736","PMID:36682923"],"contradicts_guidelines":false,"affected_patient_population":"All CD patients, regardless of healthcare system"},{"finding_id":"7.1-F14","finding":"Perfecting any single cascade step cannot raise realistic cumulative sensitivity above ~47% because the remaining eight steps still filter out patients. The fundamental architectural problem is that serial filtering guarantees substantial cumulative failure regardless of individual step quality. Only bypassing entire step clusters (population screening for Steps 1–2; no-biopsy pathway for Steps 6–9) can meaningfully improve cascade performance.","evidence_strength":"strong","quantitative_estimate":"Maximum single-step perfection: ~47% cumulative; requires bypassing step clusters for meaningful improvement","confidence_interval":null,"key_citations":["Novel modeling"],"contradicts_guidelines":true,"affected_patient_population":"All CD patients"}],"biases_documented":[{"bias_type":"Verification bias in serology sensitivity estimates","description":"The commonly cited ~93% tTG-IgA sensitivity derives from studies where patients were selected for biopsy based on serology results. Hujoel et al. found 79.2% seropositive vs 3.6% seronegative patients received biopsy — a 22-fold differential. Begg & Greenes correction yields 57.1% (95% CI 35.4–76.4%), though the method may overcorrect. Hopper universal-biopsy study (91%) is the best unbiased estimate but from a single tertiary center.","magnitude_estimate":"Apparent sensitivity inflated from 57–91% (corrected range) to 93% (reported); 22-fold differential biopsy referral","evidence_sources":["PMID:32433257","PMID:18328437"]},{"bias_type":"Pre-serology clinical suspicion bias (unmeasured bottleneck)","description":"The largest source of patient loss occurs BEFORE any test is ordered. ~70% of PCPs consider CD rare; symptom recognition drops below 50% for atypical presentations; testing rates vary 18–61% by patient demographics. This step is unmeasured in any diagnostic accuracy study because studies begin after testing is ordered. Creates structural pre-analytical selection filter excluding most CD patients from diagnostic pathway.","magnitude_estimate":"Steps 1–2 combined realistic sensitivity 17.5% in mixed-presentation primary care; unmeasured in any diagnostic accuracy study","evidence_sources":["PMID:28931034","PMID:39123100"]},{"bias_type":"Circular validation (serology–histology interdependence)","description":"Serology sensitivity measured in seropositive-enriched cohorts; histology agreement improves 10% when serology results provided (Denholm 2024). Seronegative patients face systematically worse histological assessment because their biopsies are interpreted without the diagnostic anchor. Neither test independently validated — an unfalsifiable circular system.","magnitude_estimate":"κ improvement from 0.59 to 0.67 when serology provided; direction of bias always inflates apparent serology accuracy","evidence_sources":["DOI:10.1136/bmjgast-2023-001252","PMID:32433257"]},{"bias_type":"Lab-to-lab variability (hidden variation)","description":"Abrams et al. 2006 found extreme variability between two major US commercial laboratories: Lab #1 tTG sensitivity 40% vs Lab #2 sensitivity 86.4% (P<.0001). Clinical performance depends on which lab processes the sample — variation entirely invisible to the ordering physician.","magnitude_estimate":"Sensitivity range 40–86.4% depending on commercial lab","evidence_sources":["PMID:16630760"]},{"bias_type":"Marsh grade correlation with serology (non-independence of steps)","description":"Marsh grade simultaneously affects serology sensitivity (Step 4: 85–100% for 3C vs 42–85% for 3A), orientation impact (Step 8: mild atrophy more vulnerable to tangential sectioning), and pathologist accuracy (Step 9: κ=0.73 for 3C vs κ=0.33 for 3A). These share a common biological cause (disease severity), violating independence assumption and potentially making true cumulative sensitivity WORSE than multiplicative product.","magnitude_estimate":"Correlated failures may reduce Marsh 3A cumulative sensitivity below the calculated 6.6–18.4%","evidence_sources":["PMID:18328437","PMID:17544877","PMID:16630760"]},{"bias_type":"Demographic biases in testing and biopsy rates","description":"Spencer et al.: only 18% testing rate for elderly male with IDA vs 61% young Caucasian male. Lebwohl: OR 0.51 for duodenal biopsy in ≥70; OR 0.55 for non-white patients. Sex: diagnosed F:M ratio 2–3:1 vs seroprevalence ~1:1. These demographic filters compound serology and pathology failures.","magnitude_estimate":"18% vs 61% testing rate; OR 0.51 elderly; OR 0.55 non-white; 2–3× female diagnostic advantage","evidence_sources":["PMID:28931034","PMID:22732871"]},{"bias_type":"Practice setting bias (academic vs community performance)","description":"Biopsy adequacy studies, pathologist agreement data, and serology sensitivity estimates overwhelmingly from academic centers and expert settings. University pathologists κ=0.888 vs commercial labs κ=0.419. Only 35% US biopsy adequacy compliance. Real-world performance substantially below published estimates.","magnitude_estimate":"κ=0.888 (university) vs κ=0.419 (commercial); 2.1× reliability gap","evidence_sources":["PMID:22081783","PMID:21601201","PMID:29372596"]}],"unproven_assumptions_identified":[{"assumption":"The overall CD diagnostic pathway delivers sensitivity near the 93% commonly reported for tTG-IgA","evidence_against":"93% represents Step 4 in isolation under verification-biased conditions. Post-serology cascade efficiency is only ~55%. Even with no-biopsy pathway, blended post-serology sensitivity is ~77.5%. Pre-serology loss (Steps 1–2) reduces realistic per-encounter sensitivity to 5.4%.","evidence_for":"In high-prevalence symptomatic populations, tTG-IgA PPV >95% when titer >10× ULN. No-biopsy pathway bypasses four failure-prone steps for ~50% of seropositive patients.","clinical_impact":"Guideline-implied sensitivity is mathematically incompatible with step-wise evidence. True cascade sensitivity is 5–40× lower than guidelines suggest."},{"assumption":"Cascade step failures are independent events","evidence_against":"Marsh grade simultaneously affects serology, orientation impact, and pathologist accuracy (negative correlation → true sensitivity worse than product). Practice setting simultaneously affects biopsy adequacy, orientation, and pathology (positive correlation → bimodal distribution with some patients near 100% and others near 0%).","evidence_for":"Steps 1–2 (clinical recognition/testing) are largely independent of Steps 7–9 (biopsy quality). The multiplicative model provides useful first approximation.","clinical_impact":"Independence assumption both overstates failure (for academic center patients) and understates failure (for Marsh 3A patients in community settings)"},{"assumption":"A negative IgA-tTG2 result reliably rules out celiac disease","evidence_against":"Only 3.6% of seronegative patients receive biopsy. Hujoel corrected sensitivity 57.1% (CI 35.4–76.4%). Hopper: 9% seronegative CD. Abrams: 42.3% sensitivity for partial VA. Cartee: potentially 80% seronegativity in Black patients (preliminary).","evidence_for":"Hopper 91% is an excellent test by most standards. High NPV in low-prevalence populations is a mathematical property. Seronegative CD may represent a distinct, potentially milder clinical entity.","clinical_impact":"False reassurance from negative serology terminates investigation. The 22-fold differential biopsy referral creates a structural barrier. Seronegative patients are rarely diagnosed."},{"assumption":"Seronegative celiac disease is rare (<5% of cases) and clinically insignificant","evidence_against":"All-biopsy studies: 9% (Hopper) to 15.2% (Biagi). Paris Consensus strict criteria (1.7–6.4%) use the strictest possible definition requiring exhaustive differential exclusion and ≥12 months GFD response. Historical estimates range to 37.9%. Even at conservative 6%, this represents ~180,000 US patients structurally invisible to screening.","evidence_for":"Some seronegative VA cases reclassified as non-celiac enteropathies (CVID, giardiasis, drug-induced). Hopper's seronegative cases mostly had milder histology. Strict Paris Consensus criteria may reflect true clinical significance threshold.","clinical_impact":"True SNCD prevalence unknown due to verification bias. Even at lower bounds, represents a substantial overlooked population."},{"assumption":"Physician education and awareness improvement can close the diagnostic gap","evidence_against":"2024 Danube survey: only marginal improvement to 52.2% mean knowledge score. Italy mass screening found symptoms equally common in celiac and non-celiac children — even perfect symptom recognition cannot distinguish most cases. Finland's world-best case-finding still misses ~65–70%.","evidence_for":"18× delay difference between GI and non-GI presentations shows room for improvement. UK targeted education: biopsy adequacy 21.9%→60.8%, CD diagnosis rate 3.5%→7.6%.","clinical_impact":"Symptom-based case-finding has inherent ceiling effects. Population screening (Italy model) or EHR-automated testing may be required."},{"assumption":"The USPSTF 'I' statement means universal screening is not beneficial","evidence_against":"'I' means insufficient evidence, not evidence of no benefit. CD NNS (67–100) is far more favorable than routinely screened conditions (breast cancer 500–2,000; CRC 800–1,000). No RCTs exist partly because randomizing to non-screening is ethically problematic. Italy Law 130/2023 pilot data forthcoming.","evidence_for":"Long-term outcomes of screen-detected asymptomatic CD uncertain. Treatment burden (lifelong GFD) is non-trivial. No RCT demonstrating net benefit exists.","clinical_impact":"USPSTF statement widely used to justify clinical inertia regarding CD screening in US primary care."}],"overlooked_populations":[{"population":"Marsh 3A patients in community practice settings","estimated_size":"~38% of all celiac histology (Hopper 2008); hundreds of thousands in US alone","why_missed":"Double penalty: serology sensitivity drops to 42–85% AND community pathologists misclassify 41% as normal. Cumulative sensitivity 6.6–18.4%. The two failure modes share a common biological cause (mild atrophy), making them correlated rather than independent.","proposed_solution":"Mandate ≥4 biopsies + bulb; CD3 immunohistochemistry for all borderline cases; quantitative Vh:Cd morphometry; expert review for Marsh 2/3A boundary cases"},{"population":"Seronegative CD patients (all causes of seronegativity)","estimated_size":"6–22% of CD depending on definition and study design; ~180,000–660,000 US patients","why_missed":"Only 3.6% of seronegative patients receive biopsy (vs 79.2% seropositive). Negative serology falsely reassures both patient and physician, terminating investigation. Seronegative villous atrophy triggers broad differential (CVID, giardiasis, drug-induced) rather than CD workup.","proposed_solution":"Routine duodenal biopsy during endoscopy for compatible indications regardless of serology; EHR-flagging of persistent symptoms after negative serology; tissue transglutaminase IgA deposits on frozen biopsy; γδ T-cell assessment"},{"population":"Black Americans with celiac disease","estimated_size":"Unknown; seroprevalence data may itself be biased by test inadequacy in this population","why_missed":"Potentially 80% seronegativity (Cartee, preliminary, n=42); OR 0.55 for biopsy; CD perceived as 'Caucasian disease'; 63% report no awareness of CD. Calculated cumulative sensitivity 0.2%.","proposed_solution":"Replicate Cartee finding in larger cohorts; remove ethnicity from clinical decision-making about CD testing; automated EHR prompts based on symptoms/labs without demographic filtering"},{"population":"Elderly CD patients (≥70 years)","estimated_size":"CD prevalence in elderly may be 2.7% (higher than working-age adults); ~28% of new diagnoses are in >60","why_missed":"OR 0.51 for duodenal biopsy; only 18% PCP testing rate for elderly IDA; symptoms attributed to aging, medications, or comorbidities; diagnostic delay 17–51.5 months longer than younger adults","proposed_solution":"Mandatory CD serology in all unexplained IDA regardless of age; elderly-specific testing algorithms; lower threshold for biopsy in elderly with compatible symptoms"},{"population":"DQ8-only CD patients","estimated_size":"5–10% of all CD (Megiorni & Pizzuti); no study stratifies serology sensitivity by HLA genotype","why_missed":"DQ8 associated with lower antibody titers, overrepresentation in ultra-short CD (bulb-only), potentially different Marsh grade distributions. HLA genotyping not routine at any cascade step. DQ8-specific serology sensitivity completely unknown.","proposed_solution":"HLA-stratified subgroup analysis in all diagnostic accuracy studies; consider lower serology thresholds for DQ8 patients; include bulb biopsy protocol for all DQ8-positive patients"},{"population":"Patients with IgG1 subclass deficiency causing false-negative serology via impaired class switching","estimated_size":"Unknown; IgG1 deficiency prevalence 2–5% in general population, overlap with CD unknown","why_missed":"Sequential IgM→IgG1→IgA class switching (Siniscalco 2025, Immunity) means IgG1 deficiency impairs mucosal IgA production independently of HLA mechanisms. Compromises both IgA-based primary testing and IgG-based backup testing.","proposed_solution":"IgG subclass measurement when serology negative but clinical suspicion persists; lower biopsy threshold for IgG1-deficient patients; mechanism published 2025, not yet integrated into algorithms"},{"population":"Non-classical CD presentations (majority of modern CD)","estimated_size":"63–66% of all CD diagnoses (Italian 40-year cohort); most CD patients","why_missed":"PCP recognition rates <50% for most non-GI symptoms (anemia, osteoporosis, depression, neurological). 18× longer diagnostic delay for non-GI vs GI presentations. Italian mass screening found symptoms suggestive of CD equally common in celiac and non-celiac children.","proposed_solution":"Population screening (bypasses clinical recognition bottleneck); EHR-automated flagging of symptom patterns; Italy Law 130/2023 as model"},{"population":"Patients previously misdiagnosed with IBS","estimated_size":"4.1% of IBS patients may have undiagnosed CD; IBS prevalence 10–15% of population","why_missed":"IBS diagnosis functions as a diagnostic trap — once labeled, patients rarely re-evaluated for CD; 25% of diagnosed CD patients had prior IBS label","proposed_solution":"Mandatory tTG-IgA before or concurrent with any IBS diagnosis; AGA/ACG already recommend but adherence poor without EHR enforcement"}],"diagnostic_step_sensitivity":{"step_name":"Full 9-step celiac disease diagnostic cascade","reported_sensitivity":"ACG 2023 guidelines imply ~93% based on tTG-IgA sensitivity in isolation (Step 4 only, verification-biased)","adjusted_sensitivity":"Baseline realistic: 40.2%; Real-world realistic: 5.4% per encounter, ~17% lifetime; Marsh 3A: 6.6–18.4%; Elderly: 4.6%; Black patients: 0.2%; Reference patient: 0.6%","false_negative_rate":"59.8% (baseline realistic) to 99.4% (reference patient) of all CD patients missed by cascade","key_limitations":["Step 1 (clinical recognition): only 35% PCPs ever diagnosed CD; 70% consider it rare; recognition <50% for non-GI symptoms","Step 2 (decision to test): 18–61% testing rate depending on patient demographics; dominant bottleneck","Step 3 (IgA deficiency): affects 2–3% CD patients; compliance with concurrent total IgA measurement incomplete","Step 4 (serology): commonly cited 93% is verification-biased; unbiased range 57–91%; Marsh-3A-specific 42–85%; lab-to-lab 40–86%","Step 5 (referral): 79.2% seropositive vs 3.6% seronegative proceed to biopsy — 22-fold differential","Step 6 (endoscopy): ~10% of CD had prior non-diagnostic endoscopy without biopsies; elderly OR 0.51","Step 7 (biopsy adequacy): only 35% US compliance with ≥4 specimens; diagnostic yield doubles with compliance","Step 8 (orientation): 42–66% well-oriented; complete grade inversion demonstrated experimentally","Step 9 (pathology): 25% diagnosis change on expert re-review; κ=0.30–0.33 for Marsh 3A; 41% misclassified as normal; IEL counts missing from 86% of reports","Independence assumption violated in both directions — positively correlated in practice setting, negatively correlated by Marsh grade","True denominator (all individuals with celiac mucosal injury) unknown"]},"contradictory_studies":[{"citation":"Hujoel et al. 2021 verification bias correction vs conventional meta-analyses","pmid":"PMID:32433257","finding":"Begg & Greenes corrected tTG-IgA sensitivity 57.1% (95% CI 35.4–76.4%) vs reported 92.6%. Authors cautioned figure 'should not be viewed as true sensitivity' but the correction quantifies verification bias magnitude.","contradicts":"ACG 2023 guidelines citing ~93% sensitivity; all meta-analyses derived from serology-gated cohorts"},{"citation":"Hopper et al. 2008 universal biopsy study","pmid":"PMID:18328437","finding":"Biopsied all 2,000 consecutive gastroscopy patients regardless of serology. tTG-IgA sensitivity 90.9% overall, 85% Marsh 3A, 100% Marsh 3C. 9% seronegative CD.","contradicts":"Both the conventional 93% (Hopper finds slightly lower) and the extreme pessimistic interpretation (Hopper confirms tTG-IgA is still excellent). Key limitation: single tertiary center."},{"citation":"Abrams et al. 2006 lab-to-lab variability","pmid":"PMID:16630760","finding":"tTG sensitivity 40% (Lab #1) vs 86.4% (Lab #2), P<.0001. Sensitivity for partial villous atrophy 42.3% across both labs combined.","contradicts":"Assumption of uniform tTG-IgA performance; 42.3% Marsh 3A sensitivity far below the commonly cited ~93%"},{"citation":"Shiha et al. 2024 meta-analysis no-biopsy approach in adults","pmid":"PMID:38176661","finding":"tTG-IgA ≥10× ULN: 100% specificity (95% CI 98–100%), but sensitivity only 51%. Only half of CD patients reach threshold.","contradicts":"Assumption that no-biopsy pathway can replace biopsy for all patients. Pathway excellent for those who qualify but misses ~49% who still need full cascade."},{"citation":"Cartee et al. 2024 racial disparities in CD seronegativity","pmid":"Gastro Hep Advances 2024","finding":"80% of Black patients with biopsy-confirmed CD had tTG-IgA below ULN vs ~9% white patients (n=42 Black patients).","contradicts":"Assumption of race-invariant serology performance; if replicated, implies tTG-IgA is fundamentally unsuitable for CD screening in Black Americans"},{"citation":"Lebwohl et al. 2011 biopsy adequacy","pmid":"PMID:21601201","finding":"Only 35% US endoscopies have ≥4 specimens. CD diagnostic yield doubled from 0.7% to 1.8% with ≥4 biopsies (n=132,352).","contradicts":"Assumption that biopsy is a reliable confirmatory step; 65% non-compliance with specimen guidelines substantially degrades biopsy sensitivity"},{"citation":"Arguelles-Grande et al. expert pathology re-review","pmid":"PMID:22081783","finding":"Expert re-review changed diagnosis in 25% of 102 community/commercial lab biopsies. 41% Marsh 3A called normal. IEL counts missing from 86% of reports.","contradicts":"Assumption of reliable histopathological interpretation; community pathology is substantially worse than academic center estimates used in guidelines"},{"citation":"CiPiS longitudinal childhood screening study","pmid":"PMID:38477348","finding":"1.0% of HLA-risk children negative at both ages 3 and 9 developed CD by age 15. Five of ten age-15 CD cases were negative at both prior screenings.","contradicts":"Assumption that a single negative childhood screen provides lasting reassurance. Late seroconversions are real and unpredictable."}],"research_gaps":[{"gap":"No published study has formally modeled the multiplicative product of celiac diagnostic cascade step sensitivities","importance":"high","proposed_study_design":"Systematic cascade sensitivity analysis using step-specific data from published literature with Monte Carlo simulation for uncertainty propagation; validation against observed diagnosis rates"},{"gap":"No population-based study with systematic biopsy independent of serology exists for adults","importance":"high","proposed_study_design":"Universal duodenal biopsy in consecutive gastroscopy patients across multiple community and academic centers, with HLA genotyping, blinded to serology results; stratified analysis by Marsh grade and HLA type"},{"gap":"HLA-genotype-stratified serology sensitivity has never been measured in any study","importance":"high","proposed_study_design":"Prospective biopsy-confirmed CD cohort with concurrent HLA typing and multiple serological tests; stratified sensitivity calculation for DQ2.5, DQ2.2, DQ8, and half-DQ2"},{"gap":"Bayesian latent class analysis has never been applied to CD diagnostic accuracy — the appropriate method when neither test (serology nor biopsy) is a perfect gold standard","importance":"high","proposed_study_design":"Latent class model incorporating serology, biopsy, HLA typing, clinical response to GFD, and mucosal deposit testing as imperfect reference standards"},{"gap":"True serology sensitivity in Black Americans unknown beyond small registry data (Cartee n=42)","importance":"high","proposed_study_design":"Multi-center prospective study of CD serology performance in racially diverse biopsy-confirmed cohort; minimum n=200 Black patients with CD"},{"gap":"Impact of IgG1 subclass deficiency on celiac serology and mucosal IgA production via sequential class switching pathway not studied","importance":"high","proposed_study_design":"Prospective measurement of IgG subclasses in seronegative villous atrophy patients; correlation with mucosal tTG-IgA deposits, fecal secretory IgA, and TACI/TNFRSF13B genetics"},{"gap":"No formal cost-effectiveness analysis of universal adult CD screening exists","importance":"high","proposed_study_design":"Markov model incorporating true cascade sensitivity (not inflated serology-only figure), quality-adjusted life years for treated vs untreated CD, cost of complications (lymphoma, osteoporosis, autoimmune diseases)"},{"gap":"Pre-serology patient loss (Steps 1–2) has never been directly measured in any diagnostic accuracy study","importance":"high","proposed_study_design":"Prospective audit of all patients presenting to primary care with guideline-indicated symptoms, tracking proportion who receive appropriate CD testing; stratified by presentation type, demographics, and physician characteristics"},{"gap":"The correlation structure between cascade steps has not been formally modeled","importance":"medium","proposed_study_design":"Multi-level modeling of cascade outcomes using patient-level data across multiple centers, estimating conditional probabilities of step failure given prior step outcomes"},{"gap":"Post-2020 biopsy adequacy and pathology agreement data needed — most cited studies are 10–20 years old","importance":"medium","proposed_study_design":"Contemporary multi-center audit of biopsy specimen counts, orientation quality, and pathology reporting completeness with comparison to 2011 Lebwohl baseline"}],"differential_diagnoses_relevant":[{"condition":"Non-celiac gluten sensitivity (NCGS)","overlap_with_cd":"Symptoms overlap extensively; some NCGS patients may have low-grade CD missed by serology and inadequate biopsy. No biomarker distinguishes NCGS from seronegative CD with certainty.","distinguishing_features":"NCGS: typically Marsh 0–1 (no villous atrophy); negative serology; no HLA-DQ2/8 requirement (though 50% positive); no mucosal tTG-IgA deposits; diagnosis by exclusion + blinded gluten challenge"},{"condition":"Selective IgA deficiency","overlap_with_cd":"Affects 2–3% of CD patients (10–15× general population). Causes false-negative IgA-based serologies by definition. Guidelines recommend concurrent total IgA measurement and IgG-based backup tests.","distinguishing_features":"Total serum IgA <0.07 g/L; IgG-tTG2 and IgG-DGP should be positive in IgA-deficient CD patients (unless concurrent IgG subclass deficiency)"},{"condition":"Common variable immunodeficiency (CVID)","overlap_with_cd":"Causes villous atrophy with increased IELs mimicking CD. Serology negative due to hypogammaglobulinemia. Major differential in seronegative villous atrophy.","distinguishing_features":"Low total immunoglobulins (IgG, IgA, IgM); poor vaccine responses; recurrent infections; absence of plasma cells in lamina propria; nodular lymphoid hyperplasia; no HLA-DQ2/8 requirement"},{"condition":"Drug-induced enteropathy (olmesartan, mycophenolate, others)","overlap_with_cd":"Can cause identical villous atrophy and IEL increase. Serology negative. Important differential in seronegative villous atrophy, especially in elderly patients on multiple medications.","distinguishing_features":"Temporal relationship to drug initiation; resolution on drug withdrawal; olmesartan most commonly implicated (sprue-like enteropathy)"},{"condition":"Autoimmune enteropathy","overlap_with_cd":"Villous atrophy with inflammation; can occur in adults. Serology negative for celiac markers.","distinguishing_features":"Anti-enterocyte antibodies; often associated with other autoimmune conditions; may not respond to GFD; deep crypt apoptosis"}],"recommendations":[{"recommendation":"Report celiac diagnostic accuracy as CUMULATIVE CASCADE SENSITIVITY rather than individual test sensitivity. Guidelines should explicitly state that the end-to-end diagnostic yield is 5–40% per encounter, not 93%.","target":"guidelines, researchers","evidence_basis":"First multiplicative cascade analysis showing cumulative sensitivity 19–64% (baseline) and 0.7–18.2% (real-world); observed 17% US diagnosis rate matches pessimistic cascade output"},{"recommendation":"Implement population screening for celiac disease, bypassing the clinical recognition bottleneck (Steps 1–2). Optimal timing: ages 4 and 11 for children, with at least one adult screen at a life-stage transition.","target":"guidelines, public health","evidence_basis":"Pre-testing steps account for more patient loss than all post-serology steps combined; Italy Law 130/2023 as model; Mäkinen optimal screening ages 4 and 11; CD NNS (67–100) compares favorably to established screening programs"},{"recommendation":"Expand no-biopsy diagnostic criteria to all patients with tTG-IgA ≥10× ULN confirmed on repeat sample, bypassing biopsy cascade Steps 6–9. This eliminates four failure-prone steps for ~50% of seropositive patients.","target":"guidelines, clinicians","evidence_basis":"Shiha 2024: 100% specificity (95% CI 98–100%) for ≥10× ULN in adults; ESsCD 2025 conditional extension to adults <45; post-serology cascade efficiency only 55%"},{"recommendation":"Mandate routine duodenal biopsy (≥4 specimens + bulb) during endoscopy for any guideline-indicated condition (IDA, chronic diarrhea, weight loss, osteoporosis) regardless of serology status or endoscopic appearance.","target":"guidelines, endoscopists","evidence_basis":"Lebwohl 2011: diagnostic yield doubles with ≥4 specimens; 35% US compliance; UK education intervention doubled diagnosis rate; ~10% of CD had prior non-diagnostic endoscopy"},{"recommendation":"Require CD3 immunohistochemistry and quantitative Vh:Cd morphometry for all borderline and seronegative biopsies. Mandate expert GI pathology review for seronegative villous atrophy.","target":"pathologists, guidelines","evidence_basis":"Arguelles-Grande: 25% diagnosis change on expert review; 41% Marsh 3A called normal; κ=0.211 community vs expert; IEL counts missing from 86% of reports; morphometry ICC=0.978 vs subjective κ=0.35"},{"recommendation":"Implement EHR-automated testing prompts for guideline-indicated conditions (IDA, osteoporosis, T1D, unexplained transaminase elevation, chronic diarrhea) to reduce pre-serology patient loss.","target":"clinicians, health systems","evidence_basis":"NLP-based EHR algorithms: 72.9% sensitivity, 89.9% specificity; ML models AUC 0.86; addresses dominant bottleneck (Steps 1–2) where physician awareness is insufficient"},{"recommendation":"Require HLA genotype stratification in all future celiac diagnostic accuracy studies. DQ8-specific serology sensitivity is currently unknown.","target":"researchers","evidence_basis":"DQ8 comprises 5–10% of CD; associated with lower antibody titers and overrepresentation in ultra-short CD; no published study stratifies sensitivity by HLA genotype"},{"recommendation":"Measure IgG subclasses in patients with negative serology but persistent clinical suspicion, especially if secretory IgA is low. Consider IgG1 deficiency as an independent pathway to seronegativity via impaired IgM→IgG1→IgA class switching.","target":"clinicians, guidelines","evidence_basis":"Siniscalco 2025 (Immunity): sequential class switching pathway; IgG1 deficiency impairs mucosal IgA production independently of HLA mechanisms; not yet integrated into diagnostic algorithms"},{"recommendation":"Include γδ T-cell assessment (FFPE IHC or flow cytometry) in diagnostic workup of seronegative patients and diagnostically difficult cases.","target":"clinicians, pathologists","evidence_basis":"96% sensitivity / 95% specificity on FFPE; 87% sensitivity in seronegative VA; remains elevated on GFD; one of few serology-independent diagnostic tools"},{"recommendation":"Remove demographic factors (age, sex, ethnicity) from clinical decision-making about CD testing. The current system has built-in demographic biases that systematically exclude elderly, male, and non-white patients.","target":"clinicians, guidelines, health systems","evidence_basis":"Spencer: 18% vs 61% testing by age; Lebwohl: OR 0.51 elderly, OR 0.55 non-white; diagnosed F:M 2–3:1 vs seroprevalence ~1:1; Cartee: potentially 80% seronegativity in Black patients"}],"meta_analysis_summary":{"studies_reviewed":65,"total_patients":"Greater than 250,000 across all cited studies (132,352 in Lebwohl biopsy adequacy alone; 2,000 in Hopper universal biopsy; multiple meta-analyses with thousands each)","pooled_estimates":{"baseline_cascade_cumulative_sensitivity":{"optimistic":"63.5%","realistic":"40.2%","pessimistic":"19.2%"},"real_world_cascade_cumulative_sensitivity":{"optimistic":"18.2%","realistic":"5.4%","pessimistic":"0.7%"},"subgroup_cumulative_sensitivity_realistic":{"marsh_3a_hopper":"18.4%","marsh_3a_abrams":"6.6%","elderly_70_plus":"4.6%","black_patients":"0.2%","partial_GFD":"6.6%","reference_patient":"0.6%"},"lifetime_detection_models":{"symptom_triggered_only":"~17%","plus_childhood_screen_age_10":"~40-50%","universal_screening_5_18_40":"~65-75%"},"post_serology_cascade_efficiency":"55.3% (biopsy pathway); 77.5% (blended with no-biopsy)","childhood_screening_capture_rates":{"single_age_2":"27.9%","single_age_5":"60.5%","single_age_10":"79.1%","triple_2_5_10":"83.4%","optimal_single_age_11":"~80%","optimal_repeated_4_plus_11":"~85%"}},"heterogeneity_notes":"Extreme heterogeneity across cascade steps reflects genuine practice variation rather than statistical artifact. Step 4 (serology) sensitivity ranges from 40% (worst commercial lab, Marsh 3A) to 100% (Marsh 3C, research setting) — a 60-percentage-point spread. Step 9 (pathology) ranges from κ=0.211 (community vs expert) to κ=0.888 (university centers). Population distribution is bimodal (good vs poor centers) rather than uniform, meaning average sensitivity is less informative than the extremes. Independence assumption violations operate in both directions: positive correlation at practice-setting level (inflates apparent failure), negative correlation at disease-severity level (understates failure for mild disease). The most robust finding is the mathematical demonstration that serial filtering of nine 80–95% steps necessarily produces <50% cumulative sensitivity — a structural property that is model-independent."},"cascade_tables":{"note":"Full cascade tables included as supplementary structured data","table_1_baseline_classical_adult":{"steps":[{"step":1,"description":"Clinical recognition","optimistic":0.95,"realistic":0.9,"pessimistic":0.8},{"step":2,"description":"Serology ordered","optimistic":0.9,"realistic":0.85,"pessimistic":0.75},{"step":3,"description":"IgA deficiency addressed","optimistic":0.99,"realistic":0.98,"pessimistic":0.97},{"step":4,"description":"tTG-IgA detects CD","optimistic":0.95,"realistic":0.91,"pessimistic":0.85},{"step":5,"description":"Referral to GI","optimistic":0.95,"realistic":0.85,"pessimistic":0.79},{"step":6,"description":"Endoscopy completed","optimistic":0.95,"realistic":0.92,"pessimistic":0.85},{"step":7,"description":"Adequate biopsy (≥4 + bulb)","optimistic":0.95,"realistic":0.9,"pessimistic":0.85},{"step":8,"description":"Proper orientation","optimistic":0.97,"realistic":0.93,"pessimistic":0.85},{"step":9,"description":"Correct pathology","optimistic":0.95,"realistic":0.9,"pessimistic":0.8}],"cumulative_sensitivity":{"optimistic":"63.5%","realistic":"40.2%","pessimistic":"19.2%"}},"table_2_real_world_primary_care":{"steps":[{"step":1,"description":"Clinical recognition (mixed)","optimistic":0.55,"realistic":0.35,"pessimistic":0.2},{"step":2,"description":"Serology ordered","optimistic":0.65,"realistic":0.5,"pessimistic":0.3},{"step":3,"description":"IgA deficiency addressed","optimistic":0.95,"realistic":0.85,"pessimistic":0.7},{"step":4,"description":"tTG-IgA detects CD","optimistic":0.91,"realistic":0.85,"pessimistic":0.7},{"step":5,"description":"Referral to GI","optimistic":0.85,"realistic":0.79,"pessimistic":0.7},{"step":6,"description":"Endoscopy completed","optimistic":0.92,"realistic":0.88,"pessimistic":0.8},{"step":7,"description":"Adequate biopsy","optimistic":0.9,"realistic":0.85,"pessimistic":0.75},{"step":8,"description":"Proper orientation","optimistic":0.93,"realistic":0.88,"pessimistic":0.8},{"step":9,"description":"Correct pathology","optimistic":0.9,"realistic":0.82,"pessimistic":0.75}],"cumulative_sensitivity":{"optimistic":"18.2%","realistic":"5.4%","pessimistic":"0.7%"}},"table_3_subgroup_cascades_realistic":{"subgroups":{"marsh_3a_hopper":{"cumulative":"18.4%","key_driver":"Serology 85%, pathology 65%"},"marsh_3a_abrams":{"cumulative":"6.6%","key_driver":"Serology 42%, pathology 59%"},"elderly_70_plus":{"cumulative":"4.6%","key_driver":"Recognition 55%, testing 35%, endoscopy 75%"},"black_patients":{"cumulative":"0.2%","key_driver":"Serology 20% (Cartee preliminary), recognition 25%"},"partial_GFD":{"cumulative":"6.6%","key_driver":"Serology 50%, recognition 60%"},"reference_patient":{"cumulative":"0.6%","key_driver":"Serology 0%, rescue biopsy 3.6%"}}}},"strongest_counterarguments":[{"counterargument":"Hopper 91% is more clinically relevant than Hujoel 57%","explanation":"Hujoel's Begg & Greenes correction assumes the ONLY factor influencing biopsy is serology result. Symptoms, family history, endoscopic appearance, and clinical judgment all influence biopsy decisions, violating this assumption. Hopper's universal-biopsy design avoids this entirely. At 91%, tTG-IgA remains an excellent test.","rebuttal":"Even at 91%, post-serology cascade efficiency is only 55%, yielding ~50% end-to-end for tested patients. The pre-testing bottleneck (Steps 1–2) remains dominant regardless of Step 4 estimate."},{"counterargument":"Seronegative CD may be genuinely rare and clinically insignificant","explanation":"Hopper found only 7/77 seronegative CD (9%), mostly milder histology. Some may represent transient enteropathy, non-celiac villous atrophy, or early-stage disease not warranting lifelong GFD. Paris Consensus strict criteria: 1.7–6.4%.","rebuttal":"Even at conservative 6%, this represents ~180,000 US patients structurally invisible to screening. Some seronegative cases develop severe complications. The question is not whether seronegative CD exists but whether the system should systematically ignore it."},{"counterargument":"Clinical practice compensates for cascade gaps through physician judgment and alternative pathways","explanation":"No-biopsy pathway (tTG ≥10× ULN) bypasses Steps 6–9 for ~50% seropositive patients. ACG guidelines include 'high suspicion despite negative serology' escape clause. Physicians exercise judgment beyond algorithmic adherence.","rebuttal":"The 'high suspicion despite negative serology' escape clause is operationally circular — in standard clinical workflows, suspicion depends on serology results. Escape clause exists on paper but is never triggered in practice. No-biopsy improves outcomes for ~50% of already-seropositive patients but does nothing for seronegative cases."},{"counterargument":"The multiplicative model is the wrong framework — patients cycle through healthcare repeatedly","explanation":"Single-pass cascade dramatically underestimates lifetime detection capacity, as shown by the gap between 5% per-encounter and 17% lifetime detection. Missed diagnosis today becomes future opportunity.","rebuttal":"Correct — which is why lifetime modeling yields 17%, not 5%. But 17% over 40 years is still catastrophically low. And the model demonstrates WHY repeated encounters don't help more: the same structural barriers exist at every encounter for the same patient."},{"counterargument":"Many chronic diseases have similar diagnostic gaps — this is not unique to CD","explanation":"Type 2 diabetes: ~21% undiagnosed; hypertension, osteoporosis, CKD all have substantial undiagnosed fractions. The celiac gap may reflect fundamental challenges of subclinical disease, not a unique cascade failure.","rebuttal":"Valid contextual point. However, T2DM diagnosis requires only a blood test (no 9-step cascade). The celiac diagnostic architecture is uniquely complex among chronic diseases, with no other condition requiring serial clinical recognition → serology → referral → endoscopy → adequate biopsy → orientation → expert pathology."}],"reference_patient_analysis":{"patient_profile":"DQ8 genotype, Marsh 3A on biopsy, IgA-tTG2 <1, anti-DGP IgG <1, low IgG1 subclass, low fecal secretory IgA","cumulative_cascade_sensitivity":"0.6%","cascade_failure_modes":["Step 4 — Serology: Zero sensitivity by definition (all serologies negative). Neither IgA-based nor IgG-based tests detect this patient.","Step 5 — Referral: Only 3.6% of seronegative patients receive biopsy (Hujoel 2021). This is the patient's only pathway to diagnosis.","Step 7 — Biopsy adequacy: DQ8 overrepresented in ultra-short CD where lesions may be confined to bulb; if bulb not biopsied, disease missed entirely.","Step 8 — Orientation: Marsh 3A has the narrowest Vh:Cd diagnostic window; slight obliquity converts true atrophy to apparent normal.","Step 9 — Pathology: Marsh 3A κ=0.30–0.33; 41% called normal in community practice; seronegative status means pathologists lack the serology anchor that improves agreement by 10%.","Mucosal deposits: Even the 'rescue biomarker' of mucosal tTG-IgA deposits (90% sensitive in standard SNCD) may be reduced in this patient because IgG1 deficiency impairs sequential IgM→IgG1→IgA class switching (Siniscalco 2025).","IgG1 deficiency: Compromises both primary IgA testing AND backup IgG testing via an independent immunological pathway unrelated to HLA mechanisms."],"diagnostic_pathway_required":"γδ T-cell assessment (87% sensitivity in seronegative VA, FFPE IHC), quantitative Vh:Cd morphometry, and clinical GFD response trial represent the only reliable diagnostic tools for this profile. TACI/TNFRSF13B genetic testing to determine if IgG1 deficiency is primary (genetic, non-reversible) vs secondary. Salivary IgA to distinguish systemic vs gut-specific secretory defect.","novel_insight":"This patient profile demonstrates that the diagnostic cascade has not one but MULTIPLE simultaneous failure modes, each independently sufficient to prevent diagnosis. The cascade was designed for the modal celiac patient (seropositive, DQ2.5, Marsh 3C) and becomes progressively dysfunctional as any parameter deviates from this modal profile."},"null_hypothesis_assessment":{"null_hypothesis":"Current diagnostics are approximately correct, seronegative CD is rare, and the undiagnosed population either has trivial disease or would not benefit from diagnosis","evidence_supporting_null":["Hopper 91% sensitivity is an excellent test by any standard","No-biopsy pathway achieves 100% specificity for high-titer patients","Some seronegative VA cases represent non-celiac enteropathies","No RCT demonstrates net benefit of universal screening","Many chronic diseases have similar undiagnosed fractions","Finland's better detection has not clearly improved population-level CD outcomes relative to other countries"],"evidence_against_null":["17% US diagnosis rate is too low to be explained by rare seronegative disease alone","Finland's 25% detection (world's best) confirms structural limits, not complacency","Multiplicative cascade analysis mathematically predicts the observed gap without invoking rare SNCD","Pre-testing bottleneck (Steps 1–2) is the dominant failure mode, not serology","Subgroup vulnerabilities (elderly, Black patients, Marsh 3A) are documented by multiple independent studies","Untreated CD carries dose-dependent risks (lymphoma, osteoporosis, autoimmune diseases, mortality) regardless of symptoms","Even conservative SNCD estimates (6%) represent ~180,000 US patients"],"assessment":"The null hypothesis is partially correct: current diagnostics work well for the modal celiac patient (seropositive, DQ2.5, Marsh 3C, young-adult Caucasian with classical symptoms). However, the null hypothesis fails to explain the observed 83% undiagnosed rate, which this analysis demonstrates is a predictable structural outcome of serial filtering — not primarily a function of rare seronegative disease. The largest diagnostic gap comes from pre-testing attrition (Steps 1–2), which affects ALL CD patients regardless of serological profile. The null hypothesis is least tenable for specific subgroups where cumulative sensitivity drops below 5%."}}
