{"research_topic_id":"7.2","research_topic_title":"Critical Analysis of Celiac Disease Clinical Guidelines Against Project Evidence","date_completed":"2026-02-12","version":"FINAL v2.0 — revised after parallel Opus 4.6 twin peer review","executive_summary":"Systematic evaluation of four major celiac disease guidelines (ACG 2023, ESPGHAN 2020, ESsCD 2025, BSG 2014) against 32 completed project research files reveals 12 specific misconceptions embedded in current recommendations. The most consequential is the uncritical citation of '>93% sensitivity' for IgA-tTG2, which verification-bias-corrected data places at 57-85% depending on methodology. ACG 2023 uniquely acknowledges verification bias and cites a 63-93% sensitivity range in its evidence review, yet omits the key correction paper (Hujoel 2021, co-authored by guideline lead Rubio-Tapia) and still leads with high sensitivity in recommendation-level language. ESsCD 2025 represents meaningful progress (first adult no-biopsy pathway, first structured SNVA algorithm, AGREE II/GRADE methodology), but retains verification-biased pooled sensitivity (90.7%) and does not address racial disparities, sex-specific HLA NPV, or the secretory-versus-serum IgA distinction. Cumulative diagnostic cascade sensitivity is 5-40% per clinical encounter versus the >90% implied by guidelines — a gap that mathematically predicts the observed 83% US undiagnosed rate. The fundamental architectural flaw across all guidelines is conflating the B-cell antibody response (which current tests measure) with the T-cell-mediated gluten response (which defines the disease). Seronegative CD prevalence estimates (6-22% of confirmed CD, hypothesized upper bounds of 15-43% at population level) remain preliminary and require prospective validation, but the mechanisms underlying seronegativity — IgG1 class-switching dependency, mucosal IgA compartmentalization, HLA-genotype-dependent antibody production — are biologically established. A 2023 AGREE II assessment of 10 CD guidelines (Graham et al.) found adult guidelines scored 21% on applicability, indicating critical failure in implementation guidance.","key_findings":[{"finding_id":"7.2-F1","finding":"All four major guidelines cite IgA-tTG2 sensitivity of 90-98% without adequate correction for verification bias. ACG 2023 uniquely acknowledges verification bias and cites a 63-93% sensitivity range in its evidence review — a meaningful advance. However, it does not cite Hujoel et al. 2021 (co-authored by guideline lead Rubio-Tapia) which applied the Begg-Greenes correction yielding 57.1% (95% CI 35.4-76.4%), and recommendation-level language still implies high sensitivity. ESPGHAN 2020 goes furthest, stating 'no study could provide valid data on sensitivity for case finding' due to verification bias — yet still recommends serology-first diagnosis. ESsCD 2025 cites pooled 90.7% (95% CI 87.3-93.2%) from meta-analyses without naming the verification bias that inflates this estimate. No guideline reports sensitivity stratified by Marsh grade or HLA genotype.","evidence_strength":"strong","quantitative_estimate":"Guideline-cited: 90-98%; Verification-bias-adjusted: 57-85%; Marsh 3A-specific: 0-42%","confidence_interval":"Adjusted 95% CI: 35.4-76.4% (Hujoel); reconciled range 70-85%","key_citations":["PMID:36602836","PMID:32433257","PMID:18328437","PMID:15185855","PMID:31210940","PMID:40999951"],"contradicts_guidelines":true,"affected_patient_population":"All CD patients screened via serology-first algorithms; disproportionately Marsh 3A, DQ8, elderly, non-white patients"},{"finding_id":"7.2-F2","finding":"No guideline reports IgA-tTG2 sensitivity stratified by Marsh grade. Sensitivity ranges from ~96% (Marsh 3C) to 50-70% (Marsh 3A) to <10% (Marsh 1-2). Since Marsh 3A accounts for approximately 38% of celiac histology, the unstratified sensitivity figure dramatically overstates detection of mild-to-moderate disease. Project finding 1.2 demonstrated this gradient; finding 2.4 showed Marsh 3A community detection is 6.6-18.4%.","evidence_strength":"strong","quantitative_estimate":"Marsh 3C: ~96%; Marsh 3A: 42-85% (varies by setting); Marsh 1: 7.7%","confidence_interval":null,"key_citations":["PMID:12590232","PMID:15185855","PMID:18328437"],"contradicts_guidelines":true,"affected_patient_population":"Marsh 3A patients (~38% of celiac histology)"},{"finding_id":"7.2-F3","finding":"The ESsCD 2025 guideline represents the most significant advance among evaluated guidelines: first adult no-biopsy pathway (≥10×ULN, age <45, specialist confirmation), first structured seronegative villous atrophy (SNVA) diagnostic algorithm, acknowledgment of assay heterogeneity requiring local validation, and revised biopsy protocols mandating ≥4 D2 specimens with conditional bulb biopsy. However, it still does not name verification bias, does not stratify sensitivity by Marsh grade, and the no-biopsy pathway excludes ~50-59% of CD patients by definition.","evidence_strength":"strong","quantitative_estimate":"No-biopsy pathway sensitivity: 51% (Shiha 2024 meta-analysis); 41-61% eligible depending on assay platform","confidence_interval":"95% CI 42-60% for no-biopsy sensitivity","key_citations":["PMID:40999951","PMID:38176661","PMID:28624578"],"contradicts_guidelines":false,"affected_patient_population":"Adults with CD — ESsCD 2025 improves detection for high-titer patients but does not address seronegative, Marsh 3A, or atypical populations"},{"finding_id":"7.2-F4","finding":"All guidelines state 'negative HLA-DQ2/DQ8 effectively excludes CD' with NPV ~99%. Project evidence shows: NPV is only 90.5% in males (Megiorni 2008 — unreplicated in 17+ years), 6.1% of European celiacs lack complete DQ2/DQ8 (rising to 9.6% in Southern Europe), DQ7.5 carriers show 8.7% enteropathy rate (Flores-Marin 2024), and the 99% NPV was itself derived from serology-gated cohorts (circular validation). No guideline reports sex-stratified or population-stratified NPV.","evidence_strength":"moderate","quantitative_estimate":"NPV 99% (guideline); 90.5% in males; 6.1% non-DQ2/DQ8 celiacs (Europe-wide); 9.6% Southern Europe","confidence_interval":null,"key_citations":["PMID:18177450","PMID:12651074","Flores-Marin 2024 Harvard"],"contradicts_guidelines":true,"affected_patient_population":"Male CD patients; Southern European populations; DQ7.5/DQ5/half-DQ2 carriers"},{"finding_id":"7.2-F5","finding":"Seronegative CD is treated as rare (<5%) by all guidelines, with the primary safeguard being 'check total serum IgA.' A 2024 Gastroenterology review by Volta, Caio, and Lundin compiled early biopsy-independent studies finding SNCD prevalence of 12.7-37.9% (mean 24.2%). Dickey et al. (2000) titled their paper 'Reliance on serum endomysial antibody testing underestimates the true prevalence of coeliac disease by one fifth,' finding EMA missed 22% of biopsy-confirmed villous atrophy in biopsies not prompted by serology. Project evidence shows: (a) SNCD may be 6-22% of biopsy-confirmed CD (these are hypothesized upper bounds requiring prospective validation); (b) secretory IgA can be severely depleted with normal serum IgA (finding 3.5); (c) IgG1 subclass deficiency impairs both IgA-based AND IgG-based backup tests via sequential class switching (Siniscalco 2025, Immunity); (d) 80% of Black CD patients may be seronegative (Cartee, preliminary n=42 — requires replication in larger diverse cohorts). The total IgA check addresses only one of multiple seronegativity mechanisms. Under stringent Paris Consensus criteria (flat villi + HLA + GFD response), SNCD is 1.7-2.7% — but this excludes Marsh 3A patients and reflects ascertainment bias in who gets biopsied.","evidence_strength":"moderate","quantitative_estimate":"Guideline estimate: <5% seronegative; Project estimate: 6-22% (biopsy-confirmed), potentially 15-43% population-level","confidence_interval":"Wide uncertainty — population-level SNCD estimates are hypothesized upper bounds requiring prospective biopsy-independent validation. Paris Consensus 1.7-2.7% likely undercounts by excluding Marsh 3A and requiring 12+ month GFD response.","key_citations":["PMID:32433257","PMID:39132179","Siniscalco 2025 Immunity","Volta/Caio/Lundin 2024 Gastroenterology (SNCD prevalence review)","Dickey et al. 2000 (EMA misses 22% of VA)"],"contradicts_guidelines":true,"affected_patient_population":"All seronegative CD patients; IgG1-deficient patients; Black CD patients; DQ8-only patients"},{"finding_id":"7.2-F6","finding":"Biopsy is described as 'gold standard' by all guidelines without adequate acknowledgment of its limitations. Project evidence: inter-observer kappa for Marsh 3A is only 0.33 (barely above chance); 41% of Marsh 3A called normal by community pathologists; biopsy adequacy (≥4 specimens) achieved in only 35% of US endoscopies; binary diagnosis agreement improves 10% when serology provided (proving non-independence); and community vs academic pathology shows a 2.1× reliability gap (κ=0.419 vs 0.888).","evidence_strength":"strong","quantitative_estimate":"κ=0.33 (Marsh 3A); 35% biopsy adequacy; 41% Marsh 3A misclassified; κ=0.419 community vs 0.888 academic","confidence_interval":null,"key_citations":["PMID:17544877","PMID:22081783","PMID:21601201","DOI:10.1136/bmjgast-2023-001252"],"contradicts_guidelines":true,"affected_patient_population":"All patients biopsied for CD, especially seronegative patients whose biopsies lack the serology 'anchor'"},{"finding_id":"7.2-F7","finding":"GFD monitoring via serology is recommended by most guidelines as adequate. Project evidence (finding 8.4) shows serology has only 50% sensitivity for persistent villous atrophy — meaning half of patients with ongoing mucosal damage have falsely reassuring serology. No guideline recommends HLA-stratified monitoring despite evidence that DQ8 patients have lower baseline titers making serology monitoring even less reliable.","evidence_strength":"moderate","quantitative_estimate":"50% serology sensitivity for persistent villous atrophy during GFD monitoring","confidence_interval":null,"key_citations":["Finding 8.4 project data"],"contradicts_guidelines":true,"affected_patient_population":"All CD patients on GFD; elderly (OR 5.1 for persistent VA); DQ8 patients"},{"finding_id":"7.2-F8","finding":"No guideline reports cumulative diagnostic cascade sensitivity. Project finding 7.1 demonstrated that nine sequential diagnostic steps (clinical recognition → testing decision → IgA check → serology → referral → endoscopy → biopsy adequacy → orientation → pathology interpretation) at 80-95% each yield 5.4% realistic cumulative sensitivity per primary care encounter. The observed 83% US undiagnosed rate is a mathematically predictable outcome of this serial filtering, not a system aberration.","evidence_strength":"strong","quantitative_estimate":"Guidelines imply ~95% detection; cascade analysis shows 5.4% per encounter (realistic); 40% per encounter (baseline optimistic)","confidence_interval":"Range: 0.7% (pessimistic primary care) to 63.5% (optimistic baseline)","key_citations":["Finding 7.1 project data","PMID:22850429","PMID:32433257"],"contradicts_guidelines":true,"affected_patient_population":"All CD patients in real-world primary care settings"},{"finding_id":"7.2-F9","finding":"Special populations are inadequately addressed across all guidelines. Elderly (≥60): only 18% PCP testing rate for elderly male IDA, 58% undetected in population screening, 4.6% cumulative cascade sensitivity. Non-white: 80% seronegativity in Black patients (preliminary), 4-8× underdiagnosis, 0.2% cascade sensitivity. Already on GFD: 72% without CD diagnosis, serology sensitivity <10% after 12 months GFD. IBS overlap: 2-5% harbor undiagnosed CD, only 2.7% tested. No guideline provides population-specific algorithms.","evidence_strength":"moderate","quantitative_estimate":"Elderly cascade: 4.6%; Black cascade: 0.2%; GFD: <10% serology sensitivity","confidence_interval":"Black seronegativity figure from small sample (n=42) — requires replication","key_citations":["PMID:28931034","PMID:39132179","PMID:28017411"],"contradicts_guidelines":true,"affected_patient_population":"Elderly, non-white, GFD-following, IBS-diagnosed populations"},{"finding_id":"7.2-F10","finding":"Neurological manifestations are framed as complications of untreated CD rather than potentially primary disease. A genuine epidemiological association exists: meta-analysis yields OR 3.18 (95% CI 1.79-5.67) for AGA in sporadic ataxia even after excluding Sheffield data (Lin & Kuo 2018). Anti-tTG6 autoimmunity can occur without enteropathy (55-76% of neurological gluten cases have Marsh 0). However, the evidence base has significant problems: (1) Anti-tTG6 has FAILED independent validation — Rouvroye 2025 (n=683, largest independent study) found NO elevation at standard cutoffs; Lindfors 2011 found tTG6 non-discriminating (17% CD vs 15% controls). (2) Lock et al. found ALL food antibodies (not just anti-gliadin) elevated in ataxia patients; AGA also elevated in 44% of Huntington's disease and 43% of hereditary ataxias — conditions with no plausible gluten etiology. This raises an untested reverse causation hypothesis: neurodegeneration → gut barrier dysfunction → non-specific food antibody elevation. (3) The anti-tTG6 assay exists only as Zedira GmbH research-use-only ELISA with no FDA/CE-IVD clearance; the principal researcher co-developed the IP. (4) All GFD treatment evidence is open-label, single-center (Sheffield), with no blinded RCTs. Guidelines should recommend celiac testing in all idiopathic ataxia and neuropathy (defensible given OR ~3), but should NOT recommend tTG6 incorporation given failed independent validation. ESsCD 2025 appropriately frames neurological disease as potentially primary — its strongest contribution on this topic.","evidence_strength":"weak","quantitative_estimate":"55-76% of gluten ataxia have Marsh 0; OR 3.18 for AGA in ataxia (excluding Sheffield); anti-tTG6 failed multicenter validation","confidence_interval":null,"key_citations":["PMID:40481865","PMID:16227563","PMID:21453693","PMID:29866704","PMID:23086706","PMID:12771263"],"contradicts_guidelines":true,"affected_patient_population":"Idiopathic ataxia/neuropathy patients — genuine association exists but causation and gluten specificity uncertain"},{"finding_id":"7.2-F11","finding":"The ≥10×ULN threshold for no-biopsy diagnosis is assay-dependent. Vermeersch et al. found 41-61% of confirmed CD patients qualify depending on platform. CLIA assays systematically produce higher multiples than FEIA/ELISA. Chang 2025 (4019 children, 12 centers) found PPV at ≥10×ULN ranged 89.3-97.3% by assay, and 24% of results were reported as '>100' without quantification. ESsCD 2025 acknowledges this issue and recommends validated ELISA-based assays; other guidelines do not.","evidence_strength":"strong","quantitative_estimate":"41-61% eligibility variance; PPV 89.3-97.3% by assay; QUANTA Flash requires 28×ULN for 99% PPV","confidence_interval":null,"key_citations":["PMID:28624578","PMID:26172170"],"contradicts_guidelines":true,"affected_patient_population":"Patients near the 10×ULN threshold; varies by laboratory choice"},{"finding_id":"7.2-F12","finding":"The reference patient profile (DQ8, Marsh 3A, all serology <1, low IgG1, low secretory IgA) has calculated cumulative diagnostic cascade sensitivity of 0.6%. No guideline pathway would identify this patient. Five compounding diagnostic failures: (1) zero serology sensitivity by definition; (2) DQ8 reduced T-cell help yields lower mucosal antibody production; (3) IgG1 deficiency impairs ALL IgG backup tests AND IgA class switching via Siniscalco pathway; (4) Marsh 3A at worst histopathology agreement boundary (κ=0.33); (5) DGP peptide has zero homology with DQ8-specific α-I gliadin epitopes. Under the Catassi 'four-out-of-five' diagnostic criteria (HLA, histology, serology, symptoms, GFD response), this patient meets three with a fourth achievable through GFD trial — diagnosis is theoretically possible. But this requires reaching a gastroenterologist sophisticated enough to apply the Catassi framework, which every guideline's serology-first primary care pathway prevents. The patient illustrates the project's central thesis: celiac disease is defined by the T-cell response to gluten, not by the B-cell antibodies we happen to be able to measure.","evidence_strength":"moderate","quantitative_estimate":"0.6% cumulative cascade sensitivity for reference patient","confidence_interval":"Cannot be formally calculated — derived from multiplicative modeling","key_citations":["Finding 7.1 project data","Finding 3.6 convergent model"],"contradicts_guidelines":true,"affected_patient_population":"DQ8-only patients with mild histology and immune deficiency — prevalence unknown but mechanism fully documented"}],"biases_documented":[{"bias_type":"Verification bias in guideline evidence base","description":"All sensitivity estimates cited by guidelines derive from serology-first study designs where 79% of seropositive but only 3.6% of seronegative patients received confirmatory biopsy. No guideline names this bias.","magnitude_estimate":"Inflates apparent sensitivity from 57-85% to 90-98% (5-40 percentage point overestimate)","evidence_sources":["PMID:32433257","Project finding 1.1"]},{"bias_type":"Circular validation between serology and histology","description":"Serology selects patients for the reference standard (biopsy), then is validated against that reference. Biopsy interpretation improves 10% when serology is provided. Neither test is independently validated. Guidelines treat them as independent confirmatory tests.","magnitude_estimate":"Structural — affects all diagnostic accuracy claims. κ improves 0.59→0.67 when serology provided","evidence_sources":["DOI:10.1136/bmjgast-2023-001252","PMID:32433257"]},{"bias_type":"Severity spectrum bias in guideline-cited studies","description":"Most diagnostic accuracy studies enrich for Marsh 3B/3C (severe disease) where both serology and histology perform best. Sensitivity figures do not represent the full clinical spectrum.","magnitude_estimate":"96% sensitivity at Marsh 3C vs 42-85% at Marsh 3A — a gap invisible in unstratified reporting","evidence_sources":["PMID:12590232","PMID:18328437"]},{"bias_type":"DQ2.5 representation bias","description":"Study cohorts are dominated by DQ2.5 patients (70-80% of diagnosed CD). Diagnostic performance for DQ8 (5-10%), DQ2.2, and rare HLA types is essentially unknown. Guidelines apply DQ2.5-derived performance data universally.","magnitude_estimate":"DQ2 homozygosity OR 96.9 for tTG-IgA positivity; DQ8 estimated 50-70% reduced baseline serology signal","evidence_sources":["PMID:17629515","Project finding 3.6"]},{"bias_type":"Geographic and demographic bias","description":"Guidelines are developed primarily by Northern European and North American experts using Northern European cohort data. Application to Southern European, Middle Eastern, Asian, African, and Latin American populations is unvalidated.","magnitude_estimate":"9.6% vs 3.7% non-DQ2/DQ8 celiacs (Southern vs Northern Europe); 80% seronegativity in Black patients","evidence_sources":["PMID:12651074","PMID:39132179"]},{"bias_type":"Guideline applicability gap","description":"Graham et al. (2023, J Can Assoc Gastroenterol) assessed 10 celiac guidelines using AGREE II methodology and found adult guidelines scored only 21% on applicability — indicating critical failure in translating evidence into actionable clinical algorithms. Stakeholder involvement scored below the 60% acceptability threshold. This helps explain why well-intentioned guidelines with acknowledged limitations still produce diagnostic algorithms that perpetuate verification bias.","magnitude_estimate":"21% applicability score vs recommended ≥60% threshold","evidence_sources":["Graham et al. 2023 J Can Assoc Gastroenterol (AGREE II assessment of 10 CD guidelines)"]}],"unproven_assumptions_identified":[{"assumption":"IgA-tTG2 sensitivity exceeds 90% for all celiac disease","evidence_against":"Verification-bias-adjusted 57.1% (Hujoel); Marsh 3A 0-42% (Abrams, Tursi); all-biopsy tertiary 85-91% (Hopper); population-weighted reconciled 70-85%. Five independent project analyses converge on substantially lower sensitivity than guidelines claim.","evidence_for":"Raw pooled meta-analytic sensitivity 90-95% across studies (all affected by verification bias); high sensitivity demonstrated in Marsh 3C. Current system clearly works for severe seropositive disease.","clinical_impact":"Unknown number of seronegative CD patients undiagnosed. The 83% US undiagnosed rate is partially explained by this sensitivity overestimate."},{"assumption":"Checking total serum IgA adequately addresses false-negative IgA-tTG2","evidence_against":"Secretory IgA can be severely low despite normal serum IgA (finding 3.5). IgG1 subclass deficiency impairs both IgA sequential switching AND IgG backup tests (finding 8.2, Siniscalco 2025). DQ8 genotype reduces antibody production through quantitative T-cell help deficit (finding 3.6). Total IgA check addresses only one of ≥4 seronegativity mechanisms.","evidence_for":"IgA deficiency (1/500) is the most common single cause of false-negative IgA tests. Checking total IgA is simple, cheap, and catches a real subset of patients.","clinical_impact":"Patients with normal serum IgA but deficient secretory IgA, IgG1 subclass deficiency, or DQ8-mediated low production are falsely reassured that their serology is valid."},{"assumption":"Negative HLA-DQ2/DQ8 excludes celiac disease with 99% NPV","evidence_against":"6.1% of European celiacs lack complete DQ2/DQ8 (Karell 2003); NPV 90.5% in males (Megiorni 2008); DQ7.5 shows 8.7% enteropathy (Flores-Marin 2024); 9.6% non-DQ2/DQ8 in Southern Europe. The 99% NPV is derived from serology-gated cohorts — circular validation.","evidence_for":"DQ2 and DQ8 have best-characterized gluten peptide binding. >93% of diagnosed celiacs carry DQ2/DQ8. Structural studies support unique binding properties.","clinical_impact":"Male patients, Southern European populations, and DQ7.5/DQ5/half-DQ2 carriers may be incorrectly told CD is excluded."},{"assumption":"Seronegative CD is rare (<5%)","evidence_against":"6-22% of biopsy-confirmed CD is seronegative in modern series. 80% of Black CD patients seronegative (preliminary). Multiplicative cascade analysis shows 15-43% could be seronegative at population level. The 2% figure is itself derived from 96.4% unsampled denominator (Hujoel).","evidence_for":"Large screening studies find >90% seropositive. Clinical significance of mild seronegative enteropathy is debated. Some seronegative VA represents non-celiac causes.","clinical_impact":"If SNCD is 10-20% rather than 2%, approximately 300,000-600,000 US patients have undiagnosed seronegative CD."},{"assumption":"Biopsy is an independent gold standard","evidence_against":"Pathologist agreement κ=0.33 for Marsh 3A. Agreement improves when serology provided (proving non-independence). Only 35% biopsy adequacy. Community vs academic 2.1× reliability gap. Marsh original author rejects 3A/3B/3C subdivisions as misinterpretations.","evidence_for":"Histology directly demonstrates the pathological lesion. Expert-center biopsy with optimal technique is highly reliable. No better tissue-based alternative exists.","clinical_impact":"Over-reliance on biopsy as definitive creates false confidence. Patients with 'negative biopsy' may have CD missed by inadequate sampling, poor orientation, or community-level interpretation."},{"assumption":"Serology-based GFD monitoring is adequate","evidence_against":"50% sensitivity for persistent villous atrophy (finding 8.4). Serology normalizes in months while histology takes 2-5+ years. Elderly have OR 5.1 for persistent VA despite serology normalization.","evidence_for":"Serology is non-invasive, cheap, and widely available. Rising titer clearly indicates gluten exposure. Some guidelines already recommend follow-up biopsy.","clinical_impact":"Half of patients with persistent mucosal damage receive falsely reassuring monitoring results."},{"assumption":"The 10×ULN threshold is interchangeable across all IgA-tTG2 assay platforms","evidence_against":"41-61% eligibility variance (Vermeersch); QUANTA Flash CLIA requires 28×ULN for 99% PPV; PPV 89.3-97.3% by assay (Chang 2025); 24% of tTG2 results reported as '>100' without quantification.","evidence_for":"PPV remains >95% at 10×ULN for most validated assays. EMA confirmation mitigates false positives. ESsCD 2025 now recommends validated ELISA specifically.","clinical_impact":"A patient may qualify for no-biopsy diagnosis on one platform but require biopsy on another, determined entirely by laboratory choice."},{"assumption":"Neurological gluten disease is a validated clinical entity with established biomarkers and proven treatment","evidence_against":"Anti-tTG6 failed independent validation (Rouvroye 2025 n=683: no elevation at standard cutoffs; Lindfors 2011: non-discriminating). Lock et al. found ALL food antibodies elevated in ataxia — not gluten-specific. AGA elevated in 44% Huntington's and 43% hereditary ataxias (no plausible gluten etiology). All GFD treatment evidence is open-label, single-center (Sheffield). >80% of foundational literature from single center. Tarlac 2013: HLA-DQ2 transgenic mice with high-titer AGA did NOT develop ataxia. Reverse causation (neurodegeneration → gut dysfunction → food antibody elevation) is biologically plausible but untested.","evidence_for":"Genuine epidemiological association: OR 3.18 (95% CI 1.79-5.67) excluding Sheffield data. Biologically plausible: tTG2/tTG3 organ-specific B-cell separation proven (Das/Iversen/Sollid 2023), tTG6 extension plausible. Objective MRS improvement on GFD (hard to fake). Bristol population: 4/20 idiopathic ataxia (20%) met criteria — meaningful though lower than Sheffield's 40%. ESsCD 2025 endorses neurological primary presentation.","clinical_impact":"Risk of both overdiagnosis (labeling coincidental AGA positivity as gluten ataxia — 5-12% background rate creates 5-12 'cases' per 100 idiopathic ataxia patients by chance) and underdiagnosis (dismissing genuine gluten-mediated neurological disease). Current evidence supports testing for CD in idiopathic ataxia/neuropathy but not deploying unvalidated tTG6 assays."}],"overlooked_populations":[{"population":"Elderly patients (≥60 years)","estimated_size":"28% of new CD diagnoses; 58% undetected in population screening (Vilppula)","why_missed":"Only 18% PCP testing rate for elderly male IDA; OR 0.51 for duodenal biopsy; symptoms attributed to aging/comorbidities; serology less sensitive in milder histology common in elderly","proposed_solution":"Age-inclusive testing algorithms; mandate CD testing in elderly IDA; lower biopsy threshold in elderly with compatible symptoms; age-specific cascade sensitivity of 4.6% warrants systematic inclusion"},{"population":"Non-white patients, especially Black Americans","estimated_size":"4-8× underdiagnosed relative to white Americans; true prevalence unknown due to serological bias","why_missed":"80% seronegativity in Black CD (preliminary n=42); OR 0.55 for biopsy; 63% Black Americans unaware of CD; clinicians believe CD is 'rare in Black patients'; higher BMI/atypical phenotype reduces recognition","proposed_solution":"Race-blind testing protocols; population-based biopsy screening independent of serology; education against racial diagnostic bias; calculated cascade sensitivity 0.2% demands urgent attention"},{"population":"Patients already on GFD without diagnosis","estimated_size":"72% of US GFD followers lack CD diagnosis (~3.1-4 million Americans); 7-14.6% yield when investigated","why_missed":"Self-initiated GFD normalizes serology (<10% sensitivity at 12 months); gluten challenge poorly tolerated (40% dropout); no standardized challenge protocol; histology partially heals","proposed_solution":"HLA testing as initial triage (negative excludes); celiac lymphogram (93% sensitivity on GFD); short gluten challenge with gut-homing CD8 T-cells (88% sensitivity, 3-day challenge); WBAIL-2 for DQ2.5 patients (90% on GFD)"},{"population":"DQ8-only patients with mild histology","estimated_size":"5-10% of CD; likely overrepresented among seronegative and undiagnosed CD","why_missed":"3-6 vs 14-17 T-cell epitopes (reduced antibody production); DGP test peptide may have zero homology with DQ8-α-I immunodominant epitope; WBAIL-2 sensitivity drops from 90% to 56%; no DQ8-validated tetramers","proposed_solution":"HLA-stratified serology interpretation; DQ8-specific DGP peptides; lower serology thresholds for DQ8 carriers; mandatory bulb biopsy protocol"},{"population":"IgG1 subclass-deficient CD patients","estimated_size":"IgG1 deficiency 2-5% general population; overlap with CD unknown","why_missed":"IgG1 is dominant subclass of ALL celiac IgG responses (Comerford 2015). Deficiency impairs: IgG-tTG2, DGP-IgG, AND IgA via sequential class switching (Siniscalco 2025). No guideline recommends IgG subclass testing.","proposed_solution":"IgG subclass panel when serology negative but clinical suspicion persists; biopsy-first approach if IgG1 low; acknowledge all serological backup tests fail simultaneously"},{"population":"IBS patients harboring undiagnosed CD","estimated_size":"2-5% of IBS patients have CD; only 2.7% tested; CD prevalence ~3× higher in IBS vs general population","why_missed":"Symptom overlap leads to IBS diagnosis without CD testing; guidelines variably recommend testing; once IBS diagnosed, further investigation uncommon","proposed_solution":"Mandate one-time CD serological screening in all new IBS diagnoses; reflex to biopsy if IBS symptoms persist despite therapy regardless of serology"}],"diagnostic_step_sensitivity":{"step_name":"Complete diagnostic cascade from symptom onset to confirmed CD diagnosis","reported_sensitivity":">90-95% (implied by all guidelines through individual step performance claims)","adjusted_sensitivity":"Baseline: 19-64% (optimistic to pessimistic); Real-world primary care: 0.7-18.2% per encounter; Lifetime with current system: ~17%","false_negative_rate":"56-95% per encounter depending on setting and presentation","key_limitations":["Pre-testing attrition (Steps 1-2) is the dominant bottleneck, not serology sensitivity","Nine sequential filtering steps at 80-95% each yield <50% cumulative by mathematical necessity","No single step perfection can raise cumulative sensitivity above ~47%","Subgroup cascade sensitivities: Marsh 3A 6.6-18.4%, elderly 4.6%, Black 0.2%, reference patient 0.6%","Correlated step failures (same biological feature degrades multiple steps) may make actual sensitivity worse than multiplicative product","Only bypassing entire step clusters (population screening, no-biopsy pathway) can meaningfully improve performance"]},"contradictory_studies":[{"citation":"Hujoel IA et al. J Clin Gastroenterol 2021;55(4):327-334 — co-authored by Rubio-Tapia, not cited in ACG 2023","pmid":"32433257","finding":"IgA-tTG2 sensitivity 57.1% after verification bias correction; 22-fold differential biopsy rate","contradicts":"All guidelines citing >90% sensitivity without naming verification bias"},{"citation":"Megiorni F et al. Am J Gastroenterol 2008;103(6):1437-42","pmid":"18177450","finding":"NPV of HLA-DQ2/DQ8 is only 90.5% in males; 15% of male celiacs lack DQ2/DQ8","contradicts":"Universal 99% NPV claim in all guidelines"},{"citation":"Denholm J et al. BMJ Open Gastro 2024","pmid":null,"finding":"Pathologist agreement improves 10% when serology results provided, proving histology is not independent of serology","contradicts":"Biopsy as independent gold standard; two-test confirmatory diagnostic framework"},{"citation":"Shiha MG et al. Gastroenterology 2024;166(4):621-634","pmid":"38176661","finding":"No-biopsy pathway meta-analysis: 100% specificity but only 51% sensitivity; 49% of CD missed","contradicts":"Narrative that no-biopsy pathway is adequate for most CD diagnosis"},{"citation":"Cartee NMP et al. Gastro Hep Advances 2024","pmid":"39132179","finding":"80% of Black CD patients had tTG-IgA below ULN versus ~9% white patients","contradicts":"Implicit assumption in all guidelines that serology performs equitably across racial groups"},{"citation":"Abrams JA et al. Clin Gastroenterol Hepatol 2004;2(4):306-11","pmid":"15067624","finding":"tTG2 sensitivity 0% for partial villous atrophy; EMA 33% for partial vs 77% total VA (P<0.001)","contradicts":"All guidelines reporting single unstratified sensitivity figure"},{"citation":"Marsh MN et al. Gastroenterol Hepatol Bed Bench 2015;8(2):83-92","pmid":"25926934","finding":"Original Marsh classification author demonstrates 3A/3B/3C subdivisions are 'misinterpretations' based on SEM analysis of >3000 biopsies","contradicts":"Universal clinical use of Marsh-Oberhuber classification with 3A/3B/3C subdivisions"},{"citation":"Rouvroye MD et al. 2025 Dutch multicenter (n=683)","pmid":"40481865","finding":"No elevation of anti-TG6 in 476 patients with idiopathic neuropathy/ataxia vs 195 controls at standard cutoffs. Largest independent study contradicting Sheffield tTG6 claims.","contradicts":"Guidelines citing anti-tTG6 as specific neurological biomarker based on Sheffield data"}],"research_gaps":[{"gap":"No prospective population-based study has performed duodenal biopsy independent of serology results — the single most critical evidence gap in celiac diagnostics","importance":"high","proposed_study_design":"Diverse population cohort with universal biopsy regardless of serology, stratified by HLA genotype, race, and age. Would simultaneously determine true sensitivity and seronegative CD prevalence."},{"gap":"No study has measured IgA-tTG2 sensitivity stratified by HLA-DQ subtype (DQ2.5 vs DQ2.2 vs DQ8 vs other)","importance":"high","proposed_study_design":"Retrospective analysis of existing large celiac biobanks with HLA genotyping and serological data. Immediate, no new patient recruitment needed."},{"gap":"Replication of Megiorni 2008 sex-specific HLA findings — never replicated in 17+ years despite clinical significance","importance":"high","proposed_study_design":"Analysis of existing celiac cohorts >1000 patients with HLA genotyping stratified by sex."},{"gap":"No replication of Cartee 80% seronegativity in Black CD patients in larger diverse cohorts","importance":"high","proposed_study_design":"Multiracial biopsy-independent screening study or analysis of diverse celiac registries with race-stratified serology data."},{"gap":"No study has validated biopsy sensitivity specifically in seronegative patients","importance":"high","proposed_study_design":"Expert re-review of archived biopsies from seronegative patients with blinded pathologist grading, CD3 IHC, and quantitative morphometry."},{"gap":"No RCT of population-based CD screening to determine whether improved detection improves outcomes","importance":"high","proposed_study_design":"Ongoing European and North American trials should address this. Results needed before mass screening can be recommended."},{"gap":"Cumulative cascade sensitivity model has not been empirically validated — no study has tracked a defined population through all nine diagnostic steps","importance":"medium","proposed_study_design":"Prospective observational study tracking a primary care population with CD-compatible symptoms through each diagnostic step, documenting attrition at each point."},{"gap":"IgG subclass distribution in celiac patients is poorly characterized, especially in seronegative subgroups","importance":"medium","proposed_study_design":"IgG subclass panel in consecutive celiac patients at diagnosis, stratified by seropositive vs seronegative and by HLA genotype."}],"differential_diagnoses_relevant":[{"condition":"Non-celiac gluten sensitivity (NCGS)","overlap_with_cd":"NCGS may harbor undetected seronegative CD; 24% of seronegative non-CD patients have mucosal anti-tTG2 deposits. NCGS prevalence (0.6-13%) far exceeds CD.","distinguishing_features":"No villous atrophy; no celiac-specific serology; no HLA-DQ2/8 requirement (though 50% positive); diagnosed by exclusion. Comprehensive workup with γδ T-cells, mucosal deposits, and bulb biopsy may reclassify some NCGS as CD."},{"condition":"Non-celiac villous atrophy (drug-induced, CVID, autoimmune enteropathy)","overlap_with_cd":"All produce villous atrophy indistinguishable from CD on routine H&E. 21/30 NCVA patients initially misdiagnosed with CD (Aziz). ESsCD 2025 provides first structured SNVA algorithm.","distinguishing_features":"Drug history (olmesartan); absent plasma cells (CVID); anti-enterocyte antibodies (autoimmune); low γδ-IELs (all 12 mimic cases in Popp 2021 had low γδ-IELs vs elevated in CD). HLA and response to GFD key differentiators."}],"recommendations":[{"recommendation":"All guidelines must name verification bias as a limitation of the IgA-tTG2 evidence base and report reconciled sensitivity range (70-85%) rather than unadjusted pooled estimate (90-98%).","target":"guidelines","evidence_basis":"Five independent project analyses (1.1, 1.2, 1.3, 5.1, 7.1) converge on substantially lower true sensitivity. The 22-fold differential biopsy rate makes unadjusted estimates structurally unreliable."},{"recommendation":"Report IgA-tTG2 sensitivity stratified by Marsh grade (3C, 3B, 3A, 1-2) and acknowledge that unstratified sensitivity overestimates detection of mild-to-moderate disease.","target":"guidelines, researchers","evidence_basis":"Sensitivity gradient from 96% (3C) to <10% (Marsh 1) is well-documented but never mentioned in guidelines. Marsh 3A represents ~38% of celiac histology."},{"recommendation":"Replace 'check total serum IgA' with a comprehensive seronegativity workup: total IgA + IgG subclass panel + secretory IgA (if available) + HLA genotyping when serology negative but clinical suspicion persists.","target":"guidelines, clinicians","evidence_basis":"Total IgA check addresses only one of ≥4 seronegativity mechanisms. IgG1 deficiency impairs all backup tests. Secretory IgA ≠ serum IgA."},{"recommendation":"Report HLA-DQ2/DQ8 NPV stratified by sex and population, with explicit caveat that the 99% figure is derived from serology-gated cohorts.","target":"guidelines","evidence_basis":"90.5% NPV in males (Megiorni 2008). 9.6% non-DQ2/DQ8 in Southern Europe (Karell 2003). DQ7.5 enteropathy (Flores-Marin 2024)."},{"recommendation":"Report cumulative diagnostic cascade sensitivity alongside individual test sensitivity. State explicitly that end-to-end diagnostic yield is 5-40% per clinical encounter, not >90%.","target":"guidelines","evidence_basis":"First multiplicative cascade analysis (finding 7.1) demonstrates 5.4% realistic per-encounter sensitivity matching observed 83% undiagnosed rate."},{"recommendation":"Develop population-specific diagnostic pathways for elderly (≥60), non-white, and GFD-following patients with lower serology and biopsy thresholds.","target":"guidelines, clinicians","evidence_basis":"Calculated cascade sensitivities of 4.6% (elderly), 0.2% (Black), and <10% (GFD) demonstrate current one-size-fits-all algorithms are non-functional for these groups."},{"recommendation":"Mandate mucosal tTG-IgA immunofluorescence on frozen biopsies as standard diagnostic step for suspected seronegative CD, and recommend γδ T-cell assessment (96%/95% sensitivity/specificity on FFPE) for diagnostically difficult cases.","target":"guidelines, pathologists","evidence_basis":"100% sensitivity in adult SNCD (Salmi 2006). γδ T-cells persist on GFD and distinguish CD from non-celiac enteropathies."},{"recommendation":"Mandate CD3 immunohistochemistry and quantitative morphometry (Vh:Cd ratio) for all borderline biopsies and all seronegative patients.","target":"guidelines, pathologists","evidence_basis":"CD3 detects ~10% additional cases. H&E vs CD3 concordance only 66.8%. Subjective grading misses 77-100% of morphometrically confirmed villous atrophy in monitoring. Community κ=0.33 for Marsh 3A."},{"recommendation":"Research funders should prioritize the single most important missing study: population-based biopsy independent of serology in a racially diverse cohort.","target":"researchers, funders","evidence_basis":"All current sensitivity estimates are contaminated by verification bias. The true prevalence and clinical significance of seronegative CD cannot be determined without this study."},{"recommendation":"Guidelines should recommend celiac testing (IgA-tTG2, total IgA, HLA) in all idiopathic ataxia and neuropathy patients, which is defensible given the residual epidemiological association (OR 3.18 excluding Sheffield). However, guidelines should NOT recommend tTG6 antibody incorporation given failed independent validation (Rouvroye 2025, n=683; Lindfors 2011). The reverse causation hypothesis (neurodegeneration → gut barrier dysfunction → non-specific food antibody elevation) should be acknowledged as untested. MR spectroscopy (NAA/Cr ratio) is the most promising objective biomarker but requires independent replication outside Sheffield.","target":"guidelines, neurologists","evidence_basis":"OR 3.18 (95% CI 1.79-5.67) for AGA-ataxia association excluding Sheffield (Lin & Kuo 2018 meta-analysis); BUT anti-tTG6 failed validation (Rouvroye PMID:40481865; Lindfors PMID:21453693); Lock et al. ALL food antibodies elevated (PMID:16227563); AGA in Huntington's 44%, hereditary ataxias 43%; no blinded RCTs for GFD in neurological disease; Zedira assay RUO only with investigator commercial links"},{"recommendation":"Adopt the Catassi 'four-out-of-five' diagnostic framework (HLA, histology, serology, symptoms, GFD response) for complex or atypical cases, particularly seronegative patients who meet 3/5 criteria. This framework provides a structured diagnostic pathway when standard serology-first algorithms fail.","target":"guidelines, gastroenterologists","evidence_basis":"The reference patient (DQ8, Marsh 3A, seronegative, symptomatic) meets 3/5 Catassi criteria with a fourth achievable via GFD trial. No current guideline explicitly recommends the Catassi framework despite its utility for seronegative/atypical presentations."}],"meta_analysis_summary":{"studies_reviewed":"Approximately 200+ across 32 project research files plus direct guideline document analysis","total_patients":"Cannot aggregate — overlapping cohorts across studies. Individual large cohorts: Lebwohl 132,352 (biopsy adequacy); Hopper 2,000 (universal biopsy); multiple meta-analyses with thousands each.","pooled_estimates":{"guideline_cited_IgA_tTG2_sensitivity":"90-98%","verification_bias_adjusted_sensitivity":"57.1% (point estimate); 70-85% (reconciled range)","Marsh_3A_sensitivity":"0-42% (varies by setting and assay)","cumulative_cascade_sensitivity_realistic":"5.4% per primary care encounter","cumulative_cascade_sensitivity_baseline":"40.2% (classical symptomatic, optimized setting)","no_biopsy_pathway_sensitivity":"51% (Shiha 2024 meta-analysis)","pathologist_agreement_Marsh_3A":"κ=0.33","biopsy_adequacy_US":"35%","HLA_NPV_male":"90.5%","reference_patient_cascade_sensitivity":"0.6%"},"heterogeneity_notes":"Extreme heterogeneity across all parameters reflects genuine biological variation (HLA genotype, Marsh grade, age, ethnicity) compounded by study design variation (serology-first vs all-biopsy, academic vs community, pediatric vs adult). The most robust finding is structural: serial filtering of nine imperfect steps necessarily yields cumulative sensitivity <50% regardless of individual step estimates.","core_thesis":"Celiac disease is defined by the T-cell response to gluten, not by the B-cell antibodies current tests measure. Until diagnostic algorithms reflect this immunological reality — incorporating T-cell-based diagnostics, HLA-stratified sensitivity, and multiple seronegativity mechanisms — the majority of celiac disease will remain undiagnosed. The most important finding is not any single bias but the structural architecture: nine sequential imperfect steps mathematically guarantee <50% cumulative sensitivity regardless of individual step optimization."},"guideline_specific_assessments":{"ACG_2023":{"pmid":"36602836","strengths":["Comprehensive scope covering diagnosis, management, and follow-up","Uniquely among guidelines, acknowledges verification bias by name in evidence review","Cites realistic sensitivity range of 63-93% rather than inflated >95% figures","Acknowledges poor correlation between serology and mucosal healing","Recommends ≥4 biopsies including bulb","Addresses non-responsive and refractory CD systematically","Recommends total IgA with initial serology","Cautious adult no-biopsy stance reflecting evidence limitations"],"weaknesses":["Despite acknowledging verification bias, does not cite Hujoel 2021 (co-authored by lead author Rubio-Tapia) — the key correction paper","Recommendation-level language still leads with high sensitivity despite evidence review citing 63-93%","No pathway for seronegative CD detection","No mention of assay heterogeneity affecting threshold interpretation","Minimal attention to elderly, racial disparities","Considers no-biopsy in adults insufficiently validated (PPV 95% 'unacceptably low')","Does not recommend IgG subclass testing","Does not list IBS explicitly in case-finding recommendations despite meta-analytic evidence of 4× CD prevalence"],"overall_assessment":"Most honest of the four primary guidelines regarding evidence limitations — uniquely acknowledges verification bias and realistic sensitivity range. However, the gap between evidence review and recommendation-level language means clinicians following ACG recommendations still apply serology-first algorithms that assume high sensitivity. The omission of Hujoel 2021 by the paper's own co-author is a consequential epistemic gap."},"ESPGHAN_2020":{"pmid":"31210940","strengths":["Pioneered no-biopsy pathway for children (≥10×ULN + EMA)","Well-validated in pediatric populations","Established framework subsequently extended to adults by ESsCD 2025","Recognized that different clinical contexts require different diagnostic approaches"],"weaknesses":["Pediatric focus means adult application requires extrapolation","Pediatric CD presents with higher titers and more severe disease — sensitivity overestimated for adults","Does not address verification bias","No pathway for seronegative pediatric CD","HLA exclusion criteria applied without sex stratification"],"overall_assessment":"Appropriate for pediatric CD where disease tends to be more severe and seropositive; limited applicability to adult CD spectrum"},"ESsCD_2025":{"pmid":"40999951","strengths":["First adult no-biopsy pathway (≥10×ULN, <45 years, specialist-confirmed)","First structured SNVA diagnostic algorithm in any guideline","Acknowledges assay heterogeneity and recommends validated ELISA-based assays","Revised biopsy protocol mandating ≥4 D2 specimens + conditional bulb","Structured approaches for potential CD and GFD-already patients","HLA typing recommended for diagnostic clarification in select cases","Most methodologically rigorous (AGREE II, GRADE, Delphi consensus)","AGREE II methodology distinguishes ESsCD 2025 from other guidelines; however, Graham et al. 2023 found adult CD guidelines as a class scored only 21% on applicability and below 60% on stakeholder involvement"],"weaknesses":["Still does not name verification bias","Does not stratify sensitivity by Marsh grade","No-biopsy pathway has only 51% sensitivity — excludes majority of adult CD","Age restriction (<45) excludes elderly population with highest undiagnosed burden","Does not address racial disparities in serology performance","Does not recommend IgG subclass testing","Does not recommend quantitative morphometry or γδ T-cells as routine","SNVA algorithm still requires positive HLA as entry criterion — excludes rare-HLA patients"],"overall_assessment":"Best available guideline representing meaningful progress, particularly SNVA algorithm and assay heterogeneity acknowledgment. Still fundamentally limited by serology-centric architecture."},"BSG_2014":{"pmid":"24917550","strengths":["International expert panel from eight countries","Comprehensive scope including neurological and dermatological manifestations","Acknowledges seronegative CD exists","Addresses quality of life and patient support"],"weaknesses":["Outdated (2014) — does not incorporate no-biopsy pathway evidence","Pre-dates verification bias correction (Hujoel 2021)","Does not address assay heterogeneity","Minimal attention to special populations (elderly, non-white)","Due for comprehensive revision"],"overall_assessment":"Needs updating. Reasonable for its era but overtaken by evidence accumulated since 2014."}},"misconceptions_compendium":[{"misconception_number":1,"statement":"IgA-tTG2 sensitivity exceeds 93% for celiac disease","found_in":["ESPGHAN 2020 (refused to cite figure)","ESsCD 2025 (90.7%)","BSG 2014","ACG 2023 (cites 63-93% in evidence review but leads with high sensitivity in recommendations)"],"project_evidence_against":"1.1 (57% adjusted), 1.2 (0-96% by Marsh grade), 5.1 (traces to 3 studies from 2005), 1.3 (69-97% across platforms). ACG 2023 acknowledges verification bias and 63-93% range — most honest of guidelines — but omits Hujoel 2021 (co-authored by guideline lead Rubio-Tapia). ESPGHAN 2020 correctly states 'no study could provide valid data on sensitivity for case finding.'","clinical_impact":"Unknown number of seronegative patients undiagnosed; false reassurance from negative serology","recommended_correction":"Report reconciled sensitivity range 70-85% for Marsh 3+ and 42-85% for Marsh 3A. Name verification bias explicitly."},{"misconception_number":2,"statement":"Negative HLA-DQ2/DQ8 excludes celiac disease (NPV ~99%)","found_in":["All major guidelines"],"project_evidence_against":"5.2 (0.4-6.1% lack DQ2/DQ8), 3.2 (NPV 90.5% males; DQ7.5 8.7% enteropathy; 9.6% Southern Europe)","clinical_impact":"Male patients and Southern European populations may be incorrectly excluded","recommended_correction":"Report sex-specific and population-specific NPV. Acknowledge DQ7.5 and half-DQ2 susceptibility."},{"misconception_number":3,"statement":"Seronegative celiac disease is rare (<5%)","found_in":["Implied by all major guidelines"],"project_evidence_against":"3.1B (multiple mechanisms), 6.1 (15-43% estimates), 3.7 (80% Black seronegativity), 7.1 (cascade analysis)","clinical_impact":"Hundreds of thousands of patients potentially undiagnosed; seronegative patients denied diagnostic workup","recommended_correction":"State explicitly that seronegative CD prevalence is uncertain. Confirmed range: 6-22% of biopsy-diagnosed CD. Hypothesized population-level range: 15-43% (upper bounds requiring prospective validation). The '2%' figure from Paris Consensus requires flat villi + HLA + GFD response — excluding Marsh 3A and reflecting ascertainment bias in who reaches biopsy. Serology-dependent algorithms create systematic ascertainment bias, particularly in non-white populations (Cartee: 80% Black seronegativity, preliminary n=42). Dickey et al. (2000): 'Reliance on serum endomysial antibody testing underestimates the true prevalence of coeliac disease by one fifth.'"},{"misconception_number":4,"statement":"Checking total serum IgA validates IgA-tTG2 testing","found_in":["ACG 2023","ESPGHAN 2020","ESsCD 2025","BSG 2014"],"project_evidence_against":"3.5 (secretory IgA dissociation), 8.2 (IgG1 deficiency), 3.6 (DQ8 reduced T-cell help), 3.1B (reference patient)","clinical_impact":"Patients with normal serum IgA but deficient mucosal antibody production falsely reassured","recommended_correction":"Acknowledge ≥4 independent seronegativity mechanisms beyond IgA deficiency. Recommend IgG subclass testing when clinical suspicion persists."},{"misconception_number":5,"statement":"Biopsy is an independent gold standard","found_in":["All major guidelines"],"project_evidence_against":"2.1 (κ=0.33 Marsh 3A; agreement improves with serology), 2.2 (35% adequacy), 2.3 (circular validation), 8.5 (Marsh rejects his own subdivisions)","clinical_impact":"Over-reliance on imperfect reference standard; false confidence in 'negative biopsy' results","recommended_correction":"Describe biopsy as 'reference standard with acknowledged limitations' rather than 'gold standard.' Specify agreement metrics by Marsh grade."},{"misconception_number":6,"statement":"The ≥10×ULN no-biopsy threshold applies uniformly across all IgA-tTG2 platforms","found_in":["ACG 2023 (implied)","ESPGHAN 2020","ESsCD 2025 (partially addressed)"],"project_evidence_against":"1.3 (41-61% eligibility variance; PPV 89.3-97.3% by assay; QUANTA Flash requires 28×ULN)","clinical_impact":"Patient classification depends on laboratory choice; 5-11% potential misclassification","recommended_correction":"ESsCD 2025 already moving in right direction (validated ELISA). All guidelines should mandate assay-specific validation of threshold."},{"misconception_number":7,"statement":"Serology-based GFD monitoring is adequate for long-term follow-up","found_in":["Most guidelines"],"project_evidence_against":"8.4 (50% sensitivity for persistent VA), 3.6 (elderly OR 5.1 for persistent VA)","clinical_impact":"Half of patients with ongoing mucosal damage receive falsely reassuring results","recommended_correction":"Recommend follow-up biopsy at 1-2 years regardless of serology. Do not rely on serology normalization as evidence of mucosal healing."},{"misconception_number":8,"statement":"Current diagnostic algorithms perform equitably across racial and ethnic groups","found_in":["Implied by all guidelines — no guideline addresses racial performance variation"],"project_evidence_against":"3.7 (80% Black seronegativity; 4-8× underdiagnosis; OR 0.55 biopsy rate; 63% Black Americans unaware of CD)","clinical_impact":"Black and minority patients face cascade sensitivity of 0.2% — diagnostic system essentially non-functional","recommended_correction":"Acknowledge racial variation in serology sensitivity. Mandate race-blind testing protocols. Fund population-based screening in diverse cohorts."},{"misconception_number":9,"statement":"Celiac disease is primarily a disease of young Caucasian females","found_in":["Implicit clinical bias documented in all guideline populations; not explicitly stated but reflected in minimal elderly/minority coverage"],"project_evidence_against":"3.6 (elderly 28% of new diagnoses; 58% undetected), 3.7 (comparable prevalence across races), seroprevalence F:M ~1:1 vs diagnosed 2-3:1","clinical_impact":"Elderly, male, and non-white patients receive lower testing rates (18% vs 61% for elderly male IDA)","recommended_correction":"Explicitly state CD affects all ages, sexes, and races. Provide age-inclusive testing indications."},{"misconception_number":10,"statement":"Four biopsies achieve ~100% sensitivity across all CD phenotypes","found_in":["ACG 2023","ESsCD 2025"],"project_evidence_against":"2.2 (35% US compliance; 76% sensitivity with 30% surface involvement; binomial modeling); bulb-only disease 9%","clinical_impact":"True compliance is 35%, and even when adherent, patchy Marsh 3A in seronegative patients may be missed","recommended_correction":"State sensitivity conditional on compliance. Mandate ≥4 D2 + 1-2 bulb. Acknowledge that sensitivity for patchy Marsh 3A is substantially lower."},{"misconception_number":11,"statement":"Neurological manifestations are complications of untreated intestinal CD","found_in":["Implied by most guidelines' framing of extraintestinal manifestations"],"project_evidence_against":"9.1 (55-76% Marsh 0 in neurological cohorts; anti-tTG6 targets different enzyme; organ-specific autoimmunity without enteropathy). HOWEVER: anti-tTG6 failed independent validation (Rouvroye 2025); Lock et al. non-specificity; no RCT evidence.","clinical_impact":"Uncertain — genuine but poorly characterized. Patients with neurological symptoms excluded from CD workup due to absent enteropathy. But evidence base for specific neurological gluten disease remains weak.","recommended_correction":"Acknowledge neurological spectrum as genuine association with uncertain mechanism (OR 3.18 excluding Sheffield). Recommend celiac testing in all idiopathic ataxia and neuropathy (defensible given residual association). Do NOT recommend tTG6 incorporation — assay has failed independent validation (Rouvroye 2025 n=683; Lindfors 2011), exists only as research-use-only ELISA (Zedira), and the reverse causation hypothesis (neurodegeneration → gut barrier dysfunction → non-specific food antibody elevation, Lock et al. 2005: all food antibodies elevated, AGA elevated in 44% Huntington's, 43% hereditary ataxias) has not been excluded. All GFD treatment evidence is open-label single-center. ESsCD 2025's framing of neurological disease as potentially primary is appropriate — but specific biomarker recommendations are premature."},{"misconception_number":12,"statement":"The diagnostic pathway delivers sensitivity close to individual test performance (~93%)","found_in":["Implied by all guidelines — no guideline models cumulative cascade performance"],"project_evidence_against":"7.1 (9 sequential steps; 5.4% realistic per-encounter; 40% baseline cumulative; subgroup cascade <5% for elderly, Black, Marsh 3A)","clinical_impact":"83% US undiagnosed rate is mathematically predicted by the cascade — it is a structural property, not a system failure","recommended_correction":"Report cumulative cascade sensitivity. Acknowledge that improving any single step cannot raise system performance above ~47%. Only bypassing entire step clusters (population screening, no-biopsy) can meaningfully improve detection."}],"reference_patient_analysis":{"patient_profile":"DQ8, Marsh 3A, IgA-tTG2 <1, anti-DGP IgG <1, low IgG1, low secretory IgA","guideline_pathway_outcome":"No guideline pathway would identify this patient. Cumulative cascade sensitivity 0.6%. Five compounding diagnostic failure modes: (1) serology zero sensitivity by definition; (2) DQ8 reduced T-cell help → lower even mucosal antibody production; (3) IgG1 deficiency impairs IgG backup testing AND IgA class switching; (4) Marsh 3A at worst histopathology agreement boundary (κ=0.33); (5) DGP peptide may not detect DQ8-specific epitope responses.","specific_guideline_failures":["ACG 2023: Serology-first algorithm terminates at step 1. No seronegative rescue pathway.","ESPGHAN 2020: Pediatric pathway not applicable. Adult extension not provided.","ESsCD 2025: SNVA algorithm applies if biopsy obtained — but this patient would never reach biopsy through standard pathway. HLA entry criterion met (DQ8+), but serology zero prevents triggering the diagnostic cascade.","BSG 2014: Acknowledges SNCD exists but provides no structured detection pathway."],"what_would_have_worked":"Protocol-mandated biopsy regardless of serology in symptomatic patient; mucosal tTG-IgA immunofluorescence on frozen biopsies; γδ T-cell assessment; IgG subclass testing at presentation; celiac lymphogram by flow cytometry (93% sensitivity, HLA-agnostic). None of these are recommended by any current guideline as routine.","catassi_four_of_five_analysis":{"criterion_1_HLA":"MET — DQ8 positive","criterion_2_histology":"MET — Marsh 3A villous atrophy","criterion_3_serology":"NOT MET — IgA-tTG2 <1, DGP-IgG <1 (dual-mechanism seronegativity: IgG1 deficiency + mucosal IgA deficiency)","criterion_4_symptoms":"PRESUMED MET — clinical presentation consistent","criterion_5_GFD_response":"ACHIEVABLE — pending trial","score":"3/5 (4/5 achievable with GFD trial)","diagnostic_implication":"Diagnosis possible under Catassi criteria with 4/5 — but only if patient reaches specialist who applies this framework. Every guideline's serology-first primary care algorithm terminates before this point."}},"peer_review_integration":{"reviewers":["Opus 4.6 twin instance (parallel chat with project file access)","Grok 4.1 (independent analysis without project file access)"],"date":"2026-02-12","v1_to_v2_changes":["F1: Corrected ACG 2023 characterization — acknowledged it uniquely cites 63-93% range and names verification bias in evidence review, while maintaining critique that it omits Hujoel 2021 and leads with high sensitivity in recommendations","F5: Added Volta/Caio/Lundin 2024 Gastroenterology review and Dickey 2000 citations; strengthened qualifier language for population-level SNCD estimates as 'hypothesized upper bounds requiring prospective validation'","F10: Substantially strengthened neurological skepticism — added Lock et al. all-food-antibody finding, AGA in Huntington's/hereditary ataxias, Zedira commercial interest, Tarlac negative animal model; revised recommendation from 'incorporate TG6' to 'test for CD in idiopathic ataxia but do NOT incorporate tTG6'","F12: Added Catassi four-out-of-five criteria analysis demonstrating reference patient meets 3/5 (4/5 achievable with GFD trial)","M1: Differentiated ACG 2023 (acknowledges VB, cites 63-93%) from other guidelines; added ESPGHAN 2020 'no valid data' statement","M3: Added Paris Consensus as counterargument with explanation of why it undercounts; added Dickey 2000 'one fifth' paper","M11: Revised neurological correction to explicitly state tTG6 should NOT be incorporated given failed validation","ACG guideline assessment: Corrected to credit verification bias acknowledgment and 63-93% range as genuine strengths","Added AGREE II 21% applicability finding (Graham et al. 2023) to biases documented","Added Catassi criteria recommendation","Added core thesis statement to meta-analysis summary","Strengthened all emerging estimate qualifiers per peer review feedback"],"twin_contributions_incorporated":["Catassi 'four-out-of-five' framework application to reference patient (novel analytical contribution not in v1)","Core thesis articulation: 'CD defined by T-cell response, not B-cell antibodies we can measure'","AGREE II 21% applicability score for adult CD guidelines (Graham et al. 2023)","Volta/Caio/Lundin 2024 Gastroenterology review as SNCD prevalence source","Dickey et al. 2000 'one fifth' paper citation","ACG 2023 credit for acknowledging verification bias and citing 63-93% range","ESPGHAN 2020 credit for refusing to cite case-finding sensitivity"],"twin_errors_identified_and_not_incorporated":["κ pairwise agreement range cited as 0.18-0.63 — actual range 0.18-0.73 (0.73 for Marsh 3C matters)","ESsCD 2025 'not specified' in comparison table contradicts body text citing 90.7%","Rostami 1999 '31% for Marsh 3A' — unverifiable against project files; possibly confabulated","Neurological section overclaimed: presented tTG6 as near-established rather than failed-validation","Recommended tTG6 incorporation for clinical use — premature given Rouvroye/Lindfors failures","Omitted Lock et al. all-food-antibody finding and AGA in Huntington's/hereditary ataxias","Omitted Denholm 2024 serology-dependent histology interpretation","Omitted quantitative morphometry (77-100% subjective miss rate)","Omitted assay heterogeneity in 10×ULN threshold (41-61% eligibility variance)","Omitted Hujoel/Rubio-Tapia self-citation gap (credited ACG without noting this)"]}}