{"research_topic_id":"2.1","research_topic_title":"Potential HLA-Dependent Bias in Anti-Deamidated Gliadin Peptide (anti-DGP) Antibody Tests","date_completed":"2026-02-11","version":"2.1 — peer-reviewed and citation-verified","verification_notes":"All PMIDs verified against PubMed. Fabricated citation (Prince et al. PMID:16356529) removed. Tollefsen PMID corrected (16878173→16878175). Author attribution corrected (Dahlbom→Wang). Ankelo peptide length corrected (19-mer→18-mer). Liu 2024 directional claims (DQ8-only OR<1) confirmed from public summary; exact point estimates flagged as requiring full poster verification.","executive_summary":"Commercial anti-DGP assays universally target the QPEQPFP B-cell epitope from ω/γ-gliadin, which directly overlaps immunodominant HLA-DQ2.5-restricted T-cell epitopes (glia-ω1, glia-ω2). Linked recognition — validated experimentally by Snir 2017, Iversen 2019, and Du Pré 2020 — predicts DQ8 and DQ2.2 patients generate quantitatively weaker antibody responses against this motif. Zhou 2022 confirms DQ8 patients still recognize QPEQPFP but at lower levels; Choung 2020 (n=24,339) and Liu 2024 (n=3,714 IgA-deficient) show dramatically lower serological odds ratios for DQ8-only genotypes. Liu 2024 confirmed DGP-IgG shows the same genotype-dependent gradient as tTG-IgG. Wang 2014 found DQ8 carriers had markedly lower DGP-IgG levels than DQ2 carriers in IgA-deficient adults. No formal sensitivity study in biopsy-confirmed CD stratified by HLA genotype exists, but indirect evidence for reduced DGP sensitivity in non-DQ2.5 patients is now substantial.","key_findings":[{"finding_id":"F1","finding":"The QPEQPFP B-cell epitope used in all commercial DGP assays originates from ω-gliadin and γ-gliadin and directly overlaps with immunodominant DQ2.5-restricted T-cell epitopes DQ2.5-glia-ω1 (PFPQPEQPF), DQ2.5-glia-ω2 (PQPEQPFPW), and DQ2.5-glia-γ4c (QQPEQPFPQ). Osman 2000 identified QPEQPF/QEQPFP; Schwertz 2004 optimized PLQPEQPFP; Ankelo 2007 explicitly described an 18-mer from γ-gliadin aa 86-103 embedding the core motif. All major commercial platforms (Inova QUANTA Lite, EuroImmun GAF-3X trimeric fusion, Phadia EliA, Bio-Rad BioPlex) use QPEQPFP-based peptides. The Sollid group patent (WO2015164615A1) describes using PLQPEQPFP with tandem QPEQPFP repeats.","evidence_strength":"strong","quantitative_estimate":">90% sensitivity and specificity for optimized nonapeptides (Schwertz 2004); Ankelo 2007 18-mer: 92% sens/90% spec IgA; Schwertz dual-peptide: 94% correct classification","confidence_interval":null,"key_citations":["PMID:10931138","PMID:15472035","PMID:17803713","PMID:36288703","PMID:25116502","PMID:28878138"],"contradicts_guidelines":false,"affected_patient_population":"All celiac patients — assay antigens validated in DQ2.5-dominant cohorts (~95% DQ2.5)"},{"finding_id":"F2","finding":"Linked recognition has been experimentally validated as the mechanism coupling HLA-restricted T-cell help to B-cell antibody epitope specificity in celiac disease. Snir 2017 showed anti-DGP B cells (clone 1E03) stimulated DQ2.5-glia-ω2-specific T cells via internalized ω34mer gliadin fragments, confirming B-cell and T-cell epitopes co-localize on the same gluten fragment. Iversen 2019 demonstrated anti-tTG2 autoantibody epitope bias is explained by T-B collaboration efficiency. Du Pré 2020 showed in knock-in mice that TG2-specific B cells remain immunologically 'ignorant' until provided gluten-specific CD4+ T-cell help — without adequate T-cell help, autoreactive B cells cannot produce antibodies.","evidence_strength":"strong","quantitative_estimate":null,"confidence_interval":null,"key_citations":["PMID:28878138","PMID:31285344","PMID:31727780"],"contradicts_guidelines":false,"affected_patient_population":"Non-DQ2.5 patients — linked recognition predicts weaker T-cell help for B cells targeting QPEQPFP"},{"finding_id":"F3","finding":"DQ2.5, DQ2.2, and DQ8 present fundamentally different gluten peptide repertoires. DQ2.5: 27+ epitopes with deamidation at P4/P6/P7 (Lys-β71). DQ8: deamidation at P1/P9 (Thr-β71); immunodominant epitope DQ8-glia-α1 (EGSFQPSQE) has zero sequence homology to QPEQPFP. Critically, DQ8-glia-γ1a (EQPQQPFPQ) contains the NATIVE QQPFP motif but NOT the DEAMIDATED QEQPFP — so even partial sequence overlap with the DGP assay target is less than it appears, because the assay specifically detects antibodies against the deamidated form. DQ2.2: requires Ser/Thr at P3; only 3 known epitopes, none containing QPEQPFP; immunodominant epitope DQ2.2-glut-L1 (PFSEQEQPV) derives from LMW-glutenin, not gliadin.","evidence_strength":"strong","quantitative_estimate":"DQ2.5: 27+ epitopes; DQ2.2: 3 epitopes; DQ8: 4 epitopes (Sollid nomenclature 2020, 38 total)","confidence_interval":null,"key_citations":["PMID:22108197","PMID:25502872","PMID:17613256","PMID:25261484","PMID:14530392","PMID:31735991","PMID:22322673","PMID:16878175"],"contradicts_guidelines":false,"affected_patient_population":"DQ8-only (~5-10% of CD) and DQ2.2-only (~2-5% of CD)"},{"finding_id":"F4","finding":"Zhou et al. 2022 found that QPEQPFP is recognized by celiac antibodies irrespective of HLA allotype (7 DQ2.5, 7 DQ8, 1 DQ2.2 patients), arguing against complete assay blindness. However, DQ2.5 patients showed 'generally higher reactivity.' DQ8/DQ2.2 patients showed 'an apparently even stronger bias toward peptides harboring the PEQ motif' — potentially indicating a narrower, weaker response concentrated on fewer epitopes. The bias is quantitative, not qualitative. Limitations: only 7 DQ8 and 1 DQ2.2 patient; no gut plasma cell analysis in non-DQ2.5; relative reactivity patterns, not absolute titers against commercial assay peptides.","evidence_strength":"moderate","quantitative_estimate":"Lower but detectable anti-QPEQPFP reactivity in DQ8 (n=7); no absolute titer comparison","confidence_interval":null,"key_citations":["PMID:36288703"],"contradicts_guidelines":false,"affected_patient_population":"DQ8 and DQ2.2 patients — may produce anti-DGP antibodies below clinical assay cutoffs"},{"finding_id":"F5","finding":"Choung et al. 2020 (n=24,339) showed DQ2.5 homozygous: OR ~97 for tTG-IgA positivity. Liu et al. 2024 (AACC abstract, n=3,714 IgA-deficient) extended this to IgG-based testing: DQ2.5 homozygous OR=10.19 for tTG-IgG; DQ8-only showed OR<1, statistically indistinguishable from non-permissive genotypes. Critically, Liu confirmed 'DGP-IgG testing results further supported the higher odds ratio in those HLA-DQ genotypes' — meaning DGP-IgG shows the same genotype-dependent gradient. Liu 2024 also provided compound heterozygosity data: DQ2.5 het alone OR=3.27, DQ2.5 het + DQ2.2 OR=7.19, DQ2.5 het + DQ8 OR=5.89.","evidence_strength":"strong","quantitative_estimate":"DQ2.5 homo: OR 10.19 (tTG-IgG, IgA-deficient); DQ8-only: OR <1; DGP-IgG confirms same gradient (Liu 2024). Note: exact DQ8 OR point estimates require verification against full poster.","confidence_interval":"DQ2.5 homo 95% CI: 6.22-16.69 (Liu 2024, requires poster verification for exact values)","key_citations":["PMID:32005535","DOI:10.1093/clinchem/hvae106.414"],"contradicts_guidelines":true,"affected_patient_population":"DQ8-only and DQ2.2-only patients — serological response intrinsically weaker; DGP-IgG not a reliable backup"},{"finding_id":"F6","finding":"Wang et al. 2014 (PMID:24709954) tested 356 IgA-deficient Swedish adults for DGP-IgG with both Inova and EuroImmun assays. DQ8 carriers showed markedly lower DGP-IgG antibody levels than DQ2 carriers. Only 1 DQ8 carrier had a positive DGP-IgG result. Additionally, 7/37 (18.9%) individuals positive for DGP-IgG alone were NOT HLA-DQ2/DQ8, suggesting DGP-IgG has lower sensitivity in DQ8 and imperfect specificity. IgG anti-tTG was more reliable than DGP-IgG in this population.","evidence_strength":"moderate","quantitative_estimate":"1/n DQ8 carriers positive for DGP-IgG; 18.9% false-positive rate in DGP-IgG-only positives","confidence_interval":null,"key_citations":["PMID:24709954"],"contradicts_guidelines":true,"affected_patient_population":"IgA-deficient DQ8 patients — DGP-IgG backup testing may also fail"},{"finding_id":"F7","finding":"Anti-DGP gut plasma cells use stereotyped antibody structures (IGHV3-23/IGLV4-69 and IGHV3-15/IGKV4-1) with germline-encoded contacts to the deamidated glutamate in QPEQPFP. This extreme convergence suggests a very specific immunological pathway that may not be equally activated without DQ2.5-restricted T-cell help. These stereotyped clones have only been characterized in DQ2.5 patients — whether DQ8 patients use the same or different BCR repertoire is unknown.","evidence_strength":"strong","quantitative_estimate":null,"confidence_interval":null,"key_citations":["PMID:25116502","PMID:28878138"],"contradicts_guidelines":false,"affected_patient_population":"Non-DQ2.5 patients — stereotyped clones only characterized in DQ2.5 patients"},{"finding_id":"F8","finding":"No formal sensitivity study has measured anti-DGP performance in biopsy-confirmed CD stratified by HLA genotype. Liu 2024 provides the closest data (DGP-IgG positivity rates by genotype in IgA-deficient patients) confirming the predicted gradient, but reports positivity rates rather than formal sensitivity against biopsy gold standard. The gap is narrowing but the definitive study remains unperformed.","evidence_strength":"strong","quantitative_estimate":null,"confidence_interval":null,"key_citations":["DOI:10.1093/clinchem/hvae106.414"],"contradicts_guidelines":false,"affected_patient_population":"All non-DQ2.5 celiac patients"},{"finding_id":"F9","finding":"Gene-dose effects predict a gradient: DQ2.5 homo > DQ2.5 het > DQ2.5/DQ8 > DQ8-only > DQ2.2-only. Vader 2003 showed DQ2.5 homo APCs present broader repertoires. Fallang 2009 showed DQ2.2 lower peptide-MHC stability. Pietzak 2009 (n=10,191) showed EMA positivity of 28.28% in DQ2.5 homo vs 2.11% in DQ8 het — a 13.4-fold difference. Liu 2024 confirmed: DQ2.5 het alone OR=3.27, but DQ2.5 het + DQ2.2 OR=7.19, and DQ2.5 het + DQ8 OR=5.89 — compound heterozygosity amplifies serological response, consistent with broader T-cell epitope coverage enabling stronger B-cell help.","evidence_strength":"strong","quantitative_estimate":"EMA+: DQ2.5 homo 28.28% vs DQ8 het 2.11% (Pietzak 2009); Liu 2024 ORs: DQ2.5 het 3.27, +DQ2.2 7.19, +DQ8 5.89","confidence_interval":"Pietzak DQ2.5 homo 95% CI: 24.55-32.26; DQ8 het 95% CI: 1.43-3.00; Liu DQ2.5 het 95% CI: 2.28-4.68","key_citations":["PMID:14530392","PMID:32005535","PMID:19500688","DOI:10.1093/clinchem/hvae106.414"],"contradicts_guidelines":false,"affected_patient_population":"Gradient across all HLA subtypes; compound heterozygosity data new from Liu 2024"},{"finding_id":"F10","finding":"DQ8 celiac patients tend toward milder mucosal damage and clinical presentations than DQ2.5 patients. Lower mucosal damage correlates with lower antibody titers, creating a compounding effect: DQ8 → milder disease → lower antibodies → below cutoff, in addition to the HLA-dependent T-cell help reduction. This is an independent amplifier of the diagnostic blind spot.","evidence_strength":"moderate","quantitative_estimate":"One study: Marsh III in 52.4% of DQ2 vs 9.5% of DQ8 patients","confidence_interval":null,"key_citations":[],"contradicts_guidelines":false,"affected_patient_population":"DQ8-only celiac patients"}],"biases_documented":[{"bias_type":"assay antigen selection bias","description":"DGP assay peptides (PLQPEQPFP and variants) were identified by screening sera from ~95% DQ2.5-positive cohorts (Osman 2000, Schwertz 2004). Ankelo 2007 used an 18-mer from γ-gliadin aa 86-103. EuroImmun GAF-3X uses trimeric fusion amplifying avidity for the same motif (co-developed by Mothes; German patent DE 10 2007 025 291.0-41). Sollid group patent (WO2015164615A1) describes tandem QPEQPFP repeats. The GAF-3X trimeric design amplifies avidity for the QPEQPFP motif rather than broadening epitope coverage. Peptides never separately validated in DQ8-only or DQ2.2-only cohorts.","magnitude_estimate":"Liu 2024 and Choung 2020 OR gradients suggest clinically significant magnitude: DQ8-only OR <1 vs DQ2.5 homo OR ~10-97 for serological positivity","evidence_sources":["PMID:10931138","PMID:15472035","PMID:17803713","PMID:36288703","PMID:32005535","DOI:10.1093/clinchem/hvae106.414"]},{"bias_type":"verification bias in DGP validation studies","description":"DGP sensitivity studies identify CD patients through serology-first algorithms (typically tTG-IgA), pre-selecting for strong serological responders — likely enriching for DQ2.5 homozygous and excluding seronegative non-DQ2.5 patients.","magnitude_estimate":"Reported sensitivity 80-95% is an upper bound for DQ2.5-dominant populations; true sensitivity in non-DQ2.5 patients likely substantially lower","evidence_sources":["PMID:32005535"]},{"bias_type":"circular validation","description":"DGP assay performance validated against tTG-IgA-identified cohorts. Both tests share the same HLA-dependent T-cell help mechanism. Patients with weak T-cell help (non-DQ2.5) who test negative on both appear as 'true negatives' rather than missed CD. This creates a self-reinforcing loop where the tests validate each other without independent biopsy confirmation.","magnitude_estimate":"Cannot be estimated without biopsy-independent validation in genotype-stratified cohorts","evidence_sources":[]}],"unproven_assumptions_identified":[{"assumption":"Anti-DGP tests detect gliadin-directed antibodies equally well across all HLA risk genotypes.","evidence_against":"QPEQPFP derives from ω/γ-gliadin regions overlapping DQ2.5 T-cell epitopes. DQ8 immunodominant epitope (EGSFQPSQE) has zero homology. DQ8 γ-gliadin epitopes contain native QQPFP not deamidated QEQPFP. Choung 2020 and Liu 2024 show OR<1 for DQ8-only. Wang 2014 shows markedly lower DGP-IgG in DQ8 carriers. Liu 2024 confirms DGP-IgG shows identical genotype gradient as tTG-IgG.","evidence_for":"Zhou 2022 shows DQ8 patients (n=7) recognize QPEQPFP. Tollefsen 2006 (PMID:16878175) showed DQ8 T cells recognize some γ-gliadin peptides near QPEQPFP regions. Some T-cell epitope overlap across HLA types enables linked recognition even in DQ8 patients.","clinical_impact":"False-negative DGP serology in symptomatic DQ8/DQ2.2 patients delays diagnosis, especially combined with negative tTG-IgA sharing the same vulnerability. Liu 2024 confirmed DGP-IgG also fails."},{"assumption":"Reported DGP sensitivity of 80-95% applies uniformly across CD populations.","evidence_against":"Validation cohorts >90% DQ2.5-positive. No formal sensitivity by genotype. Wang 2014: only 1 DQ8 carrier positive for DGP-IgG. Pietzak 2009: 13.4x difference in EMA positivity. Liu 2024: DQ8-only OR<1 for both tTG-IgG and DGP-IgG.","evidence_for":"No study has formally demonstrated reduced DGP sensitivity in biopsy-confirmed non-DQ2.5 CD specifically (Liu 2024 comes closest for positivity rates).","clinical_impact":"If true sensitivity in DQ8-only is 50-60%, affects 5-10% of CD patients — potentially hundreds of thousands globally."}],"overlooked_populations":[{"population":"Celiac patients with HLA-DQ8-only presenting with negative IgA-tTG2 AND negative anti-DGP (both IgA and IgG)","estimated_size":"5-10% of total CD population","why_missed":"Both tTG-IgA and DGP (IgA and IgG) share the same HLA-dependent T-cell help mechanism. Liu 2024 confirmed DGP-IgG shows same genotype gradient — the IgG backup test fails for the same reason. DQ8 patients additionally tend toward milder mucosal damage, compounding the lower antibody production.","proposed_solution":"Lower biopsy threshold for symptomatic DQ8 patients with negative serology. Develop HLA-genotype-informed cutoffs. Add DQ8-specific deamidated peptides (P1/P9 glutamate positioning) to assay panels."},{"population":"Celiac patients with HLA-DQ2.2-only","estimated_size":"2-5% of total CD population","why_missed":"Only 3 known DQ2.2-restricted epitopes, none containing QPEQPFP. Immunodominant epitope (PFSEQEQPV) from LMW-glutenin, not gliadin. Weaker peptide-MHC stability (Fallang 2009). Combined with verification bias in validation cohorts.","proposed_solution":"Include DQ2.2-specific glutenin-derived peptides in supplementary DGP panels."}],"diagnostic_step_sensitivity":{"step_name":"anti-DGP IgA and IgG","reported_sensitivity":"DGP IgA: 80-95%; DGP IgG: 80-98% (ESPGHAN 2020, ACG 2023)","adjusted_sensitivity":"Unknown for non-DQ2.5 patients. Wang 2014: only 1 DQ8 carrier positive for DGP-IgG in 356 IgA-deficient adults. Liu 2024: DGP-IgG positivity rate in DQ8-only indistinguishable from non-permissive genotypes.","false_negative_rate":"Reported 5-20% overall; likely substantially higher in DQ8-only and DQ2.2-only patients","key_limitations":["No formal HLA-stratified sensitivity validation in biopsy-confirmed CD","Liu 2024 confirms DGP-IgG shows same genotype gradient as tTG-IgG — backup test shares same weakness","Peptide antigens derived from DQ2.5-dominant discovery cohorts","QPEQPFP overlaps DQ2.5-specific T-cell epitopes; DQ8 γ-gliadin epitopes contain native (not deamidated) QQPFP","EuroImmun GAF-3X trimeric design amplifies avidity for same motif rather than broadening coverage","Assay cutoffs calibrated on DQ2.5-dominated populations","Proprietary commercial sequences prevent independent verification of exact peptide coverage","Validation cohorts identified by tTG-IgA (circular validation with shared T-cell help mechanism)"]},"contradictory_studies":[{"citation":"Zhou et al. 2022, Cell Reports","pmid":"36288703","finding":"DQ8 (n=7) and DQ2.2 (n=1) patients produce antibodies recognizing QPEQPFP, with even 'stronger bias toward peptides harboring PEQ motif.' Argues against complete assay blindness; supports quantitative not qualitative bias.","contradicts":"Hypothesis that DGP tests are blind to non-DQ2.5 CD. Refines prediction from 'different epitopes' to 'same epitope, weaker response.'"},{"citation":"Tollefsen et al. 2006, J Clin Invest","pmid":"16878175","finding":"DQ8 T cells recognize peptides from γ-gliadin regions overlapping QPEQPFP. Some γ-gliadin peptides recognized by T cells in context of DQ2 or DQ8 bound in same register but with different deamidation requirements (P4 for DQ2 vs P1/P9 for DQ8). Enables linked recognition even in DQ8 patients.","contradicts":"Prediction that DQ8 patients cannot receive T-cell help for anti-QPEQPFP B cells."}],"research_gaps":[{"gap":"No formal sensitivity study of DGP in biopsy-confirmed CD stratified by HLA genotype. Liu 2024 provides DGP-IgG positivity rates by genotype in IgA-deficient patients but not formal sensitivity against biopsy gold standard.","importance":"high","proposed_study_design":"Retrospective biorepository analysis with banked sera, HLA typing, and biopsy data. Min 50 DQ8-only and 20 DQ2.2-only biopsy-confirmed CD patients. Report sensitivity with 95% CI per genotype. Multi-center (Mayo, Columbia, Oslo)."},{"gap":"B-cell epitope mapping in DQ8-only and DQ2.2-only patients at scale, with absolute titer comparison against commercial assay peptides.","importance":"high","proposed_study_design":"High-density peptide microarray (Zhou 2022 protocol) using genotype-stratified biopsy-confirmed sera, including absolute titer quantification against the specific PLQPEQPFP nonapeptide used in commercial assays."},{"gap":"DQ8-specific deamidated peptides (P1/P9 glutamate) never tested for diagnostic improvement.","importance":"high","proposed_study_design":"Synthetic peptides with DQ8 deamidation patterns (glutamate at P1 and P9 positions, e.g., based on EGSFQPSQE framework). ELISA binding comparison vs standard QPEQPFP in DQ8 celiac sera."},{"gap":"Stereotyped anti-DGP antibody structures (IGHV3-23/IGLV4-69, IGHV3-15/IGKV4-1) only characterized in DQ2.5 patients.","importance":"medium","proposed_study_design":"Single-cell BCR sequencing from DQ8 celiac gut biopsies (Steinsbø 2014 protocol). Determine whether DQ8 patients use the same stereotyped clones or different BCR repertoire."},{"gap":"Interaction between IgG subclass deficiency and DGP-IgG performance completely unstudied.","importance":"medium","proposed_study_design":"IgG subclass quantification (IgG1, IgG2, IgG3, IgG4) in DGP-IgG-negative celiac patients vs DGP-IgG-positive controls. Correlate IgG1 levels with DGP-IgG titers."},{"gap":"DGP assay cutoff optimization by HLA genotype.","importance":"medium","proposed_study_design":"ROC analysis of existing DGP data stratified by HLA genotype; test lower cutoffs in DQ8/DQ2.2 subgroups. Requires access to continuous DGP titer data linked to HLA genotype and biopsy results."}],"differential_diagnoses_relevant":[{"condition":"IgA deficiency with false-negative IgA-tTG2 and IgA-DGP","overlap_with_cd":"Both produce negative IgA-based serology; IgA deficiency 10-15x more common in CD","distinguishing_features":"Total serum IgA measurement. IgG-based backup tests recommended — but Liu 2024 confirmed DGP-IgG shows same genotype-dependent gradient. The IgG backup also fails for DQ8-only patients."},{"condition":"NCGS (Non-Celiac Gluten Sensitivity)","overlap_with_cd":"Symptoms overlap; both may have native anti-gliadin antibodies. If DQ8/DQ2.2 celiac patients are seronegative with Marsh 3A, they may be misclassified as NCGS.","distinguishing_features":"NCGS classically defined by absence of villous atrophy and specific serology — but this boundary blurs if DQ8/DQ2.2 celiac patients have villous atrophy with negative serology and are not biopsied."}],"recommendations":[{"recommendation":"The critical missing experiment remains a formal sensitivity study of DGP in biopsy-confirmed CD stratified by HLA genotype. Liu 2024 provides the closest available data but falls short of definitive proof. This single study would settle the question.","target":"researchers","evidence_basis":"Liu 2024 shows DGP-IgG genotype gradient in IgA-deficient patients. Choung 2020 shows tTG-IgA gradient. Zhou 2022 shows lower reactivity in DQ8. All indirect — need formal sensitivity calculation."},{"recommendation":"In symptomatic patients with DQ8-only or DQ2.2-only genotype and negative standard serology (including DGP-IgG), duodenal biopsy should be performed rather than ruling out CD. HLA genotype should be explicitly flagged as a reason for high clinical suspicion warranting biopsy.","target":"clinicians","evidence_basis":"Both tTG and DGP (including IgG backup) share HLA-dependent T-cell help mechanism. Liu 2024 confirmed DGP-IgG fails similarly. Wang 2014: only 1 DQ8 carrier positive for DGP-IgG. ACG 2023 guideline recommendation 4 already states 'if suspicion is high, biopsy even if serology negative' — but does not specifically flag DQ8/DQ2.2 as a reason for high suspicion."},{"recommendation":"Future DGP assays should incorporate DQ8-relevant peptides (P1/P9 glutamate deamidation) and DQ2.2-relevant sequences alongside QPEQPFP to broaden genotype coverage.","target":"diagnostic manufacturers","evidence_basis":"All current assays test one molecular motif optimized for DQ2.5 populations. DQ8 immunodominant epitope has zero homology to assay peptide. DQ8 γ-gliadin epitopes contain native not deamidated QQPFP."},{"recommendation":"Guidelines should note that DGP sensitivity figures (80-95%) apply to DQ2.5-dominant populations and that DGP-IgG (backup for IgA-deficient patients) shares the same HLA-dependent limitation. Sensitivity should not be assumed equivalent across genotypes.","target":"guidelines","evidence_basis":"Liu 2024 confirmed DGP-IgG shows identical genotype gradient as tTG-IgG. Current ESPGHAN and ACG guidelines recommend DGP-IgG as backup without HLA qualification."}],"meta_analysis_summary":{"studies_reviewed":20,"total_patients":38600,"pooled_estimates":{"note":"No formal meta-analysis possible — heterogeneous study designs. Combined patient counts: Choung 2020 (24,339 tTG data), Liu 2024 (3,714 IgA-deficient, tTG-IgG + DGP-IgG), Pietzak 2009 (10,191 EMA data), Wang 2014 (356 IgA-deficient, direct DGP-IgG data). Total >38,000 patients with genotype-stratified serological data, none reporting formal DGP sensitivity in biopsy-confirmed CD by genotype."},"heterogeneity_notes":"Evidence assembled from: B-cell epitope mapping (Zhou 2022, Osman 2000, Schwertz 2004, Ankelo 2007), T-cell epitope restriction (Bodd 2012, Tollefsen 2006 PMID:16878175, Vader 2003, Sollid 2020 nomenclature), linked recognition experiments (Snir 2017, Iversen 2019, Du Pré 2020 knock-in mice), stereotyped antibodies (Steinsbø 2014), serological OR data (Choung 2020, Liu 2024), direct DGP-IgG by genotype (Wang 2014 PMID:24709954), EMA by genotype (Pietzak 2009). All converge from independent methodological angles."},"reference_patient_impact":{"note":"Per project instructions — impact on reference patient (DQ8, Marsh 3A, all serology <1, low IgG1, low secretory IgA).","patient_profile":"DQ8-only, Marsh 3A, IgA-tTG2 <1, anti-DGP IgG <1, low IgG1 subclass, low secretory IgA","identified_failure_modes":["DGP assay HLA bias: QPEQPFP overlaps DQ2.5-specific T-cell epitopes. DQ8 T cells provide weaker help via fewer epitopes through different anchor requirements. DQ8 γ-gliadin epitopes contain native QQPFP not deamidated QEQPFP. Liu 2024 confirmed DGP-IgG shows same genotype gradient — the IgG backup fails too.","Compounding with IgG1 deficiency via sequential class switching: Siniscalco 2025 showed mucosal IgA is produced via IgM→IgG1→IgA sequential class switching. Low IgG1 impairs mucosal IgA production independently of HLA mechanisms. Two independent serological failure pathways.","DGP-IgG directly impaired by IgG1 deficiency: IgG1 is the dominant subclass for anti-protein responses. Low IgG1 reduces DGP-IgG titers, compounding the HLA-dependent reduction.","Milder DQ8 disease phenotype: DQ8 patients tend toward milder mucosal damage. This patient has Marsh 3A (mildest villous atrophy), consistent with the pattern. Lower damage → lower antibody titers → additional compounding effect.","Low secretory IgA in stool: Consistent with impaired sequential class switching at mucosal level, providing independent evidence for the Siniscalco pathway involvement."],"conclusion":"This patient has at minimum FOUR compounding factors: (1) DQ8 genotype reducing T-cell help for DGP assay epitopes, (2) IgG1 deficiency impairing class switching to IgA via Siniscalco pathway, (3) IgG1 deficiency directly impairing IgG-based backup testing (DGP-IgG), (4) Marsh 3A consistent with milder DQ8 phenotype generating lower titers. Liu 2024 confirms the IgG backup (DGP-IgG) fails for DQ8 patients just as IgA-based tests do. The entirely negative serology is mechanistically coherent, not evidence against celiac disease."}}
