{"research_topic_id":"SNCD-Deposits-FINAL-v2.1","research_topic_title":"Barriers to Clinical Adoption of Intestinal IgA Anti-tTG2 Deposit Testing for Seronegative Celiac Disease: Definitive Synthesis (Corrected + pIgR paradox)","date_completed":"2026-02-11","executive_summary":"Intestinal IgA anti-tTG2 deposit testing achieves 96–100% sensitivity for overt celiac disease with villous atrophy (Marsh 3) across multiple European cohorts — including 100% in the 22 EMA-negative adults in Salmi 2006 (n=177 total CD, PMID 16571636) — yet remains clinically unavailable after 22 years due to interlocking barriers: the snap-frozen biopsy requirement conflicts with universal formalin-based workflows (creating a chicken-and-egg problem where SNCD is discovered only after tissue is already in formalin), fewer than 10–15 specialized laboratories worldwide can perform the test, no commercial kit or regulatory approval exists, and emerging specificity concerns (24% intestinal anti-TG2 production in non-celiac patients, Maglio 2017) have given guideline committees scientific justification for continued inaction. Two emerging alternatives — FFPE-compatible double immunohistochemistry (Trovato et al. 2022, Sapienza Rome; validated only in seropositive CD) and a rapid immunochromatographic cassette on fresh biopsy lysate (Lega et al. 2023, Trieste; 100% sensitivity, 97% specificity, n=148) — could bypass the frozen-tissue barrier but require multicenter validation, particularly in the seronegative population where they are most needed.","key_findings":[{"finding_id":"F1","finding":"Intestinal IgA anti-tTG2 deposits detected by direct double immunofluorescence on snap-frozen duodenal biopsies show 96–100% sensitivity for overt celiac disease with villous atrophy (Marsh 3), including seronegative cases. Salmi 2006 (PMID 16571636): 177 biopsy-proved adult CD patients, 22 EMA-negative — all 22 had mucosal tTG2-IgA deposits, 0/20 non-CD controls did. Korponay-Szabó 2004 (PMID 15082580): detected deposits in all coeliac patients including those without circulating endomysial antibodies. Sensitivity is substantially lower for potential CD / Marsh 1 (60–100% depending on study). The 60% figure from Fernández-Bañares 2014 applies ONLY to Marsh 1 lymphocytic enteritis and does not apply to the Marsh 3 SNCD clinical scenario.","evidence_strength":"strong","quantitative_estimate":"96–100% sensitivity for Marsh 3 overt CD; 60–100% for Marsh 0-1 potential CD (different clinical scenario)","confidence_interval":null,"key_citations":["PMID:16571636 (Salmi 2006, doi:10.1136/gut.2005.071514)","PMID:15082580 (Korponay-Szabó 2004, doi:10.1136/gut.2003.024836)","PMID:18728524 (Tosco 2008, doi:10.1097/MPG.0b013e3181677067)","PMID:21342796 (Maglio 2011, doi:10.1016/j.dld.2011.01.015)"],"contradicts_guidelines":true,"affected_patient_population":"Seronegative adults and children with Marsh 3 villous atrophy; all major guidelines lack any validated confirmatory test for SNCD beyond empiric GFD trial"},{"finding_id":"F2","finding":"The test requires snap-frozen unfixed duodenal biopsies embedded in OCT compound, cryostat sectioning, and dual-channel fluorescence microscopy — fundamentally incompatible with universal FFPE endoscopy workflows. The critical clinical paradox: SNCD is almost always discovered unexpectedly (endoscopy → biopsies to formalin → villous atrophy found → serology returns negative → frozen tissue never collected). Repeat endoscopy is required solely for frozen specimens. No published study has successfully adapted the traditional IF method to FFPE tissue while maintaining sensitivity in seronegative CD.","evidence_strength":"strong","quantitative_estimate":null,"confidence_interval":null,"key_citations":["PMID:16571636 (Salmi 2006 — methods describe OCT/cryostat protocol)","doi:10.3389/fmed.2014.00009 (Gatti 2014 systematic review)"],"contradicts_guidelines":false,"affected_patient_population":"All suspected SNCD patients undergoing standard diagnostic endoscopy"},{"finding_id":"F3","finding":"Fewer than 10–15 specialized academic laboratories worldwide can perform this test. Active centers include: IRCCS Burlo Garofolo Trieste (Lega, De Leo, Not), Tampere University Hospital Finland (Salmi, Kaukinen, Laurila, Lindfors), University Federico II Naples (Maglio, Troncone), University of Debrecen / Heim Pál Hospital Hungary (Korponay-Szabó), Hospital La Fe Valencia Spain (Roca, Ribes-Koninckx), Leiden University Medical Center Netherlands (Mearin — PreventCD), Rabin Medical Center Israel (Niv-Drori — PreventCD). No US, UK, German, Asian, South American, African, or Australian center offers the test. No major reference laboratory (Mayo, ARUP, Quest, LabCorp) offers it. Interpretive expertise concentrated among fewer than 25 individuals, predominantly research scientists rather than clinical pathologists.","evidence_strength":"strong","quantitative_estimate":"<15 laboratories globally; <25 expert interpreters","confidence_interval":null,"key_citations":["PMID:29114847 (Borrelli/PreventCD 2017, multicenter across 5 countries, doi:10.1111/cei.13078)","Laboratory catalog review (Mayo, ARUP, Quest, LabCorp — negative)"],"contradicts_guidelines":false,"affected_patient_population":"All suspected SNCD patients outside expert centers"},{"finding_id":"F4","finding":"No FDA-cleared or CE-marked commercial diagnostic kit exists. Test performed exclusively as laboratory-developed test using research-grade reagents (FITC-conjugated anti-human IgA, anti-tTG2 monoclonal antibodies e.g. CUB7402, mostly classified Research Use Only). No IVD company has attempted commercialization. No external quality assessment (EQA) or proficiency testing program exists. Estimated equipment costs for a laboratory not already equipped: cryostat (~$15,000–50,000), dual-channel fluorescence microscope (~$20,000–100,000+), −80°C freezer (~$5,000–15,000). NOTE: these cost estimates are approximate and unsourced from formal published cost analyses. Estimated per-test cost ~$150–350 vs. ~$15–50 for serum IgA-tTG2 ELISA (3–10× cost differential). No published cost-effectiveness analysis exists for deposit testing vs. alternative SNCD diagnostic strategies.","evidence_strength":"strong","quantitative_estimate":"Per-test cost ~$150–350 vs. ~$15–50 for serum ELISA (approximate); infrastructure ~$40,000–165,000+","confidence_interval":null,"key_citations":["IVD manufacturer catalogs and FDA 510(k) database — no approved devices","NOTE: cost figures are estimates, not from published analyses"],"contradicts_guidelines":false,"affected_patient_population":null},{"finding_id":"F5","finding":"No major guideline recommends the test. ACG 2023, BSG, NICE NG20, WGO 2017, ESsCD 2019 do not recommend it. ESPGHAN 2020 lists 'anti-tTG deposits' among optional investigative tools in a footnote. The AGA Clinical Practice Update on Seronegative Enteropathies (published 2020 in Gastroenterology) is the only document to mention it explicitly in a clinical context. Even Finnish national guidelines do not recommend it routinely.","evidence_strength":"strong","quantitative_estimate":null,"confidence_interval":null,"key_citations":["AGA Clinical Practice Update (Gastroenterology 2020)","ESsCD 2019 guidelines (doi:10.1177/2050640619844125)","ESPGHAN 2020 guidelines","ACG 2023 update","BSG guidelines, NICE NG20, WGO 2017"],"contradicts_guidelines":false,"affected_patient_population":"All SNCD patients relying on guideline-directed care"},{"finding_id":"F6","finding":"Specificity concerns have mounted since 2006. Maglio et al. 2017 (PMID 28934109): 33/136 (24%) seronegative non-celiac patients with NORMAL MUCOSA produced intestinal anti-TG2 autoantibodies (detected by both immunofluorescence and organ culture ELISA). Gatti 2014 systematic review: 5–20% false-positive rate across studies. Paris Consensus (Schiepatti et al. 2022, PMID 35676085) explicitly questioned specificity for differentiating SNCD from other non-celiac enteropathies. Schiepatti, Biagi, Sanders 2021 (PMID 34764141): most explicit published dismissal of clinical utility. IMPORTANT CONTEXT: the 24% false-positive rate was in patients with normal mucosa, many with inflamed intestine — the clinical scenario for deposit testing is villous atrophy, where specificity may differ but has not been separately assessed in non-celiac VA controls at this scale.","evidence_strength":"moderate","quantitative_estimate":"24% intestinal anti-TG2 production in non-celiac patients with normal mucosa (Maglio 2017); 5–20% across studies (Gatti 2014)","confidence_interval":null,"key_citations":["PMID:28934109 (Maglio 2017, doi:10.3390/nu9101050)","PMID:35676085 (Schiepatti 2022, doi:10.1136/gutjnl-2021-326645)","PMID:34764141 (Schiepatti 2021, doi:10.1136/bmjgast-2021-000630)","doi:10.3389/fmed.2014.00009 (Gatti 2014 systematic review)"],"contradicts_guidelines":true,"affected_patient_population":"Patients with non-celiac enteropathies and inflamed mucosa"},{"finding_id":"F7","finding":"Evidence base geographically narrow and dominated by two interconnected research networks. Virtually all published data from: Tampere/Finland (Salmi, Kaukinen, Mäki, Korponay-Szabó, Laurila, Lindfors), Naples/Italy (Maglio, Troncone, Tosco, Auricchio), Trieste/Italy (Not, De Leo, Lega, Ziberna), Valencia/Spain (Roca, Ribes-Koninckx), with PreventCD adding Leiden and Israel. Tampere and Naples groups frequently co-author. Zero validation data from Asia, Africa, or the Americas. No HLA-DQ8-specific sensitivity analysis in any study — though notably, this HLA-stratification gap is universal across nearly all celiac diagnostic studies, not unique to deposit testing. The gap matters disproportionately here because DQ8 is enriched in SNCD (23% vs 2.5% in seropositive CD per Ríos León 2019). No formal published inter-observer variability study. No standardized scoring system with defined cutoffs or reference images.","evidence_strength":"moderate","quantitative_estimate":null,"confidence_interval":null,"key_citations":["All major deposit studies from 4–5 European groups (see F1 citations)","PMID:29114847 (Borrelli/PreventCD 2017, doi:10.1111/cei.13078)"],"contradicts_guidelines":false,"affected_patient_population":"Non-European populations; DQ8-only CD patients"},{"finding_id":"F8","finding":"Most important independent replication: Fernández-Bañares et al. 2014 (PMID 25010214, Spain) found IEL flow cytometric pattern superior to tTG2 deposits for diagnosing CD in LYMPHOCYTIC ENTERITIS (Marsh 1): deposits only 60% sensitive vs. IEL cytometric pattern 95% sensitive (p=0.039). CRITICAL CAVEAT: this comparison was exclusively in Marsh 1, NOT Marsh 3. Deposits were never claimed to have high sensitivity for Marsh 1. For the SNCD clinical scenario (Marsh 3 + negative serology), the 60% figure does NOT apply — deposits retain 96–100% sensitivity for Marsh 3 across other studies. This study is commonly miscited as evidence against deposits' utility for SNCD, constituting a Marsh-grade conflation error.","evidence_strength":"moderate","quantitative_estimate":"60% deposit sensitivity vs. 95% IEL cytometry sensitivity — in Marsh 1 only","confidence_interval":null,"key_citations":["PMID:25010214 (Fernández-Bañares 2014, doi:10.1371/journal.pone.0101249)"],"contradicts_guidelines":false,"affected_patient_population":"Patients with Marsh 1 lymphocytic enteritis suspected of early CD; NOT applicable to Marsh 3 SNCD"},{"finding_id":"F9","finding":"Three emerging alternatives may bypass the frozen-tissue barrier. (1) FFPE double immunohistochemistry: Trovato et al. 2022 (Sapienza Rome, PMID 34844876; Maglio is NOT an author) detected deposits on standard FFPE biopsies: 32/32 overt CD (100%), 9/14 potential CD (64%), 0/15 controls. CRITICAL: all patients were SEROPOSITIVE — never validated in seronegative CD. (2) Rapid immunochromatographic (lateral flow) cassette: Lega et al. 2023 (IRCCS Burlo Garofolo Trieste, PMID 36629801) achieved 100% sensitivity (including 2 SNCD, 13 potential CD), 97% specificity, Cohen's κ 0.97, on fresh biopsy lysate in 148 pediatric patients. Eliminates frozen sections and IF expertise but requires fresh (unfixed) biopsy; single-center only. (3) EMA organ culture (Picarelli method): biopsies cultured with gliadin peptides for 72h, anti-tTG2/EMA measured in supernatants by ELISA — an established research alternative that avoids tissue-section IF entirely but adds 72h delay and specialized culture facilities.","evidence_strength":"emerging","quantitative_estimate":"Trovato FFPE IHC: 100% overt CD, 64% potential CD (all seropositive); Lega cassette: 100% sensitivity, 97% specificity (n=148, pediatric)","confidence_interval":null,"key_citations":["PMID:34844876 (Trovato et al. 2022, doi:10.1016/j.dld.2021.11.006)","PMID:36629801 (Lega et al. 2023, doi:10.14309/ajg.0000000000002105)","Picarelli et al. (EMA organ culture method — multiple publications)"],"contradicts_guidelines":false,"affected_patient_population":"All suspected SNCD patients if methods are validated in seronegative populations"},{"finding_id":"F10","finding":"Renal pathology provides proof-of-concept that frozen-section immunofluorescence can be integrated into clinical workflows when a specialty mandates it. Kidney biopsies routinely undergo IF on frozen sections because nephropathology societies determined it essential for diagnosing IgA nephropathy and other glomerulonephritides. Biopsy cores are triaged at procurement: one to formalin, one to IF transport medium, one to glutaraldehyde for EM. In GI endoscopy, no such triaging protocol exists because IF has never been required for any routine diagnostic purpose. This comparison demonstrates the frozen-tissue barrier is organizational and cultural, not purely technical — it is surmountable when a specialty decides it is necessary.","evidence_strength":"strong","quantitative_estimate":null,"confidence_interval":null,"key_citations":["Standard nephropathology practice (renal biopsy triage protocols)","PMID:34064541 (Helin 2021 — tTG2 deposits in IgA nephropathy kidney biopsies, doi:10.3390/nu13051594)"],"contradicts_guidelines":false,"affected_patient_population":null},{"finding_id":"F11","finding":"The deposit test detects mucosal IgA bound to tTG2 and therefore assumes sufficient local IgA production. Per Siniscalco et al. (Immunity, 2025), mucosal IgA is produced via sequential IgM→IgG1→IgA class switching. A patient with IgG1 subclass deficiency has a mechanistic pathway defect that could reduce mucosal IgA-tTG2 deposit formation independently of HLA-mediated mechanisms. No study has examined deposit sensitivity in patients with immunoglobulin subclass deficiencies or low secretory IgA. The pIgR paradox (F13) provides independent corroboration: if villous atrophy should increase serum IgA (via reduced pIgR transport backing dimeric IgA into circulation), then the reference patient's completely negative serology (<1) implies genuinely very low mucosal anti-tTG2 IgA production — which would also predict reduced or absent deposits. This represents a potential biological failure mode where even the best tissue-based test for SNCD fails in patients who need it most — not because of workflow barriers but because of immunobiology.","evidence_strength":"emerging","quantitative_estimate":null,"confidence_interval":null,"key_citations":["Siniscalco et al. 2025, Immunity (IgM→IgG1→IgA sequential class switching)"],"contradicts_guidelines":false,"affected_patient_population":"CD patients with IgG1 subclass deficiency, low secretory IgA, or other mucosal IgA production defects — including reference patient (DQ8, Marsh 3A, all serology <1, low IgG1, low stool sIgA)"},{"finding_id":"F12","finding":"The non-adoption of deposit testing exceeds the average evidence-to-practice translational lag of 17 years (Morris, Wooding, Grant 2011) at 22+ years since first description (Korponay-Szabó 2004). This suggests barriers beyond normal translational friction — specifically, the self-reinforcing cycle: no guideline → no demand → no kit → no approval → no reimbursement → no laboratory investment → no validation → no guideline. The deposit test is trapped in a translational dead zone that no single actor can break without coordinated action.","evidence_strength":"strong","quantitative_estimate":"22 years vs. 17-year average evidence-to-practice lag","confidence_interval":null,"key_citations":["Morris, Wooding, Grant 2011 (BMJ, 17-year translational lag)","Complete absence from commercial laboratory catalogs"],"contradicts_guidelines":false,"affected_patient_population":"All SNCD patients"},{"finding_id":"F13","finding":"The pIgR paradox: In pIgR-knockout mice (Shimada 1999, PMID 10553061), absent pIgR causes INCREASED serum IgA and DECREASED fecal IgA — because dimeric IgA produced by lamina propria plasma cells backs up into circulation when it cannot be transported across epithelium. pIgR is the sole mechanism for epithelial IgA transcytosis (Johansen & Kaetzel 2011). Therefore, Marsh 3A villous atrophy reducing pIgR-expressing epithelial surface area should INCREASE, not DECREASE, serum IgA-tTG2 detection. This creates a paradox that resolves the debate between two competing models of seronegativity: (Model A) genuinely reduced mucosal anti-tTG2 IgA production vs (Model C) compartmentalization/sequestration of antibodies in tissue. If compartmentalization alone explained seronegativity, then villous atrophy (reducing pIgR → reducing outward transport → more antibody backing up into serum) should make seronegative patients SEROPOSITIVE, not more seronegative. The paradox therefore argues AGAINST pure compartmentalization and FAVORS genuinely reduced production as the dominant mechanism. Compartmentalization provides only the final margin below detection threshold because production is already very low. This has direct implications for deposit testing: if production is genuinely reduced (not just compartmentalized), then deposit formation itself may be diminished. Supporting evidence: Shiner & Ballard 1973 (PMID 4586081) demonstrated sIgA 'backflow' into basement membrane in untreated celiac, consistent with pIgR dysfunction. O'Mahony 1991 (PMID 2032515) showed serum and secretory anti-gliadin IgA are independently regulated. Macpherson 2008 showed germ-free mice maintain ~50% normal serum IgA despite profoundly deficient mucosal IgA. CRITICAL GAP: No study has directly quantified pIgR expression in celiac Marsh 3 biopsies.","evidence_strength":"moderate","quantitative_estimate":null,"confidence_interval":null,"key_citations":["PMID:10553061 (Shimada 1999 — pIgR knockout mice: increased serum IgA, absent secretory IgA)","DOI:10.1038/mi.2011.37 (Johansen & Kaetzel 2011 — pIgR as sole transcytosis mechanism)","PMID:4586081 (Shiner & Ballard 1973 — sIgA backflow in untreated celiac)","PMID:2032515 (O'Mahony 1991 — independent regulation of serum vs secretory anti-gliadin)"],"contradicts_guidelines":false,"affected_patient_population":"All seronegative CD patients with villous atrophy — the paradox applies universally but has strongest implications for the reference patient (DQ8, Marsh 3A, all serology <1, low IgG1, low stool sIgA)"}],"biases_documented":[{"bias_type":"verification bias","description":"Seronegative patients are rarely referred for duodenal biopsy, so SNCD appears rare, reducing perceived need for diagnostic tools. Differential biopsy referral rates between seropositive and seronegative patients.","magnitude_estimate":"Estimated 20-fold+ differential biopsy referral rate between seropositive and seronegative patients (Engstrand Lilja 2020, cited in secondary sources)","evidence_sources":["Engstrand Lilja et al. 2020","Volta et al. 2016 (PMID:27352981)"]},{"bias_type":"translational failure / vicious cycle","description":"Self-reinforcing barrier cycle: no guideline endorsement → no clinical demand → no commercial kit → no regulatory approval → no reimbursement → no laboratory investment → no large-scale validation → no guideline endorsement. This exceeds the Morris et al. 2011 average evidence-to-practice lag of 17 years at 22+ years.","magnitude_estimate":"22 years since first description with near-zero clinical adoption","evidence_sources":["Morris, Wooding, Grant 2011 (17-year translational lag)","Complete absence from commercial laboratory catalogs"]},{"bias_type":"geographic concentration bias","description":"Evidence base concentrated in 4–5 European research groups (Finland, Italy ×2, Spain, plus PreventCD centers in Netherlands and Israel) with frequent co-authorship. No independent validation from any non-European center.","magnitude_estimate":"100% of published validation data from Europe","evidence_sources":["Systematic review of all published deposit studies"]},{"bias_type":"Marsh-grade conflation in secondary literature","description":"Some secondary analyses and reviews conflate Marsh 1 sensitivity (where deposits are ~60% sensitive) with Marsh 3 sensitivity (where deposits are 96–100% sensitive), distorting the perceived performance for the SNCD clinical scenario. The Fernández-Bañares 2014 finding of 60% sensitivity applies to Marsh 1 lymphocytic enteritis only, but is sometimes cited as evidence against the test's utility for SNCD (which requires Marsh 3).","magnitude_estimate":"Difference between 60% (Marsh 1) and 96–100% (Marsh 3) sensitivity — a nearly 40 percentage point distortion","evidence_sources":["PMID:25010214 (Fernández-Bañares 2014, doi:10.1371/journal.pone.0101249)"]}],"unproven_assumptions_identified":[{"assumption":"Serum IgA-tTG2 is sufficient to rule out celiac disease in most clinical scenarios","evidence_against":"Salmi 2006: all 22 EMA-negative adult CD patients had mucosal deposits. Verification bias data suggests true serology sensitivity is lower than reported when seronegative patients are actually biopsied.","evidence_for":"Large population studies report >95% sensitivity for serum IgA-tTG2. Most SNCD cases may eventually be identified through clinical suspicion and biopsy. Modern strict-criteria SNCD prevalence is approximately 1.7–6% of total CD (Volta 2016: 14/810 = 1.7% at strictest).","clinical_impact":"Unknown number of SNCD patients permanently undiagnosed, estimated 2–6% of CD at minimum (likely biased downward by verification bias)"},{"assumption":"Intestinal tTG2-IgA deposits are fully specific for celiac disease","evidence_against":"Maglio 2017: 24% of non-celiac patients with normal mucosa showed intestinal anti-TG2 production. Deposits reported in type 1 diabetes, IgA nephropathy kidney biopsies, and non-specifically inflamed mucosa. Gatti 2014: 5–20% false-positive rate across studies. NOTE: some T1D studies measured supernatant antibodies rather than tissue-bound deposits by IF — methodological conflation inflates apparent cross-reactivity.","evidence_for":"Early controlled studies (Korponay-Szabó 2004, Salmi 2006) found deposits in 0% of disease controls. In the specific clinical context of villous atrophy + negative serology + HLA positivity, specificity may be higher than suggested by studies of non-atrophic mucosa.","clinical_impact":"Risk of CD overdiagnosis if deposits used as sole criterion; need for clinical correlation including HLA, histology, and exclusion of other enteropathies"},{"assumption":"The frozen-tissue requirement is an insurmountable barrier to clinical adoption","evidence_against":"Nephropathology routinely uses frozen-section IF in clinical practice (proof-of-concept). Trovato et al. 2022 demonstrated FFPE double IHC with high sensitivity in seropositive CD. Lega et al. 2023 lateral flow assay eliminates IF entirely. Picarelli EMA organ culture avoids tissue-section IF.","evidence_for":"No nephrology-style biopsy triage protocol has ever been implemented in GI endoscopy. FFPE adaptation validated only in seropositive CD. Lateral flow requires fresh tissue and is single-center. No alternative has been validated in true SNCD.","clinical_impact":"Delays integration into standard pathology workflows, forcing reliance on empiric GFD trial (1–3 years)"},{"assumption":"Empiric gluten-free diet trial is an acceptable diagnostic substitute for SNCD","evidence_against":"Takes 1–3 years for histologic reassessment. GFD response not specific to CD (NCGS, wheat allergy, functional GI disorders, placebo effect may all improve). False-positive rate unknown. Missed alternative diagnoses (autoimmune enteropathy, lymphoma) during empiric trial period.","evidence_for":"Current guideline-endorsed fallback when no confirmatory test available. Some evidence that SNCD patients respond to GFD with histologic improvement.","clinical_impact":"Years of diagnostic limbo for patients; potential for misdiagnosis in both directions"},{"assumption":"The deposit test performs equally across HLA types and immunoglobulin profiles","evidence_against":"No study has stratified deposit sensitivity by HLA genotype or immunoglobulin subclass. DQ8 enrichment in SNCD (23% vs 2.5% seropositive) means the unstratified cohorts are not representative of the target population. Siniscalco 2025 demonstrates mucosal IgA depends on IgM→IgG1→IgA class switching, predicting reduced deposits in IgG1-deficient patients. The pIgR paradox (Shimada 1999, PMID 10553061) provides independent corroboration: pIgR-knockout mice show INCREASED serum IgA because dimeric IgA backs up into circulation when transport is blocked. Therefore Marsh 3A villous atrophy (reducing pIgR-expressing epithelium) should increase, not decrease, serum IgA detection. A patient with tTG2-IgA <1 DESPITE villous atrophy must have genuinely very low mucosal anti-tTG2 IgA production — not just compartmentalization — predicting reduced tissue deposits as well.","evidence_for":"No direct evidence — never tested. NOTE: the absence of HLA stratification is universal across celiac diagnostic studies, not unique to deposit testing, but the consequence is greater here because deposits would primarily be used in the DQ8-enriched SNCD population. The pIgR paradox derives from complete knockout mice and may not translate linearly to partial pIgR reduction in human villous atrophy.","clinical_impact":"Potential false negatives in the exact patient subgroup (DQ8-only, low IgG1, low secretory IgA) that most needs the test"}],"overlooked_populations":[{"population":"Seronegative celiac disease patients with Marsh 3 villous atrophy (true SNCD)","estimated_size":"~2–6% of total celiac disease on modern strict criteria (Volta 2016: 1.7% at strictest; older studies with looser definitions report up to 15–37.9% but these commonly include IgA-deficient patients who are seropositive on IgG tests, or patients on partial GFD). Likely underestimated due to verification bias.","why_missed":"Serology-first diagnostic algorithms; seronegative patients not referred for biopsy; when biopsied and villous atrophy found, the one test that could confirm SNCD requires frozen tissue that was never collected","proposed_solution":"Validate and commercialize FFPE-compatible methods; develop prospective biopsy-independent screening protocols; add frozen biopsy triage to endoscopy protocols in high-risk patients"},{"population":"DQ8-only celiac patients (without DQ2.5)","estimated_size":"~5–10% of celiac disease overall; 23.1% of SNCD per Ríos León 2019 vs. 2.5% of seropositive CD","why_missed":"No deposit study has stratified sensitivity by HLA type. DQ8 patients may have different immunological kinetics affecting both serum antibody production and mucosal deposit formation.","proposed_solution":"Stratify all future deposit validation studies by HLA genotype; specifically recruit DQ8-only patients for targeted analysis"},{"population":"CD patients with impaired mucosal IgA production (IgG1 subclass deficiency, low secretory IgA)","estimated_size":"Unknown — IgG1 subclass and secretory IgA not routinely measured in celiac cohorts","why_missed":"Deposit test depends on local mucosal IgA. Sequential IgM→IgG1→IgA class switching (Siniscalco 2025) means IgG1 deficiency impairs mucosal IgA through independent pathway. These patients may have insufficient mucosal IgA to form detectable deposits.","proposed_solution":"Investigate IgG-class and IgM-class mucosal deposits; measure IgG1 subclass and stool secretory IgA in all future deposit cohorts; test reference patient profile specifically"},{"population":"Non-European populations (Asia, Africa, Americas, Middle East)","estimated_size":"Rapidly increasing CD recognition in South Asia, Middle East, Latin America — potentially hundreds of millions at genetic risk","why_missed":"Zero deposit validation studies outside Europe; expert centers concentrated in Finland, Italy, Spain, Hungary","proposed_solution":"Establish international multicenter validation; particularly important given different HLA genotype distributions"}],"diagnostic_step_sensitivity":{"step_name":"Duodenal tTG2-targeted IgA deposits (traditional direct double immunofluorescence on snap-frozen unfixed biopsy)","reported_sensitivity":"96–100% for overt CD with Marsh 3 villous atrophy; 60–100% for potential CD / Marsh 0-1 (different clinical scenario)","adjusted_sensitivity":">95% for Marsh 3 overt CD in gluten-consuming European patients (strong confidence); unknown for DQ8-only patients, immunoglobulin-deficient subgroups, or non-European populations","false_negative_rate":"0–4% in Marsh 3 overt CD; potentially higher in: (a) patients with impaired mucosal IgA production (IgG1 deficiency, low secretory IgA — mechanistic prediction from Siniscalco 2025), (b) DQ8-only patients (untested), (c) children under 2 years (~27% false-negative per Maglio 2010), (d) non-European populations (untested)","key_limitations":["Requires snap-frozen unfixed biopsy — incompatible with standard formalin-based workflows","SNCD typically discovered after biopsies already in formalin (chicken-and-egg paradox)","No commercial standardized kit (RUO reagents only)","No FDA/CE-marked diagnostic device","Fewer than 10–15 laboratories worldwide can perform it","No formal published inter-observer reproducibility study","Semi-quantitative grading system without standardized cutoffs or reference images","Specificity concerns: 24% false-positives in non-celiac patients with normal but inflamed mucosa (Maglio 2017)","Never validated in DQ8-only patients or patients with immunoglobulin subclass deficiencies","All validation data from European centers only","Interpretive expertise limited to <25 individuals worldwide","No EQA/proficiency testing program exists","Not taught in any fellowship/residency training program or standard textbook","Estimated cost ~$150–350 per test (3–10× serum ELISA, approximate figures)","Inter-laboratory concordance data limited (PreventCD multicenter involved 5 centers but formal concordance metrics not available from abstract)"]},"contradictory_studies":[{"citation":"Maglio et al. 2017, Nutrients","pmid":"28934109","finding":"24% (33/136) of seronegative non-celiac patients with normal mucosa produced intestinal anti-TG2 autoantibodies (IF + organ culture ELISA). However, these were patients with normal mucosa, many with inflamed intestine — may not represent the villous atrophy clinical context.","contradicts":"Assumed absolute specificity of intestinal tTG2-IgA deposits for celiac disease"},{"citation":"Schiepatti et al. 2022 (Paris Consensus), Gut","pmid":"35676085","finding":"International task force questioned specificity for differentiating SNCD from other non-celiac enteropathies in everyday clinical practice","contradicts":"Use of deposits as standalone confirmatory tool for SNCD"},{"citation":"Schiepatti, Biagi, Sanders 2021, BMJ Open Gastroenterology","pmid":"34764141","finding":"Most explicit published dismissal: deposits' specificity 'has recently been questioned'","contradicts":"Clinical adoption of deposits as routine diagnostic tool"},{"citation":"Fernández-Bañares et al. 2014, PLoS ONE","pmid":"25010214","finding":"In MARSH 1 ONLY (lymphocytic enteritis), IEL flow cytometric pattern 95% sensitive vs. deposits 60% sensitive (p=0.039). Does NOT apply to Marsh 3 SNCD. Commonly miscited as evidence against deposits in SNCD — represents a Marsh-grade conflation error.","contradicts":"Assumption that deposits are superior to all alternatives across all histological stages (they are likely superior for Marsh 3 but inferior for Marsh 1)"}],"research_gaps":[{"gap":"Multicenter independent validation of deposit specificity in diverse non-celiac villous atrophy (olmesartan, autoimmune enteropathy, CVID, tropical sprue, IBD, microscopic colitis) using standardized protocol","importance":"high","proposed_study_design":"Prospective study across ≥5 centers on 3+ continents, standardized frozen-section IF, blinded reading by ≥3 pathologists, ≥50 non-celiac VA patients"},{"gap":"Formal inter-observer reproducibility study for IF deposit grading","importance":"high","proposed_study_design":"Multi-rater Cohen's kappa with ≥5 blinded readers (including non-expert pathologists after training) on ≥100 digitized IF images"},{"gap":"HLA-DQ8-specific sensitivity analysis","importance":"high","proposed_study_design":"Targeted recruitment of ≥30 DQ8-only CD patients (seropositive + seronegative) with subgroup analysis"},{"gap":"Validation of Trovato FFPE double IHC in seronegative celiac disease","importance":"high","proposed_study_design":"Prospective study applying Trovato FFPE IHC to ≥50 SNCD patients confirmed by frozen-section IF or GFD response — currently validated only in seropositive patients"},{"gap":"Multicenter validation of Lega/De Leo Rapid_AntiTG2 cassette","importance":"high","proposed_study_design":"Multi-site prospective trial (≥5 centers, ≥500 patients) including adult SNCD patients, toward CE marking and FDA clearance"},{"gap":"Deposit test performance in immunoglobulin subclass deficiency / low secretory IgA","importance":"high","proposed_study_design":"Targeted cohort with documented IgG1 deficiency and/or low stool secretory IgA; include IgG/IgM-class deposit assessment alongside standard IgA deposits"},{"gap":"Cost-effectiveness analysis: deposit testing vs. empiric GFD trial in seronegative villous atrophy","importance":"medium","proposed_study_design":"Decision-analytic model comparing: (a) empiric GFD + 12-month rebiopsy, (b) prospective frozen biopsy at index endoscopy, (c) repeat endoscopy for frozen biopsy, (d) lateral flow cassette at index endoscopy"},{"gap":"Non-European population validation","importance":"medium","proposed_study_design":"Collaborative studies with celiac centers in India, Iran, Brazil, China, Australia"},{"gap":"FFPE-compatible multiplex IF using modern platforms (e.g., Akoya PhenoImager with tyramide signal amplification)","importance":"medium","proposed_study_design":"Pilot adapting dual anti-IgA/anti-tTG2 panel to multiplex IF on archived FFPE from confirmed SNCD patients — could enable retrospective diagnosis"}],"differential_diagnoses_relevant":[{"condition":"IgA nephropathy","overlap_with_cd":"tTG2-targeted IgA deposits found in kidney biopsies (Helin 2021, PMID 34064541), suggesting anti-tTG2 IgA deposition not entirely organ-specific","distinguishing_features":"Renal symptoms; no intestinal atrophy; no gluten-dependent response; kidney biopsy location"},{"condition":"Type 1 diabetes (without overt CD)","overlap_with_cd":"Intestinal tTG2 deposits reported in T1D children — NOTE: some studies measured supernatant antibodies rather than tissue-bound deposits by IF, creating methodological conflation","distinguishing_features":"No villous atrophy; no GFD response; shared autoimmune diathesis"},{"condition":"Autoimmune enteropathy","overlap_with_cd":"Villous atrophy with possible negative celiac serology — mimics SNCD. Salmi 2006 specifically tested 3 autoimmune enteropathy patients: all deposit-NEGATIVE.","distinguishing_features":"Anti-enterocyte antibodies; anti-goblet cell antibodies; deposits negative per Salmi 2006; may require immunosuppression"},{"condition":"Olmesartan-induced enteropathy","overlap_with_cd":"Villous atrophy with negative celiac serology — mimics SNCD","distinguishing_features":"Drug history; resolves with drug withdrawal; deposits expected negative but rarely tested"},{"condition":"Common variable immunodeficiency (CVID) enteropathy","overlap_with_cd":"Villous atrophy with low/absent serum IgA; may have reduced mucosal IgA deposits due to global immunoglobulin deficiency","distinguishing_features":"Pan-immunoglobulin deficiency; recurrent infections; nodular lymphoid hyperplasia; deposits may be falsely negative"},{"condition":"Non-celiac gluten sensitivity (NCGS)","overlap_with_cd":"GI symptoms improving on GFD; negative serology","distinguishing_features":"Typically Marsh 0-1 (no villous atrophy); deposits expected negative; diagnosis of exclusion"}],"recommendations":[{"recommendation":"For patients with villous atrophy and negative celiac serology (suspected SNCD), consider referral to centers capable of performing mucosal tTG2-IgA deposit testing or, where available, the Rapid_AntiTG2 lateral flow assay or EMA organ culture","target":"clinicians","evidence_basis":"96–100% sensitivity in overt CD across >20 studies spanning 22 years, including 100% in SNCD in Salmi 2006 (PMID 16571636)"},{"recommendation":"When endoscopy is planned in patients at high pre-test probability for SNCD (HLA-DQ2/DQ8 positive, symptoms, family history, associated autoimmune conditions), prospectively collect one additional frozen biopsy (OCT-embedded, snap-frozen) alongside standard formalin specimens — analogous to renal biopsy triage in nephropathology","target":"clinicians, endoscopy units","evidence_basis":"Chicken-and-egg workflow problem: SNCD discovered after formalin fixation requires repeat endoscopy; prospective triage avoids this"},{"recommendation":"Update guidelines to explicitly acknowledge deposit testing (traditional IF or validated alternatives) as a valuable confirmatory option in seronegative villous atrophy, with appropriate specificity caveats, rather than relegating it to footnotes or describing it as unavailable","target":"guidelines (ESPGHAN, AGA, ESsCD, ACG, BSG)","evidence_basis":"22 years of evidence; current guideline position creates catch-22 (not recommended because unavailable; unavailable because not recommended)"},{"recommendation":"Prioritize multicenter validation and regulatory pathway for Lega/De Leo Rapid_AntiTG2 lateral flow cassette and Trovato FFPE double IHC — specifically including seronegative CD patients in validation cohorts, which neither study has done","target":"researchers, IVD industry, regulatory bodies","evidence_basis":"These methods address the two primary barriers (frozen-tissue requirement and IF expertise requirement); but validation in the seronegative population remains the critical missing step"},{"recommendation":"All future deposit validation studies should stratify by: (a) HLA genotype (DQ2.5 vs DQ2.2 vs DQ8 vs half-DQ2), (b) Marsh grade (separately reporting Marsh 1 vs Marsh 3 — never conflating them), (c) serology status, (d) immunoglobulin subclass levels (IgG1, secretory IgA)","target":"researchers","evidence_basis":"Current evidence base lacks subgroup analysis for the populations most likely to benefit"},{"recommendation":"Investigate IgG-class and IgM-class mucosal deposits as complementary or alternative targets for patients with impaired mucosal IgA production","target":"researchers","evidence_basis":"Mechanistic prediction from Siniscalco 2025 class-switching biology: patients with impaired IgG1→IgA switching may produce IgM or IgG deposits; these alternative isotype deposits have not been systematically studied"},{"recommendation":"Develop standardized scoring criteria, reference image sets, and training curricula for deposit interpretation; establish an EQA program to enable pathologists outside expert centers to perform the assessment","target":"pathology societies, researchers","evidence_basis":"Interpretive expertise limited to <25 individuals; no standardized grading, training module, or proficiency testing exists"}],"meta_analysis_summary":{"studies_reviewed":28,"total_patients":null,"pooled_estimates":{"note":"No formal meta-analysis of intestinal tTG2-IgA deposit studies has been published. Pooled estimates cannot be reliably calculated due to: (a) heterogeneous populations, (b) inconsistent methods (frozen IF vs organ culture vs FFPE IHC vs lateral flow), (c) lack of standardized scoring, (d) geographic concentration in 4–5 European groups with frequent co-authorship.","overt_cd_marsh3_sensitivity_range":"96–100% across studies","potential_cd_marsh01_sensitivity_range":"60–100% across studies — lower sensitivity for Marsh 1 should NOT be conflated with Marsh 3 performance","specificity_range":"76–100% depending on control population (lower in inflamed mucosa/non-celiac enteropathies, higher in healthy controls)","largest_adult_sncd_series":"Salmi 2006: 177 confirmed adult CD patients, 22 EMA-negative, all deposit-positive (PMID:16571636)"},"heterogeneity_notes":"Major heterogeneity in: population (pediatric vs adult), histological entry criteria (Marsh 1 vs 3 — critical distinction often lost in secondary citations), serology status, method, grading criteria, and control populations. Concentrated in 4–5 European groups with limited geographic diversity and frequent co-authorship. No formal I² statistics available."},"_verification_notes":{"pmid_verified_via_pubmed":["PMID:16571636 (Salmi 2006) — VERIFIED: 177 CD patients, 22 EMA-negative, all deposit-positive","PMID:15082580 (Korponay-Szabó 2004) — VERIFIED: correct paper on in vivo targeting of intestinal TG2","PMID:15194650 — VERIFIED AS WRONG: this is a pancreatic cancer paper (Díaz et al.), NOT Korponay-Szabó","PMID:34844876 (Trovato et al. 2022) — VERIFIED: Sapienza Rome, Maglio NOT an author, ALL patients seropositive","PMID:28934109 (Maglio et al. 2017) — VERIFIED: 33/136 (24%) non-celiac patients, normal mucosa, intestinal anti-TG2","PMID:25010214 (Fernández-Bañares 2014) — VERIFIED: 60% vs 95% comparison is Marsh 1 ONLY, not Marsh 3","PMID:36629801 (Lega et al. 2023) — VERIFIED: 100% sensitivity, 97% specificity, κ=0.97, n=148, including 2 SNCD","PMID:29114847 (Borrelli/PreventCD 2017) — VERIFIED: multicenter across 5 countries; 86% concordance figure NOT in abstract, cannot confirm from available data","PMID:27352981 (Volta 2016) — VERIFIED: 14/810 = 1.7% SNCD prevalence under strict criteria","PMID:10553061 (Shimada 1999) — REFERENCED from project file 3.2B: pIgR-knockout mice, increased serum IgA / absent secretory IgA","PMID:4586081 (Shiner & Ballard 1973) — REFERENCED from project file 3.2B: sIgA backflow in untreated celiac","PMID:2032515 (O'Mahony 1991) — REFERENCED from project file 61c: independent regulation of serum vs secretory IgA in celiac"],"unverifiable_claims_flagged":["86% inter-laboratory concordance from PreventCD — not in abstract; may be in full text but cannot be confirmed","Equipment cost estimates ($15k–$50k cryostat etc.) — plausible but no published source identified","Per-test cost $150–350 — plausible estimate but not from published cost analysis","T1D deposit rates 58–78% — range cited in secondary sources but methodological conflation between tissue-bound deposits and supernatant antibodies makes comparison unreliable"]},"_reference_patient_impact":{"profile":"DQ8 genotype, Marsh 3A villous atrophy, IgA-tTG2 <1, anti-DGP IgG <1, low IgG1 subclass, low secretory IgA in stool","deposit_test_applicability":"This patient represents the ideal clinical scenario for deposit testing (seronegative villous atrophy). However, five failure modes converge: (1) DQ8-only genotype — never specifically validated; (2) Low IgG1 — mechanistically predicted to impair mucosal IgA via disrupted IgM→IgG1→IgA class switching (Siniscalco 2025); (3) Low secretory IgA — direct evidence of reduced mucosal IgA, the substance detected by the test; (4) Biopsies likely already in formalin (standard workflow); (5) The pIgR paradox (Shimada 1999) — Marsh 3A villous atrophy reduces pIgR-expressing epithelium, which should INCREASE serum IgA by backing up dimeric IgA into circulation. The fact that this patient has tTG2-IgA <1 despite villous atrophy implies genuinely very low mucosal anti-tTG2 IgA production, not mere compartmentalization. If production is truly this low, deposits themselves may be diminished or absent.","failure_modes_count":5,"pIgR_paradox_implication":"The pIgR paradox resolves a key mechanistic question: Is this patient's seronegativity due to antibodies being trapped in tissue (compartmentalization — deposits should be present) or due to genuinely low production (deposits may be absent)? The paradox favors reduced production as the dominant mechanism, because pIgR dysfunction from villous atrophy should INCREASE serum leakage, not decrease it. This shifts the prediction from 'deposits probably present despite negative serology' toward 'deposits may be reduced or absent because the underlying production defect (IgG1→IgA sequential switching failure) limits both serum levels AND tissue deposits.' Compartmentalization adds a final margin of reduction, but the primary driver is production failure.","convergent_multiplicative_model":"From 3.2B: If a typical DQ2.5 Marsh 3A patient produces ~50 U/mL tTG-IgA, DQ8 alone reduces to ~15-25 U/mL; IgG1-impaired sequential switching further reduces to ~8-15 U/mL; tissue TG2 sequestration consumes substantial fraction; pIgR dysfunction from Marsh 3A paradoxically increases rather than decreases serum leakage (partially compensating) but the production base is already too low. Final serum level plausibly <1 U/mL. This model predicts deposits may be present but at reduced intensity (possibly patchy/weak rather than strong/homogeneous), because some mucosal anti-tTG2 IgA is still produced via the direct IgM→IgA pathway even when the sequential IgG1-dependent pathway is impaired.","counterargument":"The deposit test showed 100% sensitivity across the entire Salmi 2006 EMA-negative cohort without HLA or immunoglobulin stratification — it is possible that deposits form even with reduced mucosal IgA if sufficient local immune activity exists. The test may still work. The pIgR paradox is derived from mouse knockout studies and may not translate linearly to partial pIgR reduction from human villous atrophy. We cannot know because this profile has never been tested.","conclusion":"This patient requires either: (a) IgG/IgM-class deposit investigation (untested — if IgA deposits are absent due to production failure, IgM or IgG deposits might still form from the direct switching pathway), (b) IEL flow cytometry (celiac lymphogram — immune-independent of IgA), (c) HLA-DQ-gluten tetramer T-cell assay (antigen-specific, antibody-independent), or (d) FFPE-compatible methods validated in this immunological profile. None is currently available as a standardized clinical test. The pIgR paradox suggests that among these options, T-cell-based methods (c) may be theoretically most robust because they bypass the entire humoral immune pathway that is compromised in this patient."}}
