{"research_topic_id":"monitoring-3","research_topic_title":"Impact of HLA-DQ genotype on serology performance for detecting persistent villous atrophy during gluten-free diet monitoring in celiac disease","date_completed":"2026-02-11","executive_summary":"No published study has directly stratified serology-histology concordance during gluten-free diet follow-up by HLA-DQ genotype, representing a major evidence gap. IgA-tTG2 sensitivity for persistent villous atrophy is only ~50% in unselected populations (meta-analysis of 26 studies), with 53–75% of affected patients seronegative despite strict adherence. HLA-DQ2.5 gene dose strongly predicts higher antibody titers at diagnosis (OR up to 96.9 for DQ2 homozygous), while DQ8 and DQ2.2 patients produce systematically weaker responses — including IgG-class tests (DQ2.2 homo OR=0.72, DQ8 homo OR=0.96 for tTG-IgG, both NS). No major guideline addresses HLA-dependent variation in monitoring serology performance, leaving DQ8/DQ2.2 and seronegative patients without reliable non-invasive monitoring.","key_findings":[{"finding_id":"1","finding":"No study has stratified serology sensitivity for persistent villous atrophy during GFD by HLA-DQ genotype — confirmed by systematic PubMed search returning zero results","evidence_strength":"strong","quantitative_estimate":"0 studies identified","confidence_interval":null,"key_citations":[],"contradicts_guidelines":false,"affected_patient_population":"All celiac patients, especially DQ8/DQ2.2 (~10-15% of CD population)"},{"finding_id":"2","finding":"IgA-tTG2 sensitivity for persistent villous atrophy on GFD is approximately 50% in HLA-unselected cohorts, replicated across multiple independent studies: 43.6% (Sharkey 2013, n=391), 44.7% (Lau 2017, n=217), 39.7% (Coleman 2021, n=201), 50% (Packova 2020, n=82), 43% pediatric (Leonard 2017, n=103)","evidence_strength":"strong","quantitative_estimate":"50% pooled sensitivity (range 39.7-50% across individual studies)","confidence_interval":"95% CI: 41-60% (Silvester 2017 meta-analysis)","key_citations":["PMID:28545781","PMID:24117503","PMID:29016564","PMID:33951123","PMID:32774057","PMID:28112686"],"contradicts_guidelines":true,"affected_patient_population":"Adults and children on GFD"},{"finding_id":"3","finding":"EMA-IgA sensitivity for persistent villous atrophy on GFD is comparably poor, confirmed by both meta-analysis and individual studies","evidence_strength":"strong","quantitative_estimate":"45% pooled (Silvester 2017); 38.1% (Coleman 2021); 37.7% (Lau 2017)","confidence_interval":"95% CI: 34-57% (pooled)","key_citations":["PMID:28545781","PMID:33951123","PMID:29016564"],"contradicts_guidelines":true,"affected_patient_population":"Adults on GFD"},{"finding_id":"4","finding":"DGP-based tests consistently outperform tTG-IgA for detecting persistent villous atrophy: two independent studies show ~67-78% sensitivity vs ~45-50% for tTG. Whether this advantage is HLA-independent is unknown but critical to determine.","evidence_strength":"moderate","quantitative_estimate":"DGP-POCT 67.1% vs tTG 44.7% (p=0.0005, Lau 2017); aDGP-IgA 77.8% vs tTG 50% (Packova 2020)","confidence_interval":null,"key_citations":["PMID:29016564","PMID:32774057"],"contradicts_guidelines":false,"affected_patient_population":"Adults on GFD; if HLA-independent, especially valuable for DQ8/DQ2.2 patients"},{"finding_id":"5","finding":"Persistent villous atrophy at 2 years on strict GFD is common even with verified adherence","evidence_strength":"strong","quantitative_estimate":"53% at 2 years (CADER, strict GFD verified by fecal GIP); 34% recovery at 2yr / 66% at 5yr (Rubio-Tapia 2010); 23% persistent VA (Schiepatti 2023, n=694; Coleman 2021, n=368)","confidence_interval":null,"key_citations":["PMID:33491958","PMID:20145607","PMID:37364982","PMID:33951123"],"contradicts_guidelines":false,"affected_patient_population":"De novo adult celiac patients"},{"finding_id":"6","finding":"Majority of patients with persistent villous atrophy have negative serology AND are asymptomatic — creating a silent monitoring failure detectable only by protocol biopsy","evidence_strength":"strong","quantitative_estimate":"75% seronegative and 72.5% asymptomatic among persistent VA cases (CADER); 56.3% seronegative (Lau 2017); 60.3% seroneg tTG (Coleman 2021)","confidence_interval":null,"key_citations":["PMID:33491958","PMID:29016564","PMID:33951123"],"contradicts_guidelines":true,"affected_patient_population":"Adults on GFD with persistent villous atrophy"},{"finding_id":"7","finding":"HLA-DQ2.5 gene dose strongly and quantitatively predicts IgA-tTG2 positivity and titer magnitude at diagnosis, spanning a >90-fold OR range","evidence_strength":"strong","quantitative_estimate":"OR 96.9 (DQ2 homo), 42.3 (DQ2.5/DQ8), 36.8 (DQ2.5 hetero), NS (DQ2.2 alone). Titers significantly higher homozygous vs heterozygous (p<0.02) vs negative (p<0.01). Low-tTG group 61.8% single heterodimer vs 31.7% high-tTG (p=0.005).","confidence_interval":"58.3-147.9 (DQ2 homo OR); 23.3-57.9 (DQ2.5 hetero OR)","key_citations":["PMID:32005535","PMID:18728523","PMID:14530392","PMC3819547"],"contradicts_guidelines":false,"affected_patient_population":"All celiac patients; DQ8/DQ2.2 most affected"},{"finding_id":"8","finding":"Mechanistic basis established: DQ2.5 homozygous APCs present larger repertoire of immunogenic gluten peptides, driving superior T cell proliferation and cytokine secretion. DQ2.2 presents only gamma-gliadin subset; DQ8 narrower still.","evidence_strength":"strong","quantitative_estimate":null,"confidence_interval":null,"key_citations":["PMID:14530392"],"contradicts_guidelines":false,"affected_patient_population":"All celiac patients"},{"finding_id":"9","finding":"IgG-based backup tests follow the same HLA-dependent gradient, closing the alternative diagnostic/monitoring pathway for non-DQ2.5 genotypes","evidence_strength":"moderate","quantitative_estimate":"DQ2.5 homo OR=10.19 for tTG-IgG; DQ2.2 homo OR=0.72 (NS); DQ8 homo OR=0.96 (NS)","confidence_interval":null,"key_citations":["DOI:10.1093/clinchem/hvae106.414","PMID:32005535"],"contradicts_guidelines":true,"affected_patient_population":"DQ8/DQ2.2 patients especially with IgA deficiency or low IgG1"},{"finding_id":"10","finding":"Serology normalizes months to years before mucosa heals, and seroconversion does not discriminate complete from partial histological recovery","evidence_strength":"strong","quantitative_estimate":"~80% negative serology by 6-12 months vs 34% mucosal recovery at 2 years / 66% at 5 years; seroconversion not different between complete vs partial recovery (p=0.309)","confidence_interval":null,"key_citations":["PMID:20145607","PMID:25066096"],"contradicts_guidelines":true,"affected_patient_population":"Adults on GFD"},{"finding_id":"11","finding":"DQ2.5 homozygosity overrepresented in refractory celiac disease type II (44% vs 21% uncomplicated CD) and EATL (53%), despite these patients having strongest diagnostic serological response — demonstrating serology eventually fails even in highest-risk HLA group","evidence_strength":"strong","quantitative_estimate":"RCD II: 44% DQ2 homo vs 20.7% uncomplicated CD; EATL: 53%. 70-81% of RCD patients seronegative despite ongoing VA.","confidence_interval":null,"key_citations":["PMID:16527694"],"contradicts_guidelines":false,"affected_patient_population":"RCD and EATL patients"},{"finding_id":"12","finding":"Clinical stakes of persistent villous atrophy are high but contested: Schiepatti 2023 reports HR 9.53 for complications and 2.93 for mortality, while Lebwohl 2013 (larger cohort, longer follow-up) found NO mortality association (HR 1.01, 95% CI 0.86-1.19). Methodological differences may explain discrepancy.","evidence_strength":"strong","quantitative_estimate":"HR 9.53 complications (4.77-19.04), HR 2.93 mortality (1.43-6.02) per Schiepatti; HR 1.01 mortality (0.86-1.19) per Lebwohl","confidence_interval":"See quantitative_estimate","key_citations":["PMID:37364982","PMID:23190299"],"contradicts_guidelines":false,"affected_patient_population":"All CD patients with persistent VA"},{"finding_id":"13","finding":"D1 (duodenal bulb) biopsies increase detection of persistent villous atrophy by 10.4% beyond D2-only sampling","evidence_strength":"strong","quantitative_estimate":"10.4% increased detection (p<0.0001); 368 patients","confidence_interval":null,"key_citations":["PMID:33951123"],"contradicts_guidelines":false,"affected_patient_population":"All patients undergoing follow-up biopsy"},{"finding_id":"14","finding":"AGA 2020 seronegative enteropathy guideline explicitly requires follow-up biopsy at 1-3 years for seronegative patients with VA and HLA risk factors; this is the only guideline that addresses the reference patient profile directly","evidence_strength":"strong","quantitative_estimate":null,"confidence_interval":null,"key_citations":["PMID:33010252"],"contradicts_guidelines":false,"affected_patient_population":"Seronegative celiac patients"},{"finding_id":"15","finding":"Reference patient (DQ8, Marsh 3A, all serology <1, low IgG1, low secretory IgA) represents convergence of at least five independent monitoring failure mechanisms. Serology-based monitoring is functionally uninformative for this profile.","evidence_strength":"moderate","quantitative_estimate":null,"confidence_interval":null,"key_citations":["PMID:32005535","PMID:28545781","PMID:33491958","DOI:10.1093/clinchem/hvae106.414"],"contradicts_guidelines":true,"affected_patient_population":"Seronegative DQ8 patients with immunoglobulin anomalies"}],"biases_documented":[{"bias_type":"Verification bias in monitoring studies","description":"Follow-up biopsies often triggered by symptoms or positive serology rather than performed by protocol, systematically underestimating persistent damage in seronegative/asymptomatic patients. Only studies with biopsy-independent-of-serology design (Silvester meta-analysis inclusion criterion, CADER, Lau, Sharkey, Coleman) avoid this.","magnitude_estimate":"High; CADER showed 72.5% persistent VA patients asymptomatic and 75% seronegative — these patients would not receive biopsy under symptom/serology-triggered protocols","evidence_sources":["PMID:33491958","PMID:28545781","PMID:24117503","PMID:33951123"]},{"bias_type":"HLA selection bias in study cohorts","description":"Serology-first diagnostic algorithms enrich study populations with high-antibody DQ2.5 genotypes. DQ8/DQ2.2 patients, producing lower or absent serologic responses, are either excluded at diagnosis or underrepresented in follow-up cohorts.","magnitude_estimate":"DQ8/DQ2.2 comprise 10-20% of celiac population but DQ2.2 alone shows no association with tTG-IgA positivity (Choung 2020); these patients are systematically filtered out by serology-first screening","evidence_sources":["PMID:32005535","PMID:18728523"]},{"bias_type":"Marsh grade spectrum bias during monitoring","description":"Persistent damage on GFD skews toward milder Marsh 3a, which elicits lower antibody titers even at diagnosis. The monitoring sensitivity for Marsh 3a-specific persistent VA has never been isolated but is likely well below 40%.","magnitude_estimate":"Significant; tTG titers proportionally lower for milder Marsh grades (p<0.01 for Marsh 3a vs 3c). No study isolates Marsh 3a-specific monitoring sensitivity.","evidence_sources":["PMID:18328437"]},{"bias_type":"Unmeasured HLA heterogeneity as source of between-study variation","description":"Individual study sensitivity for tTG during GFD monitoring ranges from 0.12 to 0.75 (Silvester meta-analysis). If study populations differ in DQ2.5 proportion, this could explain much of the heterogeneity. HLA genotype distribution is not reported as a covariate in any monitoring study.","magnitude_estimate":"Potentially explains substantial fraction of I-squared heterogeneity","evidence_sources":["PMID:28545781"]}],"unproven_assumptions_identified":[{"assumption":"Negative IgA-tTG2 during GFD reliably indicates mucosal healing and adequate adherence","evidence_against":"Pooled sensitivity only 50% (95% CI 41-60%); 56-75% of persistent VA cases seronegative; serology normalizes months-years before mucosa heals; seroconversion does not discriminate complete from partial recovery (p=0.309, Galli 2014)","evidence_for":"High specificity (~83%, CI 79-87%) means positive tTG-IgA is informative for non-adherence/ongoing damage; persistently positive serology usually indicates ongoing gluten exposure (AGA 2019)","clinical_impact":"False reassurance leading to undetected ongoing damage with potential complication risk"},{"assumption":"Serology monitoring performance is approximately equivalent across HLA-DQ genotypes","evidence_against":"Strong gene-dose effect across entire mechanistic chain (Vader 2003); >90-fold OR gradient for tTG positivity at diagnosis (Choung 2020); DQ2.2 alone not associated with tTG-IgA positivity; patients with lower titers at diagnosis will normalize faster","evidence_for":"Airaksinen 2020 found no significant difference in mucosal recovery or antibody positivity at follow-up across DQ2.5 dose groups (though not isolating DQ8-only or DQ2.2-only, and using cross-sectional design). Biology of mucosal healing may be independent of HLA type.","clinical_impact":"If monitoring sensitivity below 30% for DQ8/DQ2.2, serology is functionally uninformative for ~10-15% of celiac patients"},{"assumption":"IgG-based tests adequately compensate in patients with low IgA production or IgA deficiency","evidence_against":"Same HLA-dependent gradient for IgG tests: DQ2.2 homo OR=0.72 (NS), DQ8 homo OR=0.96 (NS). Low IgG1 subclass further compromises IgG-based detection.","evidence_for":"No published counterevidence; assumption appears based on extrapolation from diagnostic performance in DQ2.5-predominant populations","clinical_impact":"Eliminates alternative diagnostic/monitoring pathway for DQ8/DQ2.2 patients with IgA deficiency. Reference patient's low IgG1 compounds this failure."},{"assumption":"Standard tTG-IgA cutoff thresholds are equally appropriate across all HLA-DQ genotypes","evidence_against":"Cutoffs calibrated in DQ2.5-dominated populations (85-90%). DQ8 patients may generate levels below assay cutoff even with active mucosal damage, confirmed empirically by reference patient's seronegativity despite Marsh 3A.","evidence_for":"No genotype-specific ROC analysis exists; assumption is untested rather than supported","clinical_impact":"Genotype-specific cutoffs might improve sensitivity for non-DQ2.5 patients; optimal DGP cutoffs show promise (Packova 2020: optimized aDGP-IgA cutoff reached 72% sens/90% spec)"}],"overlooked_populations":[{"population":"DQ8-only celiac patients reliant on serology monitoring","estimated_size":"5-10% of celiac population","why_missed":"Weakest serologic response among permissive genotypes; no HLA-stratified monitoring protocols; often excluded by serology-first diagnostic pathways","proposed_solution":"Routine HLA typing at diagnosis; protocol biopsy at 2 years regardless of serology/symptoms; explore DGP-based tests (potentially HLA-independent); non-antibody biomarkers (I-FABP, citrulline)"},{"population":"DQ2.2-only celiac patients","estimated_size":"~5% of celiac population","why_missed":"Not even associated with tTG-IgA positivity in largest study (Choung 2020); may be diagnosed incidentally rather than through serology; systematically excluded from serology-triggered monitoring","proposed_solution":"Same as DQ8-only; consider reclassification of monitoring expectations"},{"population":"Patients with combined low-risk HLA genotype AND immunoglobulin anomalies (low IgG1, low secretory IgA)","estimated_size":"Unknown but clinically observed in reference patient","why_missed":"No guideline distinguishes serum IgA deficiency from selective mucosal/secretory IgA reduction; IgG1 subclass not routinely measured; convergence of multiple low-probability factors","proposed_solution":"Biopsy-based monitoring only; fecal GIP for adherence verification; investigate Siniscalco 2025 IgM-to-IgG1-to-IgA sequential class switching as explanatory mechanism"}],"diagnostic_step_sensitivity":{"step_name":"IgA-tTG2 detection of persistent villous atrophy during GFD monitoring","reported_sensitivity":"Often assumed adequate based on diagnostic performance (>90% at diagnosis in DQ2.5-predominant populations)","adjusted_sensitivity":"50% pooled (95% CI 41-60%, Silvester 2017); 43.6% (Sharkey, n=391); 44.7% (Lau, n=217); 39.7% (Coleman, n=201); 50% (Packova, n=82); 43% pediatric (Leonard, n=103)","false_negative_rate":"~50% overall; likely higher (estimated 60-80%) in DQ8/DQ2.2 subgroups based on mechanistic inference — untested directly","key_limitations":["Rapid serology normalization (6-12 months) vs delayed mucosal healing (2-5 years) creates prolonged false-reassurance window","Verification bias in non-protocol biopsy studies inflates apparent sensitivity","HLA genotype variability not measured as covariate — overall sensitivity is average dominated by DQ2.5","Spectrum bias: persistent damage skews toward Marsh 3a, lowest tTG sensitivity even at diagnosis","Seroconversion does not discriminate healed from partially healed (p=0.309, Galli 2014)","IgG backup tests follow same HLA-dependent gradient, closing alternative pathway","Individual study sensitivity ranges 0.12-0.75 — unmeasured population-level confounders (likely HLA distribution)","D1 biopsy increases VA detection by 10.4% (Coleman 2021) — studies using D2-only may underestimate persistent VA, artificially inflating apparent serology sensitivity"]},"contradictory_studies":[{"citation":"Silvester et al. 2017 meta-analysis (Gastroenterology)","pmid":"28545781","finding":"Pooled IgA-tTG2 sensitivity only 50% (95% CI 41-60%) for persistent VA on GFD across 26 studies","contradicts":"Clinical practice of using negative serology as evidence of mucosal healing"},{"citation":"Fernandez-Banares et al. 2021 CADER study (Am J Gastroenterol)","pmid":"33491958","finding":"53% persistent VA at 2 years on strict GFD verified by fecal GIP; 75% seronegative; 72.5% asymptomatic","contradicts":"Assumption that negative serology plus absence of symptoms equals mucosal healing"},{"citation":"Choung et al. 2020 (Human Immunology)","pmid":"32005535","finding":"24,339 adults: >90-fold OR gradient from DQ2 homozygous to DQ2.2 alone; DQ2.2 hetero NOT associated with tTG-IgA positivity","contradicts":"Uniform serology cutoffs/monitoring strategies applied identically across all HLA-DQ genotypes"},{"citation":"Lebwohl et al. 2013 (Aliment Pharmacol Ther)","pmid":"23190299","finding":"7,648 Swedish CD patients: persistent VA NOT associated with mortality (HR 1.01, 95% CI 0.86-1.19) in 11.5-year median follow-up","contradicts":"Schiepatti 2023 finding that persistent VA carries HR 2.93 for mortality — important contradiction in the evidence base for clinical stakes of monitoring failure"},{"citation":"Schiepatti et al. 2023 (Gut)","pmid":"37364982","finding":"694 patients: persistent VA carries HR 9.53 for complications and HR 2.93 for mortality","contradicts":"Lebwohl 2013 null mortality finding; methodological differences (retrospective-prospective vs registry-based; different populations/eras) may explain discrepancy"},{"citation":"Galli et al. 2014 (Aliment Pharmacol Ther)","pmid":"25066096","finding":"Antibody seroconversion not significantly different between complete vs partial histological recovery (p=0.309)","contradicts":"Use of serology normalization as indicator of mucosal healing"},{"citation":"Coleman et al. 2021 (J Gastrointestin Liver Dis)","pmid":"33951123","finding":"368 patients: tTG-IgA sensitivity 39.7%, EMA 38.1% for persistent VA; explicitly concluded serology, CDAT and Biagi performed poorly","contradicts":"Guidelines recommending serology-based monitoring as primary follow-up strategy"}],"research_gaps":[{"gap":"No prospective study calculating serology sensitivity/specificity for persistent VA stratified by full HLA-DQ genotype during GFD","importance":"high","proposed_study_design":"Multicenter prospective cohort with protocol biopsies at 1 and 2 years independent of serology/symptoms; full HLA-DQ typing (DQ2.5 homo, DQ2.5 hetero, DQ2.5/DQ2.2, DQ2.2-only, DQ8-only, DQ8/DQ2.5, DQB1*02 alone); fecal GIP adherence verification; tTG-IgA + DGP-IgA/IgG + EMA at each timepoint; primary: tTG-IgA sensitivity within each HLA stratum. ~500-1000 patients for DQ8 subgroup power."},{"gap":"Whether DGP test advantage (67-78% vs 40-50% tTG) is HLA-dependent or independent","importance":"high","proposed_study_design":"HLA-stratified analysis of existing Lau 2017 or Packova 2020 cohorts; if DGP is less HLA-dependent, it becomes the preferred monitoring test for DQ8/DQ2.2"},{"gap":"Marsh 3a-specific sensitivity of serology during GFD monitoring","importance":"high","proposed_study_design":"Subgroup analysis stratifying serology performance by Marsh grade at follow-up. Existing cohorts (CADER, Lau, Coleman) may have sufficient data for retrospective analysis."},{"gap":"Time to serology normalization stratified by HLA genotype","importance":"high","proposed_study_design":"Serial serology at 3, 6, 12, 24 months in prospective cohort; test whether DQ8/DQ2.2 normalize faster, further shortening monitoring window"},{"gap":"Genotype-specific cutoff optimization for monitoring tests","importance":"medium","proposed_study_design":"ROC analysis by HLA genotype within protocol-biopsy cohort. Packova 2020 showed optimized aDGP-IgA cutoff (22.6 U/mL) improved accuracy substantially; genotype-specific optimization could further improve."},{"gap":"Validation of non-antibody biomarkers (I-FABP, citrulline) in HLA-stratified populations","importance":"medium","proposed_study_design":"Add-on to biopsy cohort; I-FABP reflects enterocyte damage independent of adaptive immune response and may bypass HLA-dependent limitation entirely"}],"differential_diagnoses_relevant":[{"condition":"Non-responsive celiac disease (NRCD)","overlap_with_cd":"Persistent symptoms/damage on intended GFD; most common cause is inadvertent gluten exposure","distinguishing_features":"NRCD requires excluding gluten contamination (fecal GIP), other VA causes, and confirming original CD diagnosis. HLA-dependent monitoring failure means NRCD may go unrecognized in DQ8/DQ2.2 patients with reassuring serology."},{"condition":"Refractory celiac disease type I and II","overlap_with_cd":"Severe persistent VA despite strict GFD >12 months; serology typically negative (70-81%)","distinguishing_features":"RCD II: clonal aberrant IELs; DQ2.5 homozygosity enrichment (44% vs 21%). DQ8-only RCD is exceptionally rare and unstudied from monitoring perspective."},{"condition":"Drug-induced enteropathy (olmesartan)","overlap_with_cd":"Villous atrophy with seronegative serology","distinguishing_features":"Drug history; resolution on withdrawal; may lack IEL increase; HLA-DQ2/DQ8 typically negative"},{"condition":"Seronegative enteropathy (non-celiac)","overlap_with_cd":"Villous atrophy, negative celiac serology, may have permissive HLA","distinguishing_features":"AGA 2020 Clinical Practice Update (PMID:33010252) provides systematic approach; HLA-DQ2/DQ8 absence rules out CD; response to GFD and follow-up biopsy at 1-3 years required to distinguish"}],"recommendations":[{"recommendation":"Do not use negative IgA-tTG2 alone as evidence of mucosal healing. Clinicians should be aware serology misses approximately half of persistent villous atrophy cases overall, and likely more in DQ8/DQ2.2 genotypes.","target":"clinicians, guidelines","evidence_basis":"Meta-analysis of 26 studies (Silvester 2017): 50% sensitivity (CI 41-60%); replicated by CADER, Sharkey, Lau, Coleman, Leonard independently"},{"recommendation":"Perform routine HLA-DQ typing at celiac diagnosis. DQ8-only and DQ2.2-only patients should be flagged for modified monitoring with lower biopsy threshold.","target":"clinicians, guidelines","evidence_basis":"Gene-dose effect established mechanistically (Vader 2003) and epidemiologically (Choung 2020: >90-fold OR gradient); IgG backup follows same gradient"},{"recommendation":"Consider protocol follow-up biopsy at approximately 2 years, independent of serology/symptoms, particularly for: (a) DQ8/DQ2.2 patients, (b) seronegative/low-titer at diagnosis, (c) immunoglobulin anomalies, (d) age >45 at diagnosis. Include D1 biopsies to increase detection by ~10%.","target":"clinicians","evidence_basis":"53% persistent VA at 2yr in strict GFD (CADER); 72.5% asymptomatic, 75% seronegative; D1 adds 10.4% detection (Coleman 2021); AGA seronegative enteropathy guideline already requires 1-3yr biopsy for seronegative patients"},{"recommendation":"Investigate DGP-based tests as potentially superior monitoring tool, especially for DQ8/DQ2.2 patients. Two independent studies show 67-78% sensitivity vs 40-50% for tTG.","target":"researchers, clinicians","evidence_basis":"Lau 2017 (67.1% vs 44.7%, p=0.0005); Packova 2020 (77.8% vs 50%). HLA-independence of this advantage is testable from existing cohort data."},{"recommendation":"For reference-profile patients (DQ8, seronegative at diagnosis, immunoglobulin anomalies), document serology as uninformative. Periodic biopsy is sole reliable mucosal assessment. Use fecal GIP for adherence verification.","target":"clinicians managing seronegative celiac patients","evidence_basis":"Convergence of five independent failure mechanisms; AGA 2020 seronegative enteropathy guideline (PMID:33010252) already requires follow-up biopsy"},{"recommendation":"Update major guidelines to include HLA-stratified monitoring recommendations and explicitly acknowledge genotype-dependent serology limitations.","target":"guideline committees (AGA, ACG, BSG, ESPGHAN, ESsCD)","evidence_basis":"Zero current guidelines mention HLA-dependent monitoring performance variation; established diagnostic-phase variation + monitoring gap"},{"recommendation":"Fund the HLA-stratified serology-biopsy concordance study as priority research. Existing cohorts (CADER, Schiepatti, Airaksinen, Sheffield) provide infrastructure.","target":"researchers, funding bodies","evidence_basis":"Zero studies address this directly; strong mechanistic rationale; feasible sample sizes demonstrated"}],"meta_analysis_summary":{"studies_reviewed":38,"total_patients":">36000 cumulative (Choung 24,339; Lebwohl 7,648; Schiepatti 2,211(total)/694(analyzed); Airaksinen 605; Sharkey 391; Coleman 368/201; Lau 217; Mubarak 116; Leonard 103; Packova 82; CADER 76; Galli 65; others)","pooled_estimates":{"IgA_tTG2_sensitivity_persistent_VA_overall":"50% (95% CI 41-60%) — Silvester 2017, 26 studies","EMA_sensitivity_persistent_VA_overall":"45% (95% CI 34-57%)","IgA_tTG2_specificity_persistent_VA":"83% (95% CI 79-87%)","DGP_sensitivity_persistent_VA":"67-78% (Lau 2017, Packova 2020)","persistent_VA_rate_2yr_strict_GFD":"53% (CADER); 23% (Schiepatti, Coleman)","seronegative_among_persistent_VA":"56-75%","tTG_positivity_OR_DQ2_homozygous":"96.9 (95% CI 58.3-147.9)","tTG_positivity_OR_DQ2.5_heterozygous":"36.8 (95% CI 23.3-57.9)","tTG_positivity_OR_DQ2.2_alone":"Not significant","persistent_VA_complication_HR":"9.53 (95% CI 4.77-19.04) — Schiepatti 2023","persistent_VA_mortality_HR":"2.93 (1.43-6.02) Schiepatti 2023 vs 1.01 (0.86-1.19) Lebwohl 2013 — CONTRADICTORY"},"heterogeneity_notes":"High heterogeneity in monitoring sensitivity (individual studies range 0.12-0.75). Key unmeasured sources: (1) HLA genotype distribution — likely most important unmeasured confounder, (2) biopsy timing, (3) adherence verification method, (4) Marsh grade distribution at follow-up, (5) biopsy indication (protocol vs triggered), (6) D1 vs D2-only sampling. Contradictory mortality findings (Lebwohl 2013 vs Schiepatti 2023) may reflect population differences, era effects, or selection bias in who receives follow-up biopsy."}}
