{"research_topic_id":"9.1","research_topic_title":"Neurological Gluten Spectrum — The Hidden Autoimmune Iceberg","date_completed":"2026-02-11","version":"3.0","version_notes":"Final synthesis incorporating twin Opus 4.6 peer review (PMID corrections, Lock et al. reverse causation emphasis, Bristol data reframing, HLA paradox documentation) and Grok 4.1 feedback (persistent modest association framing, seronegative neurological cohort emphasis). All PMIDs verified through peer review process.","executive_summary":"Gut-centric celiac diagnostics create severe verification bias for neurological gluten autoimmunity: IgA-tTG2 sensitivity drops to ~11% without enteropathy, missing ~89% of potential cases. A replicated statistical association between anti-gliadin antibodies and idiopathic ataxia persists after excluding Sheffield data (meta-analysis OR 3.18), but ASSOCIATION DOES NOT PROVE CAUSATION — Lock et al. showed ALL food antibodies (not just AGA) elevated in ataxia patients, supporting possible reverse causation via neurodegeneration-induced gut barrier dysfunction. Anti-tTG6, the proposed specific biomarker, failed independent multicenter validation (Rouvroye 2025, n=683). GFD shows observational benefit with objective MRS markers but from single-center open-label data only — no RCTs exist. A modest real phenomenon likely exists (small subset of idiopathic ataxia/neuropathy, supported by persistent low-titer AGA association even in negative multicenter study at lowered cutoffs), but current evidence cannot establish causation, prevalence, or treatment efficacy with confidence.","key_findings":[{"finding_id":"9.1.1","finding":"Standard IgA-tTG2 serology has catastrophically low sensitivity (~11%) for neurological gluten presentations without enteropathy, compared to >95% in gut-predominant CD. EMA sensitivity drops to 0% without enteropathy","evidence_strength":"strong","quantitative_estimate":"11% sensitivity without enteropathy (Rashtak 2011); 78% with enteropathy; EMA 0% without enteropathy","confidence_interval":null,"key_citations":["PMID:21056914 Rashtak 2011 Mayo Clinic"],"contradicts_guidelines":true,"affected_patient_population":"Neurological-predominant gluten autoimmunity without enteropathy; any patient evaluated with tTG2-first algorithm"},{"finding_id":"9.1.2","finding":"Anti-gliadin antibodies statistically elevated in idiopathic sporadic ataxia across geographic regions — replicated in meta-analysis. HOWEVER, association does not establish causation: Lock et al. found ALL food antibodies elevated in ataxia, suggesting non-specific gut barrier dysfunction rather than gluten-specific pathology","evidence_strength":"moderate-strong for association; weak for causation","quantitative_estimate":"OR 4.28 (95% CI 3.10–5.90) full meta-analysis; OR 3.18 (95% CI 1.79–5.67) excluding Sheffield data","confidence_interval":"3.10–5.90 (full); 1.79–5.67 (excluding Sheffield)","key_citations":["PMID:29866704 Lin & Kuo 2018 meta-analysis (11 studies, 847 cases, 1654 controls)","PMID:16227563 Lock et al. 2005 (all food antibodies elevated)","PMID:17175889 Lock et al. 2006 Bristol population"],"contradicts_guidelines":false,"affected_patient_population":"Idiopathic sporadic ataxia patients — though association may be epiphenomenal"},{"finding_id":"9.1.3","finding":"Anti-tTG6 antibodies: Sheffield reports 73% in gluten ataxia and 40% in newly diagnosed CD, but FAILED independent multicenter validation. Largest independent study (Rouvroye 2025, n=683) found NO elevation vs controls at standard cutoffs. Finnish study found tTG6 not gluten-dependent","evidence_strength":"weak (contradictory replication; failed independent validation)","quantitative_estimate":"Sheffield: 73% sensitivity; Rouvroye 2025: no difference at manufacturer cutoffs; Lindfors 2011: 17% CD vs 15% controls (non-discriminating)","confidence_interval":null,"key_citations":["PMID:23576621 Hadjivassiliou 2013","PMID:40481865 Rouvroye 2025 (n=683)","PMID:21453693 Lindfors 2011 Finnish"],"contradicts_guidelines":true,"affected_patient_population":"All suspected neurological gluten disease — proposed specific marker unavailable and unvalidated"},{"finding_id":"9.1.4","finding":"Enteropathy absent in majority of reported neurological gluten cases (55-76% biopsy-normal), meaning gut-centric diagnostic criteria systematically exclude them. Bristol population study found 4/20 (20%) idiopathic ataxia patients met gluten ataxia criteria — lower than Sheffield's 40% but not negligible","evidence_strength":"moderate","quantitative_estimate":"55-76% of gluten ataxia cohorts have Marsh 0; Bristol: 4/20 idiopathic ataxia (20%) met criteria; Sheffield: ~40%","confidence_interval":null,"key_citations":["PMID:23576621 Hadjivassiliou 2013","PMID:17175889 Lock et al. 2006 Bristol"],"contradicts_guidelines":true,"affected_patient_population":"Enteropathy-negative neurological patients excluded by celiac diagnostic algorithms"},{"finding_id":"9.1.5","finding":"GFD associated with clinical stabilization and objective MRS improvement in observational neurological cohorts. MRS NAA/Cr improved in 98% of strict GFD patients vs 5% with no diet. NO blinded RCTs exist","evidence_strength":"weak (open-label single-center; no RCTs)","quantitative_estimate":"98% MRS improvement in 63 strict GFD vs 26% partial GFD vs 5% in 19 no-GFD (all open-label, single-center)","confidence_interval":null,"key_citations":["PMID:28724585 Hadjivassiliou 2017 MRS study"],"contradicts_guidelines":false,"affected_patient_population":"AGA-positive neurological patients — treatment evidence limited to Sheffield cohorts"},{"finding_id":"9.1.6","finding":"Tissue transglutaminase isoform-specific B-cell responses proven for tTG2/tTG3 axis: entirely separate B-cell clones with distinct V-gene usage, driven by shared gluten-specific T-cell help (hapten-carrier model). Extension to tTG6 is biologically plausible but NOT directly proven — no tTG6-specific B-cell clones isolated","evidence_strength":"strong for tTG2/tTG3 separation; moderate for tTG6 extension (theoretical)","quantitative_estimate":null,"confidence_interval":null,"key_citations":["PMID:37424036 Das/Iversen/Sollid 2023"],"contradicts_guidelines":false,"affected_patient_population":"All gluten-related autoimmune disease — theoretical framework for organ-specific targeting"},{"finding_id":"9.1.7","finding":"MR spectroscopy (NAA/Cr ratio) detects cerebellar dysfunction in 100% of Sheffield gluten ataxia patients and 47% of newly diagnosed CD — independent of antibody status. Most sensitive available objective biomarker, but NOT independently replicated outside Sheffield","evidence_strength":"moderate (single-center, internally consistent but no independent replication)","quantitative_estimate":"100% abnormal in gluten ataxia; 47% abnormal in newly diagnosed CD; improvement in 98% on strict GFD","confidence_interval":null,"key_citations":["PMID:28724585 Hadjivassiliou 2017"],"contradicts_guidelines":false,"affected_patient_population":"Suspected gluten ataxia including seronegative patients — bypasses antibody detection limitations"},{"finding_id":"9.1.8","finding":"AGA association with neurological disease is CUTOFF-DEPENDENT: Rouvroye 2025 multicenter showed no difference at manufacturer cutoffs; only at lowered threshold (3 U/mL) did modest differences emerge. This cutoff manipulation inflates prevalence estimates and is a previously under-recognized source of heterogeneity","evidence_strength":"moderate (for cutoff-dependency finding itself)","quantitative_estimate":"At 3 U/mL: AGA-IgA 20.8% vs 12.8% controls (p=0.017); AGA-IgG 7.6% vs 2.6% (p=0.013). At standard cutoffs: no significant difference","confidence_interval":null,"key_citations":["PMID:40481865 Rouvroye 2025"],"contradicts_guidelines":false,"affected_patient_population":"All studies using lowered AGA cutoffs — affects prevalence estimates globally"},{"finding_id":"9.1.9","finding":"HLA-DQ2 frequency paradox: Sheffield reports 72% DQ2 in gluten ataxia, but Rodrigo (Spain) found only 32.2% — virtually identical to NCGS (29.7%) and dramatically lower than CD (89.6%). Both cannot be correct for the same disease entity. If DQ2 frequency is truly ~32%, the canonical hapten-carrier model requiring HLA-DQ2-restricted T-cell help can explain only a minority of cases","evidence_strength":"moderate (conflicting center-specific data; fundamental implication for disease mechanism)","quantitative_estimate":"Sheffield: 72% DQ2; Rodrigo: 32.2% DQ2 in GA vs 89.6% in CD vs 29.7% in NCGS","confidence_interval":null,"key_citations":["PMID:26676361 Rodrigo et al. 2015","PMID:12566288 Hadjivassiliou et al. 2003"],"contradicts_guidelines":false,"affected_patient_population":"Gluten ataxia patients — classification as CD manifestation vs NCGS vs novel entity depends on HLA frequency"},{"finding_id":"9.1.10","finding":"AAN practice parameter for distal symmetric polyneuropathy (2009, reaffirmed) ENTIRELY OMITS celiac serology from recommended workup. No AAN guideline for sporadic ataxia includes gluten screening. Meanwhile, ESsCD 2019 recommends testing neurological patients for CD — creating a complete interdisciplinary disconnect where GI tells neurology to test but neurology's own guidelines do not include the test","evidence_strength":"strong (guideline gap is factual and verifiable)","quantitative_estimate":null,"confidence_interval":null,"key_citations":["PMID:19056666 AAN 2009 DSP practice parameter"],"contradicts_guidelines":true,"affected_patient_population":"All patients with idiopathic ataxia or neuropathy seen by neurologists following AAN guidelines"},{"finding_id":"9.1.11","finding":"Persistent modest AGA association in Rouvroye 2025 multicenter (significant at lowered cutoffs despite negative at standard cutoffs) supports existence of a SMALL overlooked population even after accounting for bias inflation. This aligns with residual meta-analytic OR ~3 after excluding Sheffield, suggesting 10-25% prevalence in idiopathic sporadic ataxias at most","evidence_strength":"weak-moderate","quantitative_estimate":"Residual OR ~3 (excluding Sheffield); low-titer AGA elevation at 3 U/mL in subset; estimated true prevalence 10-25% of idiopathic sporadic ataxias","confidence_interval":"1.79–5.67 for AGA-ataxia association excluding Sheffield","key_citations":["PMID:40481865 Rouvroye 2025","PMID:29866704 Lin 2018 meta-analysis"],"contradicts_guidelines":false,"affected_patient_population":"Small subset of idiopathic ataxia patients — lower than Sheffield claims but non-trivial"}],"biases_documented":[{"bias_type":"verification bias","description":"Serology-first diagnostic algorithms rarely pursue biopsy or alternative markers in tTG2-negative neurological patients. IgA-tTG2 sensitivity drops to ~11% without enteropathy, but neurologists using negative tTG2 to 'exclude' CD are applying a test with ~89% false-negative rate in their target population. Diagnostic cascade halts, creating invisible population","magnitude_estimate":"~89% false-negative rate for tTG2 IgA in neurological presentations without enteropathy","evidence_sources":["PMID:21056914 Rashtak 2011"]},{"bias_type":"single-center/referral bias","description":">80% of foundational gluten ataxia, tTG6, and GFD treatment literature originates from Sheffield tertiary referral center, which advertises expertise in gluten ataxia. Patients with suspected gluten-related disease preferentially referred there. High prevalence estimates (40% of sporadic ataxia) NOT replicated by any independent center. Bristol population: 4/20 idiopathic ataxia (20%) met criteria — meaningful but substantially lower","magnitude_estimate":"Sheffield 40% vs 0-27% non-Sheffield centers; largest independent study (n=683) found no association at standard cutoffs","evidence_sources":["PMID:40481865 Rouvroye 2025","PMID:21453693 Lindfors 2011","PMID:17175889 Lock 2006 Bristol","PMID:29866704 Lin 2018 meta-analysis sensitivity test"]},{"bias_type":"circular diagnostic definition","description":"Early gluten ataxia diagnostic criteria partly required positive AGA, making AGA sensitivity 100% by construction. This inflates diagnostic performance metrics and creates unfalsifiable diagnostic category — any idiopathic ataxia patient with coincidental AGA positivity (5-12% background rate) qualifies","magnitude_estimate":"With 5-12% background AGA positivity, any cohort of ~100 idiopathic ataxia patients will contain 5-12 coincidentally AGA-positive patients meeting diagnostic criteria","evidence_sources":["Hadjivassiliou diagnostic criteria analysis"]},{"bias_type":"assay cutoff bias","description":"Positive AGA-neurological associations in several studies depend on using non-standard lowered cutoffs (3 U/mL vs manufacturer-recommended 7-10 U/mL). At standard cutoffs, Rouvroye 2025 found no difference vs controls. Lowering cutoffs increases sensitivity at cost of increased false positives with unknown clinical relevance","magnitude_estimate":"At manufacturer cutoffs: no association; at 3 U/mL: modest AGA elevation (20.8% vs 12.8%)","evidence_sources":["PMID:40481865 Rouvroye 2025"]},{"bias_type":"marker nonspecificity / reverse causation","description":"Lock et al. (2005) found ALL food antibodies — not just anti-gliadin — elevated in ataxia patients. AGA also elevated in 44% of Huntington's disease (genetic, no plausible gluten etiology) and 43% of hereditary ataxias. This suggests non-specific gut barrier dysfunction secondary to neurodegeneration, rather than gluten-specific immune targeting causing neurodegeneration. The REVERSE CAUSATION hypothesis (neurodegeneration → gut barrier dysfunction → food antibody elevation) is untested but biologically plausible via autonomic dysfunction","magnitude_estimate":"Fundamental challenge to gluten-specificity — potentially invalidates AGA as disease-defining marker","evidence_sources":["PMID:16227563 Lock et al. 2005","Bushara: 44% AGA in Huntington's","43% AGA in hereditary ataxias"]},{"bias_type":"assay validation/commercial interest concentration","description":"Anti-tTG6 exists as research-use-only ELISA (Zedira GmbH) with no FDA clearance or CE-IVD marking. Principal researcher (Hadjivassiliou) co-developed IP with Zedira; collaborator (Aeschlimann) listed as scientific advisor. Positive performance limited to inventors' lab. Financial magnitude undocumented. Does not invalidate research but concentrates innovation-validation-commercialization in interconnected parties","magnitude_estimate":"Failed independent replication in two largest non-Sheffield studies (Finland n=untreated CD, Netherlands n=683 neurological)","evidence_sources":["PMID:40481865 Rouvroye 2025","PMID:21453693 Lindfors 2011","Zedira product listings","Publication COI disclosures"]}],"unproven_assumptions_identified":[{"assumption":"Enteropathy required for diagnosis of gluten-related autoimmune neurological disease","evidence_against":"Reported isolated tTG6-positive cases with HLA risk and GFD response; post-mortem cerebellar tTG6 deposits without enteropathy; dermatitis herpetiformis precedent (skin targeting without gut disease in ~20%)","evidence_for":"Current guideline definitions (Oslo, ACG, ESsCD) tie CD to enteropathy; neurological disease without enteropathy overlaps diagnostically with NCGS; Rodrigo data profiles GA as NCGS not CD","clinical_impact":"Excludes potential treatable condition for enteropathy-negative neurological patients; halts diagnostic investigation at negative tTG2"},{"assumption":"AGA positivity in ataxia patients implies gluten is CAUSING the ataxia","evidence_against":"Lock et al. showed ALL food antibodies elevated — not gluten-specific. AGA elevated in Huntington's (44%) and hereditary ataxias (43%) with no plausible gluten etiology. Neurodegenerative autonomic dysfunction can increase gut permeability secondarily. No demonstration that eliminating AGA via GFD reverses ataxia in controlled conditions (no RCTs)","evidence_for":"Replicated statistical association across centers (OR ~3 excluding Sheffield); biological plausibility via tissue-specific TG autoimmunity; MRS improvement on GFD in open-label studies","clinical_impact":"If AGA is epiphenomenal (reverse causation), current diagnostic criteria for gluten ataxia based on AGA are fundamentally flawed and GFD recommendations may benefit only a small true-positive subset"},{"assumption":"Anti-tTG6 is a validated, standardized biomarker ready for clinical use","evidence_against":"Only RUO ELISA available (Zedira); no FDA/CE-IVD clearance; Finnish study showed no gluten-dependency; Dutch multicenter showed no elevation at standard cutoffs; no international proficiency testing; assay works primarily in inventors' lab","evidence_for":"Sheffield single-center cohorts report 73% sensitivity and 95-96% specificity; biologically plausible target based on tTG6 cerebellar expression and SCA35 precedent","clinical_impact":"Risk of overdiagnosis at lowered cutoffs in Sheffield-validated settings; missed cases everywhere else where assay unavailable; no basis for clinical deployment"},{"assumption":"GFD benefit in neurological disease is proven beyond placebo/expectation effects","evidence_against":"No blinded RCTs for any neurological indication; all evidence open-label single-center; controls were self-selected diet-refusers (introducing selection bias). Regression to mean and nocebo effects in unblinded controls not controlled","evidence_for":"Objective MRS improvement (hard to fake); NCS improvement in neuropathy (electrophysiological); dose-response relationship (strict > partial > none); biological plausibility","clinical_impact":"Cannot definitively distinguish genuine treatment effect from placebo/expectation effects in subjective neurological outcomes. MRS data provides strongest argument against pure placebo but is from single center"},{"assumption":"The hapten-carrier model extends from tTG2/tTG3 to tTG6 — same T-cell help drives anti-tTG6 B-cell responses","evidence_against":"No tTG6-specific B-cell clones isolated; no BCR knock-in mouse model for tTG6; Tarlac 2013 HLA-DR3-DQ2 transgenic mice with high-titer AGA showed NO cerebellar damage; HLA-DQ2 frequency only 32% in one GA cohort (Rodrigo) — if HLA-restricted T-cell help is required, 68% of cases unexplained","evidence_for":"Proven for tTG2/tTG3 axis (Das/Sollid 2023); tTG6 is structural homolog of tTG2; cerebellar IgA deposits contain tTG6; CSF anti-tTG6 IgA suggests class-switched adaptive immunity","clinical_impact":"If model doesn't extend to tTG6, neurological targeting may require different mechanistic explanation (innate immunity, molecular mimicry, or non-tTG6-mediated adaptive responses)"}],"overlooked_populations":[{"population":"Patients with idiopathic ataxia/neuropathy, negative IgA-tTG2, no further gluten-related investigation, potentially HLA-DQ2/DQ8 positive","estimated_size":"Modest subset: meta-analysis OR ~3 for AGA positivity excluding Sheffield suggests real but small proportion. Estimated 10-25% of idiopathic sporadic ataxias at most. Persistent low-titer AGA association in Rouvroye 2025 (at lowered cutoffs) supports existence of small overlooked population even in negative multicenter study","why_missed":"Diagnostic pathways halt at negative tTG2; no routine tTG6 or low-threshold AGA testing in neurology; AAN guidelines omit gluten screening entirely; GI-neurology guideline disconnect; AGA (most sensitive available marker) abandoned by GI guidelines due to poor gut-specificity but never adopted by neurology","proposed_solution":"Low-cost AGA IgG + HLA screening in idiopathic sporadic ataxia/neuropathy workup; MR spectroscopy as antibody-independent objective marker; supervised GFD trial in selected high-suspicion cases with objective monitoring (MRS, ataxia rating scales, NCS)"},{"population":"Immunoglobulin-deficient seronegative CD patients (reference profile: DQ8, Marsh 3A, all serology <1, low IgG1, low secretory IgA) at risk for neurological involvement that is undetectable by ANY antibody test","estimated_size":"6-9% of all CD is seronegative; unknown neurological fraction. Mechanistically plausible that impaired humoral response reduces ALL antibody-based markers including anti-tTG6","why_missed":"IgG1 deficiency impairs both mucosal IgA production (via Siniscalco 2025 sequential switching IgM→IgG1→IgA) AND IgG-class anti-tTG6 production. Patient invisible to BOTH gut serology AND any future commercial neural serology. Combined low IgG1 + low sIgA = double jeopardy for antibody detection across all isotypes. Even CSF anti-tTG6 testing (Floare 2025) may be false-negative if intrathecal antibody production requires intact IgA class switching","proposed_solution":"Antibody-independent neurological monitoring: baseline cerebellar MRS (NAA/Cr), detailed neurological examination (gait, coordination, nystagmus, dysarthria, sensory testing), nerve conduction studies if sensory symptoms develop, skin biopsy for IENFD if small fiber neuropathy suspected. T-cell-based diagnostics (IL-2 release assay, HLA-DQ:gluten tetramers) would bypass antibody production bottleneck entirely. Strict GFD monitoring via objective measures, not serology"},{"population":"HLA-DQ2/DQ8-negative patients with gluten-responsive neurological disease","estimated_size":"Rodrigo data: ~68% of gluten ataxia patients lacked DQ2; combined DQ2+DQ8 frequency in GA series uncertain but likely leaves substantial HLA-negative fraction","why_missed":"Cannot be explained by canonical hapten-carrier model requiring HLA-restricted T-cell help. May represent innate immune responses to wheat components (ATIs via TLR4), but innate mechanisms cannot produce tTG autoantibodies. Occupies diagnostic no-man's-land between CD (requires HLA) and NCGS (no adaptive autoimmunity)","proposed_solution":"Systematic reporting of combined DQ2+DQ8 frequency in all gluten ataxia studies. Investigation of ATI-TLR4-innate immune pathway in HLA-negative neurological patients. Separate analysis of treatment response by HLA status"}],"diagnostic_step_sensitivity":{"step_name":"IgA-tTG2 serology in neurological gluten disease","reported_sensitivity":">95% in gut-predominant CD (dominated by seropositive-identified cohorts with verification bias)","adjusted_sensitivity":"~11% without enteropathy (Rashtak 2011); ~78% with enteropathy; EMA: 0% without enteropathy. Anti-tTG6 (proposed specific neural marker): 73% Sheffield but 18% Finland and not significant Netherlands at standard cutoffs. AGA IgG: 60-100% in Sheffield neurological cohorts but 5-12% in healthy controls (specificity problem). For reference patient (IgG1-deficient, low sIgA): effectively approaching 100% false-negative expected for ALL serum antibody tests","false_negative_rate":"~89% for tTG2 IgA without enteropathy; ~22% with enteropathy. Anti-tTG6: unknown outside Sheffield. AGA: depends entirely on cutoff — at standard cutoffs, most studies show no difference from controls","key_limitations":["Verification bias in denominator — only seropositive patients routinely biopsied","Organ-specific tTG6 targeting bypasses tTG2-based tests entirely","Anti-tTG6 not commercially available — Sheffield in-house assay only (Zedira RUO)","Anti-tTG6 failed independent validation (Finland, Netherlands)","AGA nonspecific — elevated in Huntington's 44%, hereditary ataxias 43%, healthy controls 5-12%","ALL food antibodies elevated in ataxia (Lock et al.) — not gluten-specific","Assay cutoff dependency: positive associations emerge only at lowered non-standard cutoffs","Impaired humoral response (IgG1 deficiency, IgA deficiency) further reduces sensitivity of all antibody tests","No RCT evidence for any serological marker in neurological diagnosis"]},"contradictory_studies":[{"citation":"Rouvroye et al. 2025 Dutch multicenter","pmid":"40481865","finding":"No elevation of anti-TG6, anti-TG2, or anti-gliadin in 476 patients with idiopathic neuropathy/ataxia vs 195 controls at manufacturer cutoffs (n=683 total). Only at non-standard lowered cutoff (3 U/mL) were modest AGA differences seen. Largest independent study directly contradicting Sheffield tTG6 utility","contradicts":"Sheffield high-prevalence claims (40% sporadic ataxia) and tTG6 biomarker utility"},{"citation":"Lock et al. 2005/2006 Bristol","pmid":"16227563","finding":"ALL food antibodies (not just anti-gliadin) elevated in ataxia patients. Only 4 cases from 2M population catchment met gluten ataxia criteria (4/20 idiopathic ataxia = 20%). Suggests non-specific gut barrier dysfunction rather than gluten-specific immune targeting — MOST IMPORTANT skeptical finding challenging gluten-specificity assumption","contradicts":"Sheffield hypothesis that AGA in ataxia reflects gluten-specific immune targeting; specificity of gluten as causal agent"},{"citation":"Lindfors et al. 2011 Finnish (Tampere)","pmid":"21453693","finding":"tTG6-IgA did not distinguish CD patients with neurological symptoms from those without; 15% positive in non-celiac controls (vs 17% in untreated CD); not gluten-dependent","contradicts":"Sheffield gluten-dependency paradigm for tTG6; diagnostic specificity of anti-tTG6"},{"citation":"Rodrigo et al. 2015 Spain","pmid":"26676361","finding":"Gluten ataxia (n=31) profiled as NCGS not CD: tTG2+ only 3.2%, HLA-DQ2+ only 32.2%, Marsh 1 only 9.6% — virtually identical to NCGS and dramatically different from CD. Challenges classification as CD manifestation","contradicts":"Classification of gluten ataxia as autoimmune CD manifestation; hapten-carrier model requiring HLA-DQ2"},{"citation":"Tarlac et al. 2013 Melbourne","pmid":"23086706","finding":"HLA-DR3-DQ2 transgenic mice with high-titer AGA did NOT develop ataxia or cerebellar damage. Negative animal model for AGA-mediated neurodegeneration","contradicts":"Causality of anti-gliadin antibodies in cerebellar damage. Note: model limitations include murine vs human cerebellum and absence of tTG6 autoimmunity"},{"citation":"Abele et al. 2003 Bonn","pmid":"12771263","finding":"No statistically significant difference in AGA prevalence between sporadic ataxia patients (19%) and controls (8%)","contradicts":"Sheffield prevalence estimates of 41% AGA in sporadic ataxia"},{"citation":"Wong et al. 2007","pmid":"17598597","finding":"AGA prevalence 14% in sporadic ataxia vs 8% in controls — not statistically significant (p=0.44)","contradicts":"Sheffield prevalence and strength of AGA-ataxia association"}],"research_gaps":[{"gap":"No blinded randomized controlled trial of GFD for any neurological gluten indication — all treatment evidence from open-label single-center studies","importance":"high","proposed_study_design":"Double-blind RCT (GFD vs carefully matched gluten-containing sham GFD) in AGA-positive idiopathic ataxia patients, stratified by HLA type and tTG6 status. Primary endpoint: SARA score change at 12 months. Secondary: MRS NAA/Cr, NCS. Minimum n=60 per arm"},{"gap":"No multicenter independent validation of anti-tTG6 assay using Sheffield's exact protocol and cutoffs — Finnish and Dutch studies used potentially different methodologies","importance":"high","proposed_study_design":"International blinded comparison: split samples to Sheffield + 3+ independent labs using identical recombinant tTG6 antigen and cutoff determination. Include healthy, CD, genetic ataxia, and idiopathic ataxia cohorts"},{"gap":"Reverse causation hypothesis untested: do neurodegenerative diseases cause gut barrier dysfunction leading to non-specific food antibody elevation?","importance":"high","proposed_study_design":"Measure intestinal permeability (lactulose:mannitol), multiple food antibodies (not just AGA), fecal calprotectin in genetic ataxias (SCA1-3, Friedreich's), idiopathic ataxia, and healthy controls. If ALL food antibodies elevated with increased permeability in genetic ataxias, supports reverse causation"},{"gap":"Biopsy-independent and serology-independent prospective ascertainment — needed to quantify true verification bias magnitude","importance":"high","proposed_study_design":"HLA-stratified screening of consecutive idiopathic ataxia/neuropathy patients with tTG6, AGA, MRS, and supervised GFD trial regardless of serology results. Would provide first unbiased denominator"},{"gap":"T-cell-based diagnostics that bypass antibody production entirely for neurological gluten disease — critical for immunodeficient patients","importance":"high","proposed_study_design":"Apply IL-2 whole blood assay or HLA-DQ:gluten tetramers to suspected neurological gluten disease cohorts. Would detect gluten-specific T-cell activation regardless of humoral immune status. Particularly relevant for reference patient profile"},{"gap":"HLA-DQ2/DQ8 combined frequency in gluten ataxia inconsistently reported (32% DQ2 Rodrigo vs 72% Sheffield) — critical for evaluating hapten-carrier mechanism applicability","importance":"medium","proposed_study_design":"Systematic review and meta-analysis of HLA typing in all published GA cohorts, with separate analysis by center and diagnostic criteria. Report combined DQ2+DQ8+half-DQ2 frequencies"},{"gap":"Effect of IgG subclass deficiency on anti-tTG6 production — relevant to reference patient profile and broader seronegative CD population","importance":"medium","proposed_study_design":"IgG subclass profiling in gluten ataxia patients correlated with tTG6 titers and isotype. Would reveal whether IgG1 deficiency creates blind spot for tTG6 serology"},{"gap":"Tissue-specific targeting mechanisms (brain vs gut vs skin) in gluten autoimmunity","importance":"medium","proposed_study_design":"Longitudinal B-cell repertoire analysis in patients developing sequential organ manifestations; naive BCR characterization in patients with different tissue targeting"}],"differential_diagnoses_relevant":[{"condition":"Non-specific gut barrier dysfunction secondary to neurodegeneration (reverse causation)","overlap_with_cd":"Elevated AGA (IgG and/or IgA) — the primary screening marker for gluten ataxia. If neurodegeneration causes secondary gut permeability increase via autonomic dysfunction, AGA may be epiphenomenon not cause","distinguishing_features":"Lock et al.: ALL food antibodies elevated, not just AGA. Genetic ataxia diagnosis (SCA typing) would exclude gluten cause. Lack of GFD response. Elevated food antibodies in Huntington's disease (genetic, no gluten etiology)"},{"condition":"Non-celiac gluten/wheat sensitivity (NCGS)","overlap_with_cd":"GFD response, possible neurological symptoms, low tTG2/HLA rates in gluten ataxia (Rodrigo 2015 profiles GA as NCGS). Only 16-30% of NCGS survive double-blind placebo challenge","distinguishing_features":"No adaptive autoantibodies or enteropathy; weaker HLA association; proposed innate mechanism (ATIs via TLR4); possible fructan confounding"},{"condition":"Other immune-mediated ataxias (anti-GAD65, paraneoplastic anti-Yo/Hu)","overlap_with_cd":"Progressive cerebellar ataxia, possible cerebellar atrophy, autoimmune mechanism","distinguishing_features":"Specific alternative antibodies commercially available and validated; potential underlying malignancy in paraneoplastic; T1D association with GAD65; no GFD response"},{"condition":"Idiopathic sporadic ataxia (genuinely idiopathic subset with coincidental AGA)","overlap_with_cd":"Progressive cerebellar dysfunction; may have coincidental AGA positivity (5-12% background rate) without causal relationship","distinguishing_features":"Would not respond to GFD; AGA positivity is coincidental (base rate ~10%); if treated with GFD, any improvement may reflect placebo/regression to mean"}],"recommendations":[{"recommendation":"Include low-cost celiac/gluten serological screening (minimum IgA-tTG2 + AGA IgG) in the workup of ALL idiopathic sporadic ataxias and unexplained peripheral neuropathies, despite AGA's limitations — the cost of screening is minimal and the potential benefit of identifying a treatable etiology is significant","target":"Neurologists, AAN guideline committees","evidence_basis":"Replicated meta-analytic association (OR 3.18 excluding Sheffield); GI guidelines already recommend this but neurology guidelines omit it; minimal cost/risk of screening vs potential for treatable etiology"},{"recommendation":"Avoid routine clinical use of anti-tTG6 testing until assay standardization and independent multicenter validation are completed. Current RUO status and failed replication do not support clinical deployment","target":"Clinicians, diagnostic laboratories","evidence_basis":"Only RUO ELISA available; contradictory replication (Finland, Netherlands); cutoff-dependent results; concentrated innovation-validation-commercialization relationships"},{"recommendation":"For immunoglobulin-deficient seronegative CD patients (reference profile), use antibody-independent tools for neurological monitoring: cerebellar MRS (NAA/Cr), detailed neurological examination, NCS. Do NOT rely on negative tTG6 or any serology to exclude neurological autoimmunity","target":"Clinicians managing seronegative CD with IgG1 deficiency","evidence_basis":"IgG1 deficiency + low sIgA = impaired production of ALL antibody classes including anti-tTG6 (both IgA and IgG). MRS abnormal in 100% of Sheffield gluten ataxia regardless of antibody status — only antibody-independent objective marker available"},{"recommendation":"ESsCD, ACG, AAN, and neurology societies should develop joint interdisciplinary guidelines explicitly addressing enteropathy-independent neurological presentations and the limitations of tTG2 in this population","target":"Guideline committees — joint GI/neurology","evidence_basis":"Current disconnect: GI guidelines recommend neurological testing but neurology guidelines omit gluten screening. tTG2 sensitivity ~11% without enteropathy. No existing guideline addresses diagnostic approach for enteropathy-negative neurological cases"},{"recommendation":"Prioritize three study types to resolve field's central uncertainties: (1) multicenter double-blind RCT of GFD with objective endpoints, (2) international tTG6 assay validation with split samples, (3) reverse causation study measuring ALL food antibodies + gut permeability in genetic ataxias","target":"Research funders, investigators","evidence_basis":"Field's credibility depends on controlled evidence; current observational single-center evidence base insufficient to establish causation, prevalence, or treatment efficacy"},{"recommendation":"The Lock et al. 'all food antibodies elevated' finding and the reverse causation hypothesis should be considered a critical alternative explanation in ALL future gluten-ataxia research and should be tested directly","target":"Researchers in neurological gluten disease","evidence_basis":"PMID:16227563 — foundational challenge to gluten-specificity; AGA elevated in 44% Huntington's; untested hypothesis with major implications for field validity"}],"meta_analysis_summary":{"studies_reviewed":"~70 primary papers + reviews/meta-analyses","total_patients":">7000 across key cohorts and meta-analyses","pooled_estimates":{"AGA_ataxia_OR_full":"4.28 (95% CI 3.10–5.90) — Lin 2018, 11 studies, 847 cases, 1654 controls","AGA_ataxia_OR_excluding_Sheffield":"3.18 (95% CI 1.79–5.67) — residual association persists","tTG2_sensitivity_neuro_without_enteropathy":"~11% (Rashtak 2011)","tTG2_sensitivity_neuro_with_enteropathy":"~78% (Rashtak 2011)","EMA_sensitivity_without_enteropathy":"0%","tTG6_sensitivity_Sheffield_gluten_ataxia":"73% (Hadjivassiliou 2013)","tTG6_independent_validation":"Failed — no difference at standard cutoffs (Rouvroye 2025 n=683); 18% in Finnish CD (Lindfors 2011)","AGA_cutoff_dependency":"No association at manufacturer cutoffs; modest association at 3 U/mL (Rouvroye 2025)","HLA_DQ2_in_gluten_ataxia":"72% Sheffield vs 32.2% Rodrigo — discrepant","GFD_MRS_response":"98% improvement strict GFD vs 5% no diet (single-center, open-label, n=82)","estimated_true_prevalence":"10-25% of idiopathic sporadic ataxias (adjusted for referral/cutoff bias)"},"heterogeneity_notes":"Extreme heterogeneity across studies from multiple sources: center/referral bias (Sheffield vs all others), marker evolution (AGA→tTG6), assay cutoff variation (manufacturer vs lowered 3 U/mL), circular diagnostic definitions in early cohorts, ascertainment bias, and newly recognized cutoff dependency (Rouvroye 2025). The single-center dominance of positive findings vs multicenter negative findings is the defining feature of this evidence base. The reverse causation hypothesis (Lock et al.) introduces fundamental uncertainty about whether the association reflects causation at all."}}
